// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: VROSC.AdjustableMeshColors
#include "VROSC/AdjustableMeshColors.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: VROSC
namespace VROSC {
  // Forward declaring type: AdjustableMesh
  class AdjustableMesh;
}
// Completed forward declares
// Type namespace: VROSC
namespace VROSC {
  // Forward declaring type: AdjustableMeshColor16bits
  class AdjustableMeshColor16bits;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::VROSC::AdjustableMeshColor16bits);
DEFINE_IL2CPP_ARG_TYPE(::VROSC::AdjustableMeshColor16bits*, "VROSC", "AdjustableMeshColor16bits");
// Type namespace: VROSC
namespace VROSC {
  // Size: 0x44
  #pragma pack(push, 1)
  // Autogenerated type: VROSC.AdjustableMeshColor16bits
  // [TokenAttribute] Offset: FFFFFFFF
  class AdjustableMeshColor16bits : public ::VROSC::AdjustableMeshColors {
    public:
    public:
    // private UnityEngine.Color[] _colors
    // Size: 0x8
    // Offset: 0x20
    ::ArrayW<::UnityEngine::Color> colors;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Color>) == 0x8);
    // private UnityEngine.Color[] _originalColors
    // Size: 0x8
    // Offset: 0x28
    ::ArrayW<::UnityEngine::Color> originalColors;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Color>) == 0x8);
    // private UnityEngine.Color[] _adjustedColors
    // Size: 0x8
    // Offset: 0x30
    ::ArrayW<::UnityEngine::Color> adjustedColors;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Color>) == 0x8);
    // private UnityEngine.Color[] _shownColors
    // Size: 0x8
    // Offset: 0x38
    ::ArrayW<::UnityEngine::Color> shownColors;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Color>) == 0x8);
    // private System.Single _multiplyValue
    // Size: 0x4
    // Offset: 0x40
    float multiplyValue;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    public:
    // Get instance field reference: private UnityEngine.Color[] _colors
    [[deprecated("Use field access instead!")]] ::ArrayW<::UnityEngine::Color>& dyn__colors();
    // Get instance field reference: private UnityEngine.Color[] _originalColors
    [[deprecated("Use field access instead!")]] ::ArrayW<::UnityEngine::Color>& dyn__originalColors();
    // Get instance field reference: private UnityEngine.Color[] _adjustedColors
    [[deprecated("Use field access instead!")]] ::ArrayW<::UnityEngine::Color>& dyn__adjustedColors();
    // Get instance field reference: private UnityEngine.Color[] _shownColors
    [[deprecated("Use field access instead!")]] ::ArrayW<::UnityEngine::Color>& dyn__shownColors();
    // Get instance field reference: private System.Single _multiplyValue
    [[deprecated("Use field access instead!")]] float& dyn__multiplyValue();
    // private System.Void CalculateColorMultiplication()
    // Offset: 0x966E54
    void CalculateColorMultiplication();
    // public System.Void .ctor(VROSC.AdjustableMesh adjustableMesh)
    // Offset: 0x9665B8
    // Implemented from: VROSC.AdjustableMeshColors
    // Base method: System.Void AdjustableMeshColors::.ctor(VROSC.AdjustableMesh adjustableMesh)
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static AdjustableMeshColor16bits* New_ctor(::VROSC::AdjustableMesh* adjustableMesh) {
      static auto ___internal__logger = ::Logger::get().WithContext("::VROSC::AdjustableMeshColor16bits::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<AdjustableMeshColor16bits*, creationType>(adjustableMesh)));
    }
    // public override System.Void SetColor(UnityEngine.Color color)
    // Offset: 0x966F54
    // Implemented from: VROSC.AdjustableMeshColors
    // Base method: System.Void AdjustableMeshColors::SetColor(UnityEngine.Color color)
    void SetColor(::UnityEngine::Color color);
    // public override System.Void Tint(UnityEngine.Color color, System.Single amount)
    // Offset: 0x967100
    // Implemented from: VROSC.AdjustableMeshColors
    // Base method: System.Void AdjustableMeshColors::Tint(UnityEngine.Color color, System.Single amount)
    void Tint(::UnityEngine::Color color, float amount);
  }; // VROSC.AdjustableMeshColor16bits
  #pragma pack(pop)
  static check_size<sizeof(AdjustableMeshColor16bits), 64 + sizeof(float)> __VROSC_AdjustableMeshColor16bitsSizeCheck;
  static_assert(sizeof(AdjustableMeshColor16bits) == 0x44);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: VROSC::AdjustableMeshColor16bits::CalculateColorMultiplication
// Il2CppName: CalculateColorMultiplication
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::AdjustableMeshColor16bits::*)()>(&VROSC::AdjustableMeshColor16bits::CalculateColorMultiplication)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(VROSC::AdjustableMeshColor16bits*), "CalculateColorMultiplication", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: VROSC::AdjustableMeshColor16bits::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
// Writing MetadataGetter for method: VROSC::AdjustableMeshColor16bits::SetColor
// Il2CppName: SetColor
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::AdjustableMeshColor16bits::*)(::UnityEngine::Color)>(&VROSC::AdjustableMeshColor16bits::SetColor)> {
  static const MethodInfo* get() {
    static auto* color = &::il2cpp_utils::GetClassFromName("UnityEngine", "Color")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(VROSC::AdjustableMeshColor16bits*), "SetColor", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{color});
  }
};
// Writing MetadataGetter for method: VROSC::AdjustableMeshColor16bits::Tint
// Il2CppName: Tint
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::AdjustableMeshColor16bits::*)(::UnityEngine::Color, float)>(&VROSC::AdjustableMeshColor16bits::Tint)> {
  static const MethodInfo* get() {
    static auto* color = &::il2cpp_utils::GetClassFromName("UnityEngine", "Color")->byval_arg;
    static auto* amount = &::il2cpp_utils::GetClassFromName("System", "Single")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(VROSC::AdjustableMeshColor16bits*), "Tint", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{color, amount});
  }
};
