// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: System.Enum
#include "System/Enum.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
}
// Forward declaring namespace: VROSC
namespace VROSC {
  // Forward declaring type: Metronome
  class Metronome;
  // Forward declaring type: BeatCounterUI
  class BeatCounterUI;
  // Skipping declaration: SyncSource because it is already included!
  // Forward declaring type: UserDataControllers
  class UserDataControllers;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: AudioSource
  class AudioSource;
}
// Completed forward declares
// Type namespace: VROSC
namespace VROSC {
  // Forward declaring type: BeatCounter
  class BeatCounter;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::VROSC::BeatCounter);
DEFINE_IL2CPP_ARG_TYPE(::VROSC::BeatCounter*, "VROSC", "BeatCounter");
// Type namespace: VROSC
namespace VROSC {
  // Size: 0x66
  #pragma pack(push, 1)
  // Autogenerated type: VROSC.BeatCounter
  // [TokenAttribute] Offset: FFFFFFFF
  class BeatCounter : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::VROSC::BeatCounter::SyncSource
    struct SyncSource;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: VROSC.BeatCounter/VROSC.SyncSource
    // [TokenAttribute] Offset: FFFFFFFF
    struct SyncSource/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: SyncSource
      constexpr SyncSource(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public VROSC.BeatCounter/VROSC.SyncSource Looper
      static constexpr const int Looper = 0;
      // Get static field: static public VROSC.BeatCounter/VROSC.SyncSource Looper
      static ::VROSC::BeatCounter::SyncSource _get_Looper();
      // Set static field: static public VROSC.BeatCounter/VROSC.SyncSource Looper
      static void _set_Looper(::VROSC::BeatCounter::SyncSource value);
      // static field const value: static public VROSC.BeatCounter/VROSC.SyncSource BeatCounter
      static constexpr const int BeatCounter = 1;
      // Get static field: static public VROSC.BeatCounter/VROSC.SyncSource BeatCounter
      static ::VROSC::BeatCounter::SyncSource _get_BeatCounter();
      // Set static field: static public VROSC.BeatCounter/VROSC.SyncSource BeatCounter
      static void _set_BeatCounter(::VROSC::BeatCounter::SyncSource value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // VROSC.BeatCounter/VROSC.SyncSource
    #pragma pack(pop)
    static check_size<sizeof(BeatCounter::SyncSource), 0 + sizeof(int)> __VROSC_BeatCounter_SyncSourceSizeCheck;
    static_assert(sizeof(BeatCounter::SyncSource) == 0x4);
    public:
    // private VROSC.Metronome _metronome
    // Size: 0x8
    // Offset: 0x18
    ::VROSC::Metronome* metronome;
    // Field size check
    static_assert(sizeof(::VROSC::Metronome*) == 0x8);
    // private VROSC.BeatCounterUI _beatCounterUI
    // Size: 0x8
    // Offset: 0x20
    ::VROSC::BeatCounterUI* beatCounterUI;
    // Field size check
    static_assert(sizeof(::VROSC::BeatCounterUI*) == 0x8);
    // private UnityEngine.AudioSource _beatCounterAudioSource
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::AudioSource* beatCounterAudioSource;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioSource*) == 0x8);
    // private System.Single _lastFrameVisualBarProgress
    // Size: 0x4
    // Offset: 0x30
    float lastFrameVisualBarProgress;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single <BPM>k__BackingField
    // Size: 0x4
    // Offset: 0x34
    float BPM;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Int32 <BeatsPerBar>k__BackingField
    // Size: 0x4
    // Offset: 0x38
    int BeatsPerBar;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 <BeatLengthInSamples>k__BackingField
    // Size: 0x4
    // Offset: 0x3C
    int BeatLengthInSamples;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private VROSC.BeatCounter/VROSC.SyncSource <CurrentSyncSource>k__BackingField
    // Size: 0x4
    // Offset: 0x40
    ::VROSC::BeatCounter::SyncSource CurrentSyncSource;
    // Field size check
    static_assert(sizeof(::VROSC::BeatCounter::SyncSource) == 0x4);
    // private System.Int32 <CurrentSyncSample>k__BackingField
    // Size: 0x4
    // Offset: 0x44
    int CurrentSyncSample;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Single <AudioBarProgress>k__BackingField
    // Size: 0x4
    // Offset: 0x48
    float AudioBarProgress;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Int32 <AudioBarNumber>k__BackingField
    // Size: 0x4
    // Offset: 0x4C
    int AudioBarNumber;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Single <VisualBarProgress>k__BackingField
    // Size: 0x4
    // Offset: 0x50
    float VisualBarProgress;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Int32 <VisualBarNumber>k__BackingField
    // Size: 0x4
    // Offset: 0x54
    int VisualBarNumber;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean <IsVisualBeatFrame>k__BackingField
    // Size: 0x1
    // Offset: 0x58
    bool IsVisualBeatFrame;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: IsVisualBeatFrame and: VisualCurrentBeat
    char __padding13[0x3] = {};
    // private System.Int32 <VisualCurrentBeat>k__BackingField
    // Size: 0x4
    // Offset: 0x5C
    int VisualCurrentBeat;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Single <LooperMaxBPM>k__BackingField
    // Size: 0x4
    // Offset: 0x60
    float LooperMaxBPM;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean <IsSetup>k__BackingField
    // Size: 0x1
    // Offset: 0x64
    bool IsSetup;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean <IsPlaying>k__BackingField
    // Size: 0x1
    // Offset: 0x65
    bool IsPlaying;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // static field const value: static public System.Single LooperMinBPM
    static constexpr const float LooperMinBPM = 75;
    // Get static field: static public System.Single LooperMinBPM
    static float _get_LooperMinBPM();
    // Set static field: static public System.Single LooperMinBPM
    static void _set_LooperMinBPM(float value);
    // static field const value: static public System.Single ManualMinBPM
    static constexpr const float ManualMinBPM = 60;
    // Get static field: static public System.Single ManualMinBPM
    static float _get_ManualMinBPM();
    // Set static field: static public System.Single ManualMinBPM
    static void _set_ManualMinBPM(float value);
