// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: VROSC
namespace VROSC {
  // Forward declaring type: Rotator
  class Rotator;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Renderer
  class Renderer;
  // Forward declaring type: MaterialPropertyBlock
  class MaterialPropertyBlock;
  // Skipping declaration: Vector3 because it is already included!
}
// Completed forward declares
// Type namespace: VROSC
namespace VROSC {
  // Forward declaring type: BoardFrameNote
  class BoardFrameNote;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::VROSC::BoardFrameNote);
DEFINE_IL2CPP_ARG_TYPE(::VROSC::BoardFrameNote*, "VROSC", "BoardFrameNote");
// Type namespace: VROSC
namespace VROSC {
  // Size: 0x48
  #pragma pack(push, 1)
  // Autogenerated type: VROSC.BoardFrameNote
  // [TokenAttribute] Offset: FFFFFFFF
  class BoardFrameNote : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // private VROSC.Rotator _rotator
    // Size: 0x8
    // Offset: 0x18
    ::VROSC::Rotator* rotator;
    // Field size check
    static_assert(sizeof(::VROSC::Rotator*) == 0x8);
    // private UnityEngine.Color _restingColor
    // Size: 0x10
    // Offset: 0x20
    ::UnityEngine::Color restingColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private UnityEngine.Renderer _renderer
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::Renderer* renderer;
    // Field size check
    static_assert(sizeof(::UnityEngine::Renderer*) == 0x8);
    // private System.Int32 <Note>k__BackingField
    // Size: 0x4
    // Offset: 0x38
    int Note;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: Note and: propBlock
    char __padding3[0x4] = {};
    // private UnityEngine.MaterialPropertyBlock _propBlock
    // Size: 0x8
    // Offset: 0x40
    ::UnityEngine::MaterialPropertyBlock* propBlock;
    // Field size check
    static_assert(sizeof(::UnityEngine::MaterialPropertyBlock*) == 0x8);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: private VROSC.Rotator _rotator
    [[deprecated]] ::VROSC::Rotator*& dyn__rotator();
    // Get instance field reference: private UnityEngine.Color _restingColor
    [[deprecated]] ::UnityEngine::Color& dyn__restingColor();
    // Get instance field reference: private UnityEngine.Renderer _renderer
    [[deprecated]] ::UnityEngine::Renderer*& dyn__renderer();
    // Get instance field reference: private System.Int32 <Note>k__BackingField
    [[deprecated]] int& dyn_$Note$k__BackingField();
    // Get instance field reference: private UnityEngine.MaterialPropertyBlock _propBlock
    [[deprecated]] ::UnityEngine::MaterialPropertyBlock*& dyn__propBlock();
    // public System.Int32 get_Note()
    // Offset: 0x937BC4
    int get_Note();
    // private System.Void set_Note(System.Int32 value)
    // Offset: 0x937BBC
    void set_Note(int value);
    // private System.Void CreateBlock()
    // Offset: 0x937BCC
    void CreateBlock();
    // public System.Void SetVisible(System.Int32 note, System.Boolean playing)
    // Offset: 0x937C30
    void SetVisible(int note, bool playing);
    // public System.Void Hide()
    // Offset: 0x937CC8
    void Hide();
    // public System.Void SetPlayingColor(UnityEngine.Vector3 power, System.Single velocity, System.Single highlight)
    // Offset: 0x937CF0
    void SetPlayingColor(::UnityEngine::Vector3 power, float velocity, float highlight);
    // public System.Void .ctor()
    // Offset: 0x937E44
    // Implemented from: UnityEngine.MonoBehaviour
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static BoardFrameNote* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::VROSC::BoardFrameNote::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<BoardFrameNote*, creationType>()));
    }
  }; // VROSC.BoardFrameNote
  #pragma pack(pop)
  static check_size<sizeof(BoardFrameNote), 64 + sizeof(::UnityEngine::MaterialPropertyBlock*)> __VROSC_BoardFrameNoteSizeCheck;
  static_assert(sizeof(BoardFrameNote) == 0x48);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: VROSC::BoardFrameNote::get_Note
// Il2CppName: get_Note
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<int (VROSC::BoardFrameNote::*)()>(&VROSC::BoardFrameNote::get_Note)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(VROSC::BoardFrameNote*), "get_Note", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: VROSC::BoardFrameNote::set_Note
// Il2CppName: set_Note
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::BoardFrameNote::*)(int)>(&VROSC::BoardFrameNote::set_Note)> {
  static const MethodInfo* get() {
    static auto* value = &::il2cpp_utils::GetClassFromName("System", "Int32")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(VROSC::BoardFrameNote*), "set_Note", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{value});
  }
};
// Writing MetadataGetter for method: VROSC::BoardFrameNote::CreateBlock
// Il2CppName: CreateBlock
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::BoardFrameNote::*)()>(&VROSC::BoardFrameNote::CreateBlock)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(VROSC::BoardFrameNote*), "CreateBlock", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: VROSC::BoardFrameNote::SetVisible
// Il2CppName: SetVisible
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::BoardFrameNote::*)(int, bool)>(&VROSC::BoardFrameNote::SetVisible)> {
  static const MethodInfo* get() {
    static auto* note = &::il2cpp_utils::GetClassFromName("System", "Int32")->byval_arg;
    static auto* playing = &::il2cpp_utils::GetClassFromName("System", "Boolean")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(VROSC::BoardFrameNote*), "SetVisible", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{note, playing});
  }
};
// Writing MetadataGetter for method: VROSC::BoardFrameNote::Hide
// Il2CppName: Hide
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::BoardFrameNote::*)()>(&VROSC::BoardFrameNote::Hide)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(VROSC::BoardFrameNote*), "Hide", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: VROSC::BoardFrameNote::SetPlayingColor
// Il2CppName: SetPlayingColor
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::BoardFrameNote::*)(::UnityEngine::Vector3, float, float)>(&VROSC::BoardFrameNote::SetPlayingColor)> {
  static const MethodInfo* get() {
    static auto* power = &::il2cpp_utils::GetClassFromName("UnityEngine", "Vector3")->byval_arg;
    static auto* velocity = &::il2cpp_utils::GetClassFromName("System", "Single")->byval_arg;
    static auto* highlight = &::il2cpp_utils::GetClassFromName("System", "Single")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(VROSC::BoardFrameNote*), "SetPlayingColor", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{power, velocity, highlight});
  }
};
// Writing MetadataGetter for method: VROSC::BoardFrameNote::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
