// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: VROSC.CloudStateManager
#include "VROSC/CloudStateManager.hpp"
// Including type: VROSC.Error
#include "VROSC/Error.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action
  class Action;
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
}
// Completed forward declares
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::VROSC::CloudStateManager::$$c__DisplayClass20_0);
DEFINE_IL2CPP_ARG_TYPE(::VROSC::CloudStateManager::$$c__DisplayClass20_0*, "VROSC", "CloudStateManager/<>c__DisplayClass20_0");
// Type namespace: VROSC
namespace VROSC {
  // Size: 0x40
  #pragma pack(push, 1)
  // Autogenerated type: VROSC.CloudStateManager/VROSC.<>c__DisplayClass20_0
  // [TokenAttribute] Offset: FFFFFFFF
  // [CompilerGeneratedAttribute] Offset: FFFFFFFF
  class CloudStateManager::$$c__DisplayClass20_0 : public ::Il2CppObject {
    public:
    public:
    // public System.Boolean hasPreview
    // Size: 0x1
    // Offset: 0x10
    bool hasPreview;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: hasPreview and: sessionName
    char __padding0[0x7] = {};
    // public System.String sessionName
    // Size: 0x8
    // Offset: 0x18
    ::StringW sessionName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.Boolean isCommunity
    // Size: 0x1
    // Offset: 0x20
    bool isCommunity;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isCommunity and: $$9__3
    char __padding2[0x7] = {};
    // public System.Action <>9__3
    // Size: 0x8
    // Offset: 0x28
    ::System::Action* $$9__3;
    // Field size check
    static_assert(sizeof(::System::Action*) == 0x8);
    // public System.Action`1<System.Single> <>9__4
    // Size: 0x8
    // Offset: 0x30
    ::System::Action_1<float>* $$9__4;
    // Field size check
    static_assert(sizeof(::System::Action_1<float>*) == 0x8);
    // public System.Action`1<VROSC.Error> <>9__5
    // Size: 0x8
    // Offset: 0x38
    ::System::Action_1<::VROSC::Error>* $$9__5;
    // Field size check
    static_assert(sizeof(::System::Action_1<::VROSC::Error>*) == 0x8);
    public:
    // Get instance field reference: public System.Boolean hasPreview
    [[deprecated("Use field access instead!")]] bool& dyn_hasPreview();
    // Get instance field reference: public System.String sessionName
    [[deprecated("Use field access instead!")]] ::StringW& dyn_sessionName();
    // Get instance field reference: public System.Boolean isCommunity
    [[deprecated("Use field access instead!")]] bool& dyn_isCommunity();
    // Get instance field reference: public System.Action <>9__3
    [[deprecated("Use field access instead!")]] ::System::Action*& dyn_$$9__3();
    // Get instance field reference: public System.Action`1<System.Single> <>9__4
    [[deprecated("Use field access instead!")]] ::System::Action_1<float>*& dyn_$$9__4();
    // Get instance field reference: public System.Action`1<VROSC.Error> <>9__5
    [[deprecated("Use field access instead!")]] ::System::Action_1<::VROSC::Error>*& dyn_$$9__5();
    // public System.Void .ctor()
    // Offset: 0x95AA14
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static CloudStateManager::$$c__DisplayClass20_0* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::VROSC::CloudStateManager::$$c__DisplayClass20_0::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<CloudStateManager::$$c__DisplayClass20_0*, creationType>()));
    }
    // System.Void <CoUploadSession>b__0()
    // Offset: 0x95AA1C
    void $CoUploadSession$b__0();
    // System.Void <CoUploadSession>b__3()
    // Offset: 0x95AC78
    void $CoUploadSession$b__3();
    // System.Void <CoUploadSession>b__4(System.Single progress)
    // Offset: 0x95AD28
    void $CoUploadSession$b__4(float progress);
    // System.Void <CoUploadSession>b__5(VROSC.Error error)
    // Offset: 0x95ADB8
    void $CoUploadSession$b__5(::VROSC::Error error);
    // System.Void <CoUploadSession>b__1(System.Single progress)
    // Offset: 0x95AE48
    void $CoUploadSession$b__1(float progress);
    // System.Void <CoUploadSession>b__2(VROSC.Error error)
    // Offset: 0x95AED8
    void $CoUploadSession$b__2(::VROSC::Error error);
  }; // VROSC.CloudStateManager/VROSC.<>c__DisplayClass20_0
  #pragma pack(pop)
  static check_size<sizeof(CloudStateManager::$$c__DisplayClass20_0), 56 + sizeof(::System::Action_1<::VROSC::Error>*)> __VROSC_CloudStateManager_$$c__DisplayClass20_0SizeCheck;
  static_assert(sizeof(CloudStateManager::$$c__DisplayClass20_0) == 0x40);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: VROSC::CloudStateManager::$$c__DisplayClass20_0::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
// Writing MetadataGetter for method: VROSC::CloudStateManager::$$c__DisplayClass20_0::$CoUploadSession$b__0
// Il2CppName: <CoUploadSession>b__0
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::CloudStateManager::$$c__DisplayClass20_0::*)()>(&VROSC::CloudStateManager::$$c__DisplayClass20_0::$CoUploadSession$b__0)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(VROSC::CloudStateManager::$$c__DisplayClass20_0*), "<CoUploadSession>b__0", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: VROSC::CloudStateManager::$$c__DisplayClass20_0::$CoUploadSession$b__3
// Il2CppName: <CoUploadSession>b__3
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::CloudStateManager::$$c__DisplayClass20_0::*)()>(&VROSC::CloudStateManager::$$c__DisplayClass20_0::$CoUploadSession$b__3)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(VROSC::CloudStateManager::$$c__DisplayClass20_0*), "<CoUploadSession>b__3", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: VROSC::CloudStateManager::$$c__DisplayClass20_0::$CoUploadSession$b__4
// Il2CppName: <CoUploadSession>b__4
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::CloudStateManager::$$c__DisplayClass20_0::*)(float)>(&VROSC::CloudStateManager::$$c__DisplayClass20_0::$CoUploadSession$b__4)> {
  static const MethodInfo* get() {
    static auto* progress = &::il2cpp_utils::GetClassFromName("System", "Single")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(VROSC::CloudStateManager::$$c__DisplayClass20_0*), "<CoUploadSession>b__4", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{progress});
  }
};
// Writing MetadataGetter for method: VROSC::CloudStateManager::$$c__DisplayClass20_0::$CoUploadSession$b__5
// Il2CppName: <CoUploadSession>b__5
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::CloudStateManager::$$c__DisplayClass20_0::*)(::VROSC::Error)>(&VROSC::CloudStateManager::$$c__DisplayClass20_0::$CoUploadSession$b__5)> {
  static const MethodInfo* get() {
    static auto* error = &::il2cpp_utils::GetClassFromName("VROSC", "Error")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(VROSC::CloudStateManager::$$c__DisplayClass20_0*), "<CoUploadSession>b__5", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{error});
  }
};
// Writing MetadataGetter for method: VROSC::CloudStateManager::$$c__DisplayClass20_0::$CoUploadSession$b__1
// Il2CppName: <CoUploadSession>b__1
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::CloudStateManager::$$c__DisplayClass20_0::*)(float)>(&VROSC::CloudStateManager::$$c__DisplayClass20_0::$CoUploadSession$b__1)> {
  static const MethodInfo* get() {
    static auto* progress = &::il2cpp_utils::GetClassFromName("System", "Single")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(VROSC::CloudStateManager::$$c__DisplayClass20_0*), "<CoUploadSession>b__1", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{progress});
  }
};
// Writing MetadataGetter for method: VROSC::CloudStateManager::$$c__DisplayClass20_0::$CoUploadSession$b__2
// Il2CppName: <CoUploadSession>b__2
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::CloudStateManager::$$c__DisplayClass20_0::*)(::VROSC::Error)>(&VROSC::CloudStateManager::$$c__DisplayClass20_0::$CoUploadSession$b__2)> {
  static const MethodInfo* get() {
    static auto* error = &::il2cpp_utils::GetClassFromName("VROSC", "Error")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(VROSC::CloudStateManager::$$c__DisplayClass20_0*), "<CoUploadSession>b__2", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{error});
  }
};
