// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: VROSC.FileWriter
#include "VROSC/FileWriter.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::VROSC::FileWriter::$$c__DisplayClass19_0);
DEFINE_IL2CPP_ARG_TYPE(::VROSC::FileWriter::$$c__DisplayClass19_0*, "VROSC", "FileWriter/<>c__DisplayClass19_0");
// Type namespace: VROSC
namespace VROSC {
  // Size: 0x40
  #pragma pack(push, 1)
  // Autogenerated type: VROSC.FileWriter/VROSC.<>c__DisplayClass19_0
  // [TokenAttribute] Offset: FFFFFFFF
  // [CompilerGeneratedAttribute] Offset: FFFFFFFF
  class FileWriter::$$c__DisplayClass19_0 : public ::Il2CppObject {
    public:
    public:
    // public System.Single[] samples
    // Size: 0x8
    // Offset: 0x10
    ::ArrayW<float> samples;
    // Field size check
    static_assert(sizeof(::ArrayW<float>) == 0x8);
    // public System.Int32 sampleRate
    // Size: 0x4
    // Offset: 0x18
    int sampleRate;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 channels
    // Size: 0x4
    // Offset: 0x1C
    int channels;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Single normalizeMultiplier
    // Size: 0x4
    // Offset: 0x20
    float normalizeMultiplier;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Int32 startIndex
    // Size: 0x4
    // Offset: 0x24
    int startIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 endIndex
    // Size: 0x4
    // Offset: 0x28
    int endIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: endIndex and: filePath
    char __padding5[0x4] = {};
    // public System.String filePath
    // Size: 0x8
    // Offset: 0x30
    ::StringW filePath;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String previewFilePath
    // Size: 0x8
    // Offset: 0x38
    ::StringW previewFilePath;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    public:
    // Get instance field reference: public System.Single[] samples
    [[deprecated("Use field access instead!")]] ::ArrayW<float>& dyn_samples();
    // Get instance field reference: public System.Int32 sampleRate
    [[deprecated("Use field access instead!")]] int& dyn_sampleRate();
    // Get instance field reference: public System.Int32 channels
    [[deprecated("Use field access instead!")]] int& dyn_channels();
    // Get instance field reference: public System.Single normalizeMultiplier
    [[deprecated("Use field access instead!")]] float& dyn_normalizeMultiplier();
    // Get instance field reference: public System.Int32 startIndex
    [[deprecated("Use field access instead!")]] int& dyn_startIndex();
    // Get instance field reference: public System.Int32 endIndex
    [[deprecated("Use field access instead!")]] int& dyn_endIndex();
    // Get instance field reference: public System.String filePath
    [[deprecated("Use field access instead!")]] ::StringW& dyn_filePath();
    // Get instance field reference: public System.String previewFilePath
    [[deprecated("Use field access instead!")]] ::StringW& dyn_previewFilePath();
    // public System.Void .ctor()
    // Offset: 0x95FA94
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static FileWriter::$$c__DisplayClass19_0* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::VROSC::FileWriter::$$c__DisplayClass19_0::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<FileWriter::$$c__DisplayClass19_0*, creationType>()));
    }
    // System.Void <ExportTapeRecording>b__0()
    // Offset: 0x95FA9C
    void $ExportTapeRecording$b__0();
  }; // VROSC.FileWriter/VROSC.<>c__DisplayClass19_0
  #pragma pack(pop)
  static check_size<sizeof(FileWriter::$$c__DisplayClass19_0), 56 + sizeof(::StringW)> __VROSC_FileWriter_$$c__DisplayClass19_0SizeCheck;
  static_assert(sizeof(FileWriter::$$c__DisplayClass19_0) == 0x40);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: VROSC::FileWriter::$$c__DisplayClass19_0::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
// Writing MetadataGetter for method: VROSC::FileWriter::$$c__DisplayClass19_0::$ExportTapeRecording$b__0
// Il2CppName: <ExportTapeRecording>b__0
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::FileWriter::$$c__DisplayClass19_0::*)()>(&VROSC::FileWriter::$$c__DisplayClass19_0::$ExportTapeRecording$b__0)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(VROSC::FileWriter::$$c__DisplayClass19_0*), "<ExportTapeRecording>b__0", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
