// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: VROSC.FirebaseWrapper
#include "VROSC/FirebaseWrapper.hpp"
// Including type: VROSC.Error
#include "VROSC/Error.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: VROSC
namespace VROSC {
}
// Forward declaring namespace: Proyecto26
namespace Proyecto26 {
  // Forward declaring type: RequestHelper
  class RequestHelper;
  // Forward declaring type: ResponseHelper
  class ResponseHelper;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
  // Forward declaring type: Action
  class Action;
  // Forward declaring type: Exception
  class Exception;
}
// Forward declaring namespace: System::Threading::Tasks
namespace System::Threading::Tasks {
  // Forward declaring type: Task
  class Task;
}
// Completed forward declares
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::VROSC::FirebaseWrapper::$$c__DisplayClass104_0);
DEFINE_IL2CPP_ARG_TYPE(::VROSC::FirebaseWrapper::$$c__DisplayClass104_0*, "VROSC", "FirebaseWrapper/<>c__DisplayClass104_0");
// Type namespace: VROSC
namespace VROSC {
  // Size: 0x40
  #pragma pack(push, 1)
  // Autogenerated type: VROSC.FirebaseWrapper/VROSC.<>c__DisplayClass104_0
  // [TokenAttribute] Offset: FFFFFFFF
  // [CompilerGeneratedAttribute] Offset: FFFFFFFF
  class FirebaseWrapper::$$c__DisplayClass104_0 : public ::Il2CppObject {
    public:
    // Nested type: ::VROSC::FirebaseWrapper::$$c__DisplayClass104_0::$$LoadPreviewFile$b__0$d
    struct $$LoadPreviewFile$b__0$d;
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // public System.String destinationFilePath
    // Size: 0x8
    // Offset: 0x10
    ::StringW destinationFilePath;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public VROSC.FirebaseWrapper <>4__this
    // Size: 0x8
    // Offset: 0x18
    ::VROSC::FirebaseWrapper* $$4__this;
    // Field size check
    static_assert(sizeof(::VROSC::FirebaseWrapper*) == 0x8);
    // public Proyecto26.RequestHelper requestHelper
    // Size: 0x8
    // Offset: 0x20
    ::Proyecto26::RequestHelper* requestHelper;
    // Field size check
    static_assert(sizeof(::Proyecto26::RequestHelper*) == 0x8);
    // public System.Action`1<System.String> onSuccess
    // Size: 0x8
    // Offset: 0x28
    ::System::Action_1<::StringW>* onSuccess;
    // Field size check
    static_assert(sizeof(::System::Action_1<::StringW>*) == 0x8);
    // public System.Action`1<VROSC.Error> onFailure
    // Size: 0x8
    // Offset: 0x30
    ::System::Action_1<::VROSC::Error>* onFailure;
    // Field size check
    static_assert(sizeof(::System::Action_1<::VROSC::Error>*) == 0x8);
    // public System.Action <>9__2
    // Size: 0x8
    // Offset: 0x38
    ::System::Action* $$9__2;
    // Field size check
    static_assert(sizeof(::System::Action*) == 0x8);
    public:
    // Get instance field reference: public System.String destinationFilePath
    ::StringW& dyn_destinationFilePath();
    // Get instance field reference: public VROSC.FirebaseWrapper <>4__this
    ::VROSC::FirebaseWrapper*& dyn_$$4__this();
    // Get instance field reference: public Proyecto26.RequestHelper requestHelper
    ::Proyecto26::RequestHelper*& dyn_requestHelper();
    // Get instance field reference: public System.Action`1<System.String> onSuccess
    ::System::Action_1<::StringW>*& dyn_onSuccess();
    // Get instance field reference: public System.Action`1<VROSC.Error> onFailure
    ::System::Action_1<::VROSC::Error>*& dyn_onFailure();
    // Get instance field reference: public System.Action <>9__2
    ::System::Action*& dyn_$$9__2();
    // System.Threading.Tasks.Task <LoadPreviewFile>b__0(Proyecto26.ResponseHelper response)
    // Offset: 0x13CA144
    ::System::Threading::Tasks::Task* $LoadPreviewFile$b__0(::Proyecto26::ResponseHelper* response);
    // System.Void <LoadPreviewFile>b__2()
    // Offset: 0x13CA254
    void $LoadPreviewFile$b__2();
    // System.Void <LoadPreviewFile>b__1(System.Exception exception)
    // Offset: 0x13CA2B4
    void $LoadPreviewFile$b__1(::System::Exception* exception);
    // public System.Void .ctor()
    // Offset: 0x13CA13C
    // Implemented from: System.Object
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static FirebaseWrapper::$$c__DisplayClass104_0* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::VROSC::FirebaseWrapper::$$c__DisplayClass104_0::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<FirebaseWrapper::$$c__DisplayClass104_0*, creationType>()));
    }
  }; // VROSC.FirebaseWrapper/VROSC.<>c__DisplayClass104_0
  #pragma pack(pop)
  static check_size<sizeof(FirebaseWrapper::$$c__DisplayClass104_0), 56 + sizeof(::System::Action*)> __VROSC_FirebaseWrapper_$$c__DisplayClass104_0SizeCheck;
  static_assert(sizeof(FirebaseWrapper::$$c__DisplayClass104_0) == 0x40);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: VROSC::FirebaseWrapper::$$c__DisplayClass104_0::$LoadPreviewFile$b__0
// Il2CppName: <LoadPreviewFile>b__0
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::System::Threading::Tasks::Task* (VROSC::FirebaseWrapper::$$c__DisplayClass104_0::*)(::Proyecto26::ResponseHelper*)>(&VROSC::FirebaseWrapper::$$c__DisplayClass104_0::$LoadPreviewFile$b__0)> {
  static const MethodInfo* get() {
    static auto* response = &::il2cpp_utils::GetClassFromName("Proyecto26", "ResponseHelper")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(VROSC::FirebaseWrapper::$$c__DisplayClass104_0*), "<LoadPreviewFile>b__0", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{response});
  }
};
// Writing MetadataGetter for method: VROSC::FirebaseWrapper::$$c__DisplayClass104_0::$LoadPreviewFile$b__2
// Il2CppName: <LoadPreviewFile>b__2
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::FirebaseWrapper::$$c__DisplayClass104_0::*)()>(&VROSC::FirebaseWrapper::$$c__DisplayClass104_0::$LoadPreviewFile$b__2)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(VROSC::FirebaseWrapper::$$c__DisplayClass104_0*), "<LoadPreviewFile>b__2", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: VROSC::FirebaseWrapper::$$c__DisplayClass104_0::$LoadPreviewFile$b__1
// Il2CppName: <LoadPreviewFile>b__1
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::FirebaseWrapper::$$c__DisplayClass104_0::*)(::System::Exception*)>(&VROSC::FirebaseWrapper::$$c__DisplayClass104_0::$LoadPreviewFile$b__1)> {
  static const MethodInfo* get() {
    static auto* exception = &::il2cpp_utils::GetClassFromName("System", "Exception")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(VROSC::FirebaseWrapper::$$c__DisplayClass104_0*), "<LoadPreviewFile>b__1", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{exception});
  }
};
// Writing MetadataGetter for method: VROSC::FirebaseWrapper::$$c__DisplayClass104_0::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
