// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: VROSC.HandType
#include "VROSC/HandType.hpp"
// Including type: UnityEngine.Vector2
#include "UnityEngine/Vector2.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: VROSC
namespace VROSC {
  // Forward declaring type: InputVisualizer
  class InputVisualizer;
  // Forward declaring type: PredictiveHitter
  class PredictiveHitter;
  // Forward declaring type: KeyHitter
  class KeyHitter;
  // Forward declaring type: HighlightControllerComponents
  class HighlightControllerComponents;
  // Forward declaring type: TutorialInputDevice
  class TutorialInputDevice;
  // Forward declaring type: DashboardSpawnPoint
  class DashboardSpawnPoint;
  // Forward declaring type: ControllerRecordingUI
  class ControllerRecordingUI;
  // Forward declaring type: UIHelpers
  class UIHelpers;
  // Forward declaring type: InputSettings
  class InputSettings;
  // Forward declaring type: InputDeviceTransformData
  class InputDeviceTransformData;
  // Forward declaring type: VRPlayer
  class VRPlayer;
  // Forward declaring type: Mallet
  class Mallet;
}
// Forward declaring namespace: VROSC::UI
namespace VROSC::UI {
  // Forward declaring type: UIInputHand
  class UIInputHand;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: Collider
  class Collider;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
}
// Completed forward declares
// Type namespace: VROSC
namespace VROSC {
  // Forward declaring type: InputDevice
  class InputDevice;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::VROSC::InputDevice);
DEFINE_IL2CPP_ARG_TYPE(::VROSC::InputDevice*, "VROSC", "InputDevice");
// Type namespace: VROSC
namespace VROSC {
  // Size: 0xD8
  #pragma pack(push, 1)
  // Autogenerated type: VROSC.InputDevice
  // [TokenAttribute] Offset: FFFFFFFF
  class InputDevice : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::VROSC::InputDevice::HeldInputNode
    class HeldInputNode;
    // Nested type: ::VROSC::InputDevice::HoveredInputNode
    class HoveredInputNode;
    public:
    // private VROSC.UI.UIInputHand _uIInput
    // Size: 0x8
    // Offset: 0x18
    ::VROSC::UI::UIInputHand* uIInput;
    // Field size check
    static_assert(sizeof(::VROSC::UI::UIInputHand*) == 0x8);
    // private VROSC.InputVisualizer _inputVisualizer
    // Size: 0x8
    // Offset: 0x20
    ::VROSC::InputVisualizer* inputVisualizer;
    // Field size check
    static_assert(sizeof(::VROSC::InputVisualizer*) == 0x8);
    // private UnityEngine.Transform _centerPoint
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::Transform* centerPoint;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private VROSC.PredictiveHitter _predictiveHitter
    // Size: 0x8
    // Offset: 0x30
    ::VROSC::PredictiveHitter* predictiveHitter;
    // Field size check
    static_assert(sizeof(::VROSC::PredictiveHitter*) == 0x8);
    // private VROSC.KeyHitter _keyBoardHitter
    // Size: 0x8
    // Offset: 0x38
    ::VROSC::KeyHitter* keyBoardHitter;
    // Field size check
    static_assert(sizeof(::VROSC::KeyHitter*) == 0x8);
    // private VROSC.HighlightControllerComponents _highLight
    // Size: 0x8
    // Offset: 0x40
    ::VROSC::HighlightControllerComponents* highLight;
    // Field size check
    static_assert(sizeof(::VROSC::HighlightControllerComponents*) == 0x8);
    // private VROSC.TutorialInputDevice _tutorial
    // Size: 0x8
    // Offset: 0x48
    ::VROSC::TutorialInputDevice* tutorial;
    // Field size check
    static_assert(sizeof(::VROSC::TutorialInputDevice*) == 0x8);
    // private VROSC.DashboardSpawnPoint _dashboardSpawnPoint
    // Size: 0x8
    // Offset: 0x50
    ::VROSC::DashboardSpawnPoint* dashboardSpawnPoint;
    // Field size check
    static_assert(sizeof(::VROSC::DashboardSpawnPoint*) == 0x8);
    // private VROSC.ControllerRecordingUI _recordingUI
    // Size: 0x8
    // Offset: 0x58
    ::VROSC::ControllerRecordingUI* recordingUI;
    // Field size check
    static_assert(sizeof(::VROSC::ControllerRecordingUI*) == 0x8);
    // private VROSC.UIHelpers <UIHelpers>k__BackingField
    // Size: 0x8
    // Offset: 0x60
    ::VROSC::UIHelpers* UIHelpers;
    // Field size check
    static_assert(sizeof(::VROSC::UIHelpers*) == 0x8);
    // private VROSC.InputSettings _inputSettings
    // Size: 0x8
    // Offset: 0x68
    ::VROSC::InputSettings* inputSettings;
    // Field size check
    static_assert(sizeof(::VROSC::InputSettings*) == 0x8);
    // private System.Int32 _overlapColliderAllocSize
    // Size: 0x4
    // Offset: 0x70
    int overlapColliderAllocSize;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Single _overlapSize
    // Size: 0x4
    // Offset: 0x74
    float overlapSize;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private VROSC.HandType <HandType>k__BackingField
    // Size: 0x4
    // Offset: 0x78
    ::VROSC::HandType HandType;
    // Field size check
    static_assert(sizeof(::VROSC::HandType) == 0x4);
    // Padding between fields: HandType and: TouchPointTransform
    char __padding13[0x4] = {};
    // private UnityEngine.Transform <TouchPointTransform>k__BackingField
    // Size: 0x8
    // Offset: 0x80
    ::UnityEngine::Transform* TouchPointTransform;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private UnityEngine.Transform <InteractionPointTransform>k__BackingField
    // Size: 0x8
    // Offset: 0x88
    ::UnityEngine::Transform* InteractionPointTransform;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private UnityEngine.Collider[] _hoveredColliders
    // Size: 0x8
    // Offset: 0x90
    ::ArrayW<::UnityEngine::Collider*> hoveredColliders;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Collider*>) == 0x8);
    // private System.Collections.Generic.List`1<VROSC.InputDevice/VROSC.HoveredInputNode> <HoveredInputNodes>k__BackingField
    // Size: 0x8
    // Offset: 0x98
    ::System::Collections::Generic::List_1<::VROSC::InputDevice::HoveredInputNode*>* HoveredInputNodes;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::VROSC::InputDevice::HoveredInputNode*>*) == 0x8);
    // private System.Collections.Generic.List`1<VROSC.InputDevice/VROSC.HeldInputNode> <HeldInputNodes>k__BackingField
    // Size: 0x8
    // Offset: 0xA0
    ::System::Collections::Generic::List_1<::VROSC::InputDevice::HeldInputNode*>* HeldInputNodes;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::VROSC::InputDevice::HeldInputNode*>*) == 0x8);
    // private UnityEngine.Vector2 <StickPadValue>k__BackingField
    // Size: 0x8
    // Offset: 0xA8
    ::UnityEngine::Vector2 StickPadValue;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // private System.Single <IndexTriggerValue>k__BackingField
    // Size: 0x4
    // Offset: 0xB0
    float IndexTriggerValue;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single <GripTriggerValue>k__BackingField
    // Size: 0x4
    // Offset: 0xB4
    float GripTriggerValue;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean <IndexAsButtonPressed>k__BackingField
    // Size: 0x1
    // Offset: 0xB8
    bool IndexAsButtonPressed;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean <LastIndexAsButtonPressed>k__BackingField
    // Size: 0x1
    // Offset: 0xB9
    bool LastIndexAsButtonPressed;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: LastIndexAsButtonPressed and: IndexAsButtonEdgeValue
    char __padding23[0x2] = {};
    // private System.Single <IndexAsButtonEdgeValue>k__BackingField
    // Size: 0x4
    // Offset: 0xBC
    float IndexAsButtonEdgeValue;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private VROSC.InputDevice <OtherController>k__BackingField
    // Size: 0x8
    // Offset: 0xC0
    ::VROSC::InputDevice* OtherController;
    // Field size check
    static_assert(sizeof(::VROSC::InputDevice*) == 0x8);
    // private System.Boolean <AnyButtonTriggering>k__BackingField
    // Size: 0x1
    // Offset: 0xC8
    bool AnyButtonTriggering;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: AnyButtonTriggering and: Data
    char __padding26[0x7] = {};
    // private VROSC.InputDeviceTransformData <Data>k__BackingField
    // Size: 0x8
    // Offset: 0xD0
    ::VROSC::InputDeviceTransformData* Data;
    // Field size check
    static_assert(sizeof(::VROSC::InputDeviceTransformData*) == 0x8);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // static field const value: static private System.Single TriggerHairPinValue
    static constexpr const float TriggerHairPinValue = 0.01;
    // Get static field: static private System.Single TriggerHairPinValue
    static float _get_TriggerHairPinValue();
    // Set static field: static private System.Single TriggerHairPinValue
    static void _set_TriggerHairPinValue(float value);
    // static field const value: static private System.Single TriggerAlwaysPressedValue
    static constexpr const float TriggerAlwaysPressedValue = 0.5;
    // Get static field: static private System.Single TriggerAlwaysPressedValue
    static float _get_TriggerAlwaysPressedValue();
