// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: VROSC.BaseDataModel
#include "VROSC/BaseDataModel.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: VROSC
namespace VROSC {
  // Forward declaring type: TransformDataModel
  class TransformDataModel;
  // Forward declaring type: MidiData
  class MidiData;
}
// Completed forward declares
// Type namespace: VROSC
namespace VROSC {
  // Forward declaring type: InstrumentDataModel
  class InstrumentDataModel;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::VROSC::InstrumentDataModel);
DEFINE_IL2CPP_ARG_TYPE(::VROSC::InstrumentDataModel*, "VROSC", "InstrumentDataModel");
// Type namespace: VROSC
namespace VROSC {
  // Size: 0x3D
  #pragma pack(push, 1)
  // Autogenerated type: VROSC.InstrumentDataModel
  // [TokenAttribute] Offset: FFFFFFFF
  class InstrumentDataModel : public ::VROSC::BaseDataModel {
    public:
    public:
    // public System.String Id
    // Size: 0x8
    // Offset: 0x18
    ::StringW Id;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public VROSC.TransformDataModel TransformData
    // Size: 0x8
    // Offset: 0x20
    ::VROSC::TransformDataModel* TransformData;
    // Field size check
    static_assert(sizeof(::VROSC::TransformDataModel*) == 0x8);
    // public VROSC.MidiData MidiData
    // Size: 0x8
    // Offset: 0x28
    ::VROSC::MidiData* MidiData;
    // Field size check
    static_assert(sizeof(::VROSC::MidiData*) == 0x8);
    // public System.Boolean Quantize
    // Size: 0x1
    // Offset: 0x30
    bool Quantize;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: Quantize and: QuantizeTolerance
    char __padding3[0x3] = {};
    // public System.Single QuantizeTolerance
    // Size: 0x4
    // Offset: 0x34
    float QuantizeTolerance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Int32 QuantizeBeatDivision
    // Size: 0x4
    // Offset: 0x38
    int QuantizeBeatDivision;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Boolean HasBeenOpened
    // Size: 0x1
    // Offset: 0x3C
    bool HasBeenOpened;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Get instance field reference: public System.String Id
    [[deprecated]] ::StringW& dyn_Id();
    // Get instance field reference: public VROSC.TransformDataModel TransformData
    [[deprecated]] ::VROSC::TransformDataModel*& dyn_TransformData();
    // Get instance field reference: public VROSC.MidiData MidiData
    [[deprecated]] ::VROSC::MidiData*& dyn_MidiData();
    // Get instance field reference: public System.Boolean Quantize
    [[deprecated]] bool& dyn_Quantize();
    // Get instance field reference: public System.Single QuantizeTolerance
    [[deprecated]] float& dyn_QuantizeTolerance();
    // Get instance field reference: public System.Int32 QuantizeBeatDivision
    [[deprecated]] int& dyn_QuantizeBeatDivision();
    // Get instance field reference: public System.Boolean HasBeenOpened
    [[deprecated]] bool& dyn_HasBeenOpened();
    // public System.Void .ctor()
    // Offset: 0x19475D8
    // Implemented from: VROSC.BaseDataModel
    // Base method: System.Void BaseDataModel::.ctor()
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static InstrumentDataModel* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::VROSC::InstrumentDataModel::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<InstrumentDataModel*, creationType>()));
    }
  }; // VROSC.InstrumentDataModel
  #pragma pack(pop)
  static check_size<sizeof(InstrumentDataModel), 60 + sizeof(bool)> __VROSC_InstrumentDataModelSizeCheck;
  static_assert(sizeof(InstrumentDataModel) == 0x3D);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: VROSC::InstrumentDataModel::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
