// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include <initializer_list>
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: VROSC.LoginUIPopupPanelBase
#include "VROSC/LoginUIPopupPanelBase.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: UIInputField
  class UIInputField;
}
// Forward declaring namespace: VROSC
namespace VROSC {
  // Forward declaring type: UIButton
  class UIButton;
  // Forward declaring type: Error
  struct Error;
}
// Completed forward declares
// Type namespace: VROSC
namespace VROSC {
  // Forward declaring type: LoginUIPopupChangePasswordPanel
  class LoginUIPopupChangePasswordPanel;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::VROSC::LoginUIPopupChangePasswordPanel);
DEFINE_IL2CPP_ARG_TYPE(::VROSC::LoginUIPopupChangePasswordPanel*, "VROSC", "LoginUIPopupChangePasswordPanel");
// Type namespace: VROSC
namespace VROSC {
  // Size: 0x58
  #pragma pack(push, 1)
  // Autogenerated type: VROSC.LoginUIPopupChangePasswordPanel
  // [TokenAttribute] Offset: FFFFFFFF
  class LoginUIPopupChangePasswordPanel : public ::VROSC::LoginUIPopupPanelBase {
    public:
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // private UIInputField _currentPasswordInput
    // Size: 0x8
    // Offset: 0x30
    ::GlobalNamespace::UIInputField* currentPasswordInput;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::UIInputField*) == 0x8);
    // private UIInputField _newPasswordInput
    // Size: 0x8
    // Offset: 0x38
    ::GlobalNamespace::UIInputField* newPasswordInput;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::UIInputField*) == 0x8);
    // private UIInputField _repeatPasswordInput
    // Size: 0x8
    // Offset: 0x40
    ::GlobalNamespace::UIInputField* repeatPasswordInput;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::UIInputField*) == 0x8);
    // private VROSC.UIButton _confirmButton
    // Size: 0x8
    // Offset: 0x48
    ::VROSC::UIButton* confirmButton;
    // Field size check
    static_assert(sizeof(::VROSC::UIButton*) == 0x8);
    // private VROSC.UIButton _cancelButton
    // Size: 0x8
    // Offset: 0x50
    ::VROSC::UIButton* cancelButton;
    // Field size check
    static_assert(sizeof(::VROSC::UIButton*) == 0x8);
    public:
    // Get instance field reference: private UIInputField _currentPasswordInput
    ::GlobalNamespace::UIInputField*& dyn__currentPasswordInput();
    // Get instance field reference: private UIInputField _newPasswordInput
    ::GlobalNamespace::UIInputField*& dyn__newPasswordInput();
    // Get instance field reference: private UIInputField _repeatPasswordInput
    ::GlobalNamespace::UIInputField*& dyn__repeatPasswordInput();
    // Get instance field reference: private VROSC.UIButton _confirmButton
    ::VROSC::UIButton*& dyn__confirmButton();
    // Get instance field reference: private VROSC.UIButton _cancelButton
    ::VROSC::UIButton*& dyn__cancelButton();
    // private System.Void Awake()
    // Offset: 0x13909B4
    void Awake();
    // private System.Void OnDestroy()
    // Offset: 0x1390C0C
    void OnDestroy();
    // private System.Void ConfirmButtonPressed()
    // Offset: 0x13910CC
    void ConfirmButtonPressed();
    // private System.Void CancelButtonPressed()
    // Offset: 0x139136C
    void CancelButtonPressed();
    // private System.Void PasswordChangeSucceeded()
    // Offset: 0x1391384
    void PasswordChangeSucceeded();
    // private System.Void PasswordChangeFailed(VROSC.Error error)
    // Offset: 0x139150C
    void PasswordChangeFailed(::VROSC::Error error);
    // public System.Void .ctor()
    // Offset: 0x1391710
    // Implemented from: VROSC.LoginUIPopupPanelBase
    // Base method: System.Void LoginUIPopupPanelBase::.ctor()
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static LoginUIPopupChangePasswordPanel* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::VROSC::LoginUIPopupChangePasswordPanel::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<LoginUIPopupChangePasswordPanel*, creationType>()));
    }
    // public override System.Void Open(params System.Object[] parameters)
    // Offset: 0x1390E64
    // Implemented from: VROSC.LoginUIPopupPanelBase
    // Base method: System.Void LoginUIPopupPanelBase::Open(params System.Object[] parameters)
    void Open(::ArrayW<::Il2CppObject*> parameters);
    // protected override System.Void EnableUI(System.Boolean enable)
    // Offset: 0x1390F80
    // Implemented from: VROSC.LoginUIPopupPanelBase
    // Base method: System.Void LoginUIPopupPanelBase::EnableUI(System.Boolean enable)
    void EnableUI(bool enable);
  }; // VROSC.LoginUIPopupChangePasswordPanel
  #pragma pack(pop)
  static check_size<sizeof(LoginUIPopupChangePasswordPanel), 80 + sizeof(::VROSC::UIButton*)> __VROSC_LoginUIPopupChangePasswordPanelSizeCheck;
  static_assert(sizeof(LoginUIPopupChangePasswordPanel) == 0x58);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: VROSC::LoginUIPopupChangePasswordPanel::Awake
// Il2CppName: Awake
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::LoginUIPopupChangePasswordPanel::*)()>(&VROSC::LoginUIPopupChangePasswordPanel::Awake)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(VROSC::LoginUIPopupChangePasswordPanel*), "Awake", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: VROSC::LoginUIPopupChangePasswordPanel::OnDestroy
// Il2CppName: OnDestroy
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::LoginUIPopupChangePasswordPanel::*)()>(&VROSC::LoginUIPopupChangePasswordPanel::OnDestroy)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(VROSC::LoginUIPopupChangePasswordPanel*), "OnDestroy", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: VROSC::LoginUIPopupChangePasswordPanel::ConfirmButtonPressed
// Il2CppName: ConfirmButtonPressed
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::LoginUIPopupChangePasswordPanel::*)()>(&VROSC::LoginUIPopupChangePasswordPanel::ConfirmButtonPressed)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(VROSC::LoginUIPopupChangePasswordPanel*), "ConfirmButtonPressed", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: VROSC::LoginUIPopupChangePasswordPanel::CancelButtonPressed
// Il2CppName: CancelButtonPressed
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::LoginUIPopupChangePasswordPanel::*)()>(&VROSC::LoginUIPopupChangePasswordPanel::CancelButtonPressed)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(VROSC::LoginUIPopupChangePasswordPanel*), "CancelButtonPressed", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: VROSC::LoginUIPopupChangePasswordPanel::PasswordChangeSucceeded
// Il2CppName: PasswordChangeSucceeded
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::LoginUIPopupChangePasswordPanel::*)()>(&VROSC::LoginUIPopupChangePasswordPanel::PasswordChangeSucceeded)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(VROSC::LoginUIPopupChangePasswordPanel*), "PasswordChangeSucceeded", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: VROSC::LoginUIPopupChangePasswordPanel::PasswordChangeFailed
// Il2CppName: PasswordChangeFailed
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::LoginUIPopupChangePasswordPanel::*)(::VROSC::Error)>(&VROSC::LoginUIPopupChangePasswordPanel::PasswordChangeFailed)> {
  static const MethodInfo* get() {
    static auto* error = &::il2cpp_utils::GetClassFromName("VROSC", "Error")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(VROSC::LoginUIPopupChangePasswordPanel*), "PasswordChangeFailed", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{error});
  }
};
// Writing MetadataGetter for method: VROSC::LoginUIPopupChangePasswordPanel::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
// Writing MetadataGetter for method: VROSC::LoginUIPopupChangePasswordPanel::Open
// Il2CppName: Open
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::LoginUIPopupChangePasswordPanel::*)(::ArrayW<::Il2CppObject*>)>(&VROSC::LoginUIPopupChangePasswordPanel::Open)> {
  static const MethodInfo* get() {
    static auto* parameters = &il2cpp_functions::array_class_get(::il2cpp_utils::GetClassFromName("System", "Object"), 1)->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(VROSC::LoginUIPopupChangePasswordPanel*), "Open", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{parameters});
  }
};
// Writing MetadataGetter for method: VROSC::LoginUIPopupChangePasswordPanel::EnableUI
// Il2CppName: EnableUI
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::LoginUIPopupChangePasswordPanel::*)(bool)>(&VROSC::LoginUIPopupChangePasswordPanel::EnableUI)> {
  static const MethodInfo* get() {
    static auto* enable = &::il2cpp_utils::GetClassFromName("System", "Boolean")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(VROSC::LoginUIPopupChangePasswordPanel*), "EnableUI", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{enable});
  }
};
