// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include <initializer_list>
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: VROSC.LoginUIPopupPanelBase
#include "VROSC/LoginUIPopupPanelBase.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: UIInputField
  class UIInputField;
}
// Forward declaring namespace: VROSC
namespace VROSC {
  // Forward declaring type: UISlideToggle
  class UISlideToggle;
  // Forward declaring type: UIButton
  class UIButton;
  // Forward declaring type: Error
  struct Error;
}
// Completed forward declares
// Type namespace: VROSC
namespace VROSC {
  // Forward declaring type: LoginUIPopupLoginPanel
  class LoginUIPopupLoginPanel;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::VROSC::LoginUIPopupLoginPanel);
DEFINE_IL2CPP_ARG_TYPE(::VROSC::LoginUIPopupLoginPanel*, "VROSC", "LoginUIPopupLoginPanel");
// Type namespace: VROSC
namespace VROSC {
  // Size: 0x60
  #pragma pack(push, 1)
  // Autogenerated type: VROSC.LoginUIPopupLoginPanel
  // [TokenAttribute] Offset: FFFFFFFF
  class LoginUIPopupLoginPanel : public ::VROSC::LoginUIPopupPanelBase {
    public:
    public:
    // private UIInputField _emailInput
    // Size: 0x8
    // Offset: 0x30
    ::GlobalNamespace::UIInputField* emailInput;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::UIInputField*) == 0x8);
    // private UIInputField _passwordInput
    // Size: 0x8
    // Offset: 0x38
    ::GlobalNamespace::UIInputField* passwordInput;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::UIInputField*) == 0x8);
    // private VROSC.UISlideToggle _rememberMeToggle
    // Size: 0x8
    // Offset: 0x40
    ::VROSC::UISlideToggle* rememberMeToggle;
    // Field size check
    static_assert(sizeof(::VROSC::UISlideToggle*) == 0x8);
    // private VROSC.UIButton _loginButton
    // Size: 0x8
    // Offset: 0x48
    ::VROSC::UIButton* loginButton;
    // Field size check
    static_assert(sizeof(::VROSC::UIButton*) == 0x8);
    // private VROSC.UIButton _createAccountButton
    // Size: 0x8
    // Offset: 0x50
    ::VROSC::UIButton* createAccountButton;
    // Field size check
    static_assert(sizeof(::VROSC::UIButton*) == 0x8);
    // private VROSC.UIButton _resetPasswordButton
    // Size: 0x8
    // Offset: 0x58
    ::VROSC::UIButton* resetPasswordButton;
    // Field size check
    static_assert(sizeof(::VROSC::UIButton*) == 0x8);
    public:
    // Get instance field reference: private UIInputField _emailInput
    [[deprecated]] ::GlobalNamespace::UIInputField*& dyn__emailInput();
    // Get instance field reference: private UIInputField _passwordInput
    [[deprecated]] ::GlobalNamespace::UIInputField*& dyn__passwordInput();
    // Get instance field reference: private VROSC.UISlideToggle _rememberMeToggle
    [[deprecated]] ::VROSC::UISlideToggle*& dyn__rememberMeToggle();
    // Get instance field reference: private VROSC.UIButton _loginButton
    [[deprecated]] ::VROSC::UIButton*& dyn__loginButton();
    // Get instance field reference: private VROSC.UIButton _createAccountButton
    [[deprecated]] ::VROSC::UIButton*& dyn__createAccountButton();
    // Get instance field reference: private VROSC.UIButton _resetPasswordButton
    [[deprecated]] ::VROSC::UIButton*& dyn__resetPasswordButton();
    // private System.Void Awake()
    // Offset: 0x19B29D4
    void Awake();
    // private System.Void OnDestroy()
    // Offset: 0x19B2CC8
    void OnDestroy();
    // private System.Void LoginButtonPressed()
    // Offset: 0x19B3080
    void LoginButtonPressed();
    // private System.Void CreateAccountButtonPressed()
    // Offset: 0x19B32AC
    void CreateAccountButtonPressed();
    // private System.Void ResetPasswordButtonPressed()
    // Offset: 0x19B34D8
    void ResetPasswordButtonPressed();
    // private System.Void UserLoginSucceeded(System.String email, System.Boolean isVerified)
    // Offset: 0x19B36C8
    void UserLoginSucceeded(::StringW email, bool isVerified);
    // private System.Void UserLoginFailed(VROSC.Error error)
    // Offset: 0x19B38B4
    void UserLoginFailed(::VROSC::Error error);
    // private System.Void CreateUserFailed(VROSC.Error error)
    // Offset: 0x19B3ACC
    void CreateUserFailed(::VROSC::Error error);
    // private System.Void ResetPasswordSucceeded()
    // Offset: 0x19B3CE4
    void ResetPasswordSucceeded();
    // private System.Void ResetPasswordFailed(VROSC.Error error)
    // Offset: 0x19B3E94
    void ResetPasswordFailed(::VROSC::Error error);
    // public System.Void .ctor()
    // Offset: 0x19B4098
    // Implemented from: VROSC.LoginUIPopupPanelBase
    // Base method: System.Void LoginUIPopupPanelBase::.ctor()
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static LoginUIPopupLoginPanel* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::VROSC::LoginUIPopupLoginPanel::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<LoginUIPopupLoginPanel*, creationType>()));
    }
    // public override System.Void Open(params System.Object[] parameters)
    // Offset: 0x19B2C40
    // Implemented from: VROSC.LoginUIPopupPanelBase
    // Base method: System.Void LoginUIPopupPanelBase::Open(params System.Object[] parameters)
    void Open(::ArrayW<::Il2CppObject*> parameters);
    // protected override System.Void EnableUI(System.Boolean enable)
    // Offset: 0x19B2F34
    // Implemented from: VROSC.LoginUIPopupPanelBase
    // Base method: System.Void LoginUIPopupPanelBase::EnableUI(System.Boolean enable)
    void EnableUI(bool enable);
  }; // VROSC.LoginUIPopupLoginPanel
  #pragma pack(pop)
  static check_size<sizeof(LoginUIPopupLoginPanel), 88 + sizeof(::VROSC::UIButton*)> __VROSC_LoginUIPopupLoginPanelSizeCheck;
  static_assert(sizeof(LoginUIPopupLoginPanel) == 0x60);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: VROSC::LoginUIPopupLoginPanel::Awake
// Il2CppName: Awake
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::LoginUIPopupLoginPanel::*)()>(&VROSC::LoginUIPopupLoginPanel::Awake)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(VROSC::LoginUIPopupLoginPanel*), "Awake", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: VROSC::LoginUIPopupLoginPanel::OnDestroy
// Il2CppName: OnDestroy
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::LoginUIPopupLoginPanel::*)()>(&VROSC::LoginUIPopupLoginPanel::OnDestroy)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(VROSC::LoginUIPopupLoginPanel*), "OnDestroy", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: VROSC::LoginUIPopupLoginPanel::LoginButtonPressed
// Il2CppName: LoginButtonPressed
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::LoginUIPopupLoginPanel::*)()>(&VROSC::LoginUIPopupLoginPanel::LoginButtonPressed)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(VROSC::LoginUIPopupLoginPanel*), "LoginButtonPressed", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: VROSC::LoginUIPopupLoginPanel::CreateAccountButtonPressed
// Il2CppName: CreateAccountButtonPressed
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::LoginUIPopupLoginPanel::*)()>(&VROSC::LoginUIPopupLoginPanel::CreateAccountButtonPressed)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(VROSC::LoginUIPopupLoginPanel*), "CreateAccountButtonPressed", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: VROSC::LoginUIPopupLoginPanel::ResetPasswordButtonPressed
// Il2CppName: ResetPasswordButtonPressed
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::LoginUIPopupLoginPanel::*)()>(&VROSC::LoginUIPopupLoginPanel::ResetPasswordButtonPressed)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(VROSC::LoginUIPopupLoginPanel*), "ResetPasswordButtonPressed", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: VROSC::LoginUIPopupLoginPanel::UserLoginSucceeded
// Il2CppName: UserLoginSucceeded
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::LoginUIPopupLoginPanel::*)(::StringW, bool)>(&VROSC::LoginUIPopupLoginPanel::UserLoginSucceeded)> {
  static const MethodInfo* get() {
    static auto* email = &::il2cpp_utils::GetClassFromName("System", "String")->byval_arg;
    static auto* isVerified = &::il2cpp_utils::GetClassFromName("System", "Boolean")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(VROSC::LoginUIPopupLoginPanel*), "UserLoginSucceeded", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{email, isVerified});
  }
};
// Writing MetadataGetter for method: VROSC::LoginUIPopupLoginPanel::UserLoginFailed
// Il2CppName: UserLoginFailed
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::LoginUIPopupLoginPanel::*)(::VROSC::Error)>(&VROSC::LoginUIPopupLoginPanel::UserLoginFailed)> {
  static const MethodInfo* get() {
    static auto* error = &::il2cpp_utils::GetClassFromName("VROSC", "Error")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(VROSC::LoginUIPopupLoginPanel*), "UserLoginFailed", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{error});
  }
};
// Writing MetadataGetter for method: VROSC::LoginUIPopupLoginPanel::CreateUserFailed
// Il2CppName: CreateUserFailed
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::LoginUIPopupLoginPanel::*)(::VROSC::Error)>(&VROSC::LoginUIPopupLoginPanel::CreateUserFailed)> {
  static const MethodInfo* get() {
    static auto* error = &::il2cpp_utils::GetClassFromName("VROSC", "Error")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(VROSC::LoginUIPopupLoginPanel*), "CreateUserFailed", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{error});
  }
};
// Writing MetadataGetter for method: VROSC::LoginUIPopupLoginPanel::ResetPasswordSucceeded
// Il2CppName: ResetPasswordSucceeded
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::LoginUIPopupLoginPanel::*)()>(&VROSC::LoginUIPopupLoginPanel::ResetPasswordSucceeded)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(VROSC::LoginUIPopupLoginPanel*), "ResetPasswordSucceeded", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: VROSC::LoginUIPopupLoginPanel::ResetPasswordFailed
// Il2CppName: ResetPasswordFailed
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::LoginUIPopupLoginPanel::*)(::VROSC::Error)>(&VROSC::LoginUIPopupLoginPanel::ResetPasswordFailed)> {
  static const MethodInfo* get() {
    static auto* error = &::il2cpp_utils::GetClassFromName("VROSC", "Error")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(VROSC::LoginUIPopupLoginPanel*), "ResetPasswordFailed", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{error});
  }
};
// Writing MetadataGetter for method: VROSC::LoginUIPopupLoginPanel::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
// Writing MetadataGetter for method: VROSC::LoginUIPopupLoginPanel::Open
// Il2CppName: Open
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::LoginUIPopupLoginPanel::*)(::ArrayW<::Il2CppObject*>)>(&VROSC::LoginUIPopupLoginPanel::Open)> {
  static const MethodInfo* get() {
    static auto* parameters = &il2cpp_functions::array_class_get(::il2cpp_utils::GetClassFromName("System", "Object"), 1)->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(VROSC::LoginUIPopupLoginPanel*), "Open", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{parameters});
  }
};
// Writing MetadataGetter for method: VROSC::LoginUIPopupLoginPanel::EnableUI
// Il2CppName: EnableUI
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::LoginUIPopupLoginPanel::*)(bool)>(&VROSC::LoginUIPopupLoginPanel::EnableUI)> {
  static const MethodInfo* get() {
    static auto* enable = &::il2cpp_utils::GetClassFromName("System", "Boolean")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(VROSC::LoginUIPopupLoginPanel*), "EnableUI", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{enable});
  }
};
