// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: VROSC
namespace VROSC {
  // Forward declaring type: LoopStation
  class LoopStation;
  // Forward declaring type: LoopPlayerUI
  class LoopPlayerUI;
  // Forward declaring type: InteractionDisabler
  class InteractionDisabler;
  // Forward declaring type: LoopPlayerPlaybackController
  class LoopPlayerPlaybackController;
  // Forward declaring type: LoopPlayerMover
  class LoopPlayerMover;
  // Forward declaring type: LoopPlayerAutoMover
  class LoopPlayerAutoMover;
  // Forward declaring type: LoopStationGroup
  class LoopStationGroup;
  // Forward declaring type: LoopPlaybackConfigOverride
  class LoopPlaybackConfigOverride;
  // Forward declaring type: LoopPlaybackConfig
  class LoopPlaybackConfig;
  // Forward declaring type: PlaybackProgressUIData
  struct PlaybackProgressUIData;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`2<T1, T2>
  template<typename T1, typename T2>
  class Action_2;
}
// Completed forward declares
// Type namespace: VROSC
namespace VROSC {
  // Forward declaring type: LoopPlayer
  class LoopPlayer;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::VROSC::LoopPlayer);
DEFINE_IL2CPP_ARG_TYPE(::VROSC::LoopPlayer*, "VROSC", "LoopPlayer");
// Type namespace: VROSC
namespace VROSC {
  // Size: 0x88
  #pragma pack(push, 1)
  // Autogenerated type: VROSC.LoopPlayer
  // [TokenAttribute] Offset: FFFFFFFF
  class LoopPlayer : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // private VROSC.LoopStation _loopStation
    // Size: 0x8
    // Offset: 0x18
    ::VROSC::LoopStation* loopStation;
    // Field size check
    static_assert(sizeof(::VROSC::LoopStation*) == 0x8);
    // private VROSC.LoopPlayerUI _ui
    // Size: 0x8
    // Offset: 0x20
    ::VROSC::LoopPlayerUI* ui;
    // Field size check
    static_assert(sizeof(::VROSC::LoopPlayerUI*) == 0x8);
    // private VROSC.InteractionDisabler _disabler
    // Size: 0x8
    // Offset: 0x28
    ::VROSC::InteractionDisabler* disabler;
    // Field size check
    static_assert(sizeof(::VROSC::InteractionDisabler*) == 0x8);
    // private VROSC.LoopPlayerPlaybackController _playBack
    // Size: 0x8
    // Offset: 0x30
    ::VROSC::LoopPlayerPlaybackController* playBack;
    // Field size check
    static_assert(sizeof(::VROSC::LoopPlayerPlaybackController*) == 0x8);
    // private VROSC.LoopPlayerMover _mover
    // Size: 0x8
    // Offset: 0x38
    ::VROSC::LoopPlayerMover* mover;
    // Field size check
    static_assert(sizeof(::VROSC::LoopPlayerMover*) == 0x8);
    // private VROSC.LoopPlayerAutoMover _autoMover
    // Size: 0x8
    // Offset: 0x40
    ::VROSC::LoopPlayerAutoMover* autoMover;
    // Field size check
    static_assert(sizeof(::VROSC::LoopPlayerAutoMover*) == 0x8);
    // private System.String <TrackId>k__BackingField
    // Size: 0x8
    // Offset: 0x48
    ::StringW TrackId;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.Action`2<VROSC.LoopPlayer,System.Boolean> OnDelete
    // Size: 0x8
    // Offset: 0x50
    ::System::Action_2<::VROSC::LoopPlayer*, bool>* OnDelete;
    // Field size check
    static_assert(sizeof(::System::Action_2<::VROSC::LoopPlayer*, bool>*) == 0x8);
    // public System.Action`2<VROSC.LoopPlayer,System.Boolean> OnSoloChanged
    // Size: 0x8
    // Offset: 0x58
    ::System::Action_2<::VROSC::LoopPlayer*, bool>* OnSoloChanged;
    // Field size check
    static_assert(sizeof(::System::Action_2<::VROSC::LoopPlayer*, bool>*) == 0x8);
    // public System.Action`2<VROSC.LoopPlayer,System.Boolean> OnGrabbed
    // Size: 0x8
    // Offset: 0x60
    ::System::Action_2<::VROSC::LoopPlayer*, bool>* OnGrabbed;
    // Field size check
    static_assert(sizeof(::System::Action_2<::VROSC::LoopPlayer*, bool>*) == 0x8);
    // private System.Boolean <IsShownAsComplete>k__BackingField
    // Size: 0x1
    // Offset: 0x68
    bool IsShownAsComplete;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean <IsBeingRecorded>k__BackingField
    // Size: 0x1
    // Offset: 0x69
    bool IsBeingRecorded;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: IsBeingRecorded and: BelongsToGroup
    char __padding11[0x6] = {};
    // private VROSC.LoopStationGroup <BelongsToGroup>k__BackingField
    // Size: 0x8
    // Offset: 0x70
    ::VROSC::LoopStationGroup* BelongsToGroup;
    // Field size check
    static_assert(sizeof(::VROSC::LoopStationGroup*) == 0x8);
    // private System.Int32 <PositionInGroup>k__BackingField
    // Size: 0x4
    // Offset: 0x78
    int PositionInGroup;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: PositionInGroup and: InstrumentName
    char __padding13[0x4] = {};
    // private System.String <InstrumentName>k__BackingField
    // Size: 0x8
    // Offset: 0x80
    ::StringW InstrumentName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: private VROSC.LoopStation _loopStation
    [[deprecated("Use field access instead!")]] ::VROSC::LoopStation*& dyn__loopStation();
    // Get instance field reference: private VROSC.LoopPlayerUI _ui
    [[deprecated("Use field access instead!")]] ::VROSC::LoopPlayerUI*& dyn__ui();
    // Get instance field reference: private VROSC.InteractionDisabler _disabler
    [[deprecated("Use field access instead!")]] ::VROSC::InteractionDisabler*& dyn__disabler();
    // Get instance field reference: private VROSC.LoopPlayerPlaybackController _playBack
    [[deprecated("Use field access instead!")]] ::VROSC::LoopPlayerPlaybackController*& dyn__playBack();
