// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: VROSC.BeatCounter
#include "VROSC/BeatCounter.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: VROSC
namespace VROSC {
  // Forward declaring type: MovementPlane
  class MovementPlane;
  // Forward declaring type: LoopStationButtons
  class LoopStationButtons;
  // Forward declaring type: LoopStationLoopHandler
  class LoopStationLoopHandler;
  // Forward declaring type: LoopStationRecorder
  class LoopStationRecorder;
  // Forward declaring type: LoopStationRecordingButton
  class LoopStationRecordingButton;
  // Forward declaring type: LoopStationGroupCore
  class LoopStationGroupCore;
  // Forward declaring type: TransformMover
  class TransformMover;
  // Forward declaring type: SelectionBar
  class SelectionBar;
  // Forward declaring type: LoopStationSoloHandler
  class LoopStationSoloHandler;
  // Forward declaring type: LoopStationDataController
  class LoopStationDataController;
  // Forward declaring type: LoopPlayer
  class LoopPlayer;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: GameObject
  class GameObject;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
}
// Completed forward declares
// Type namespace: VROSC
namespace VROSC {
  // Forward declaring type: LoopStation
  class LoopStation;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::VROSC::LoopStation);
DEFINE_IL2CPP_ARG_TYPE(::VROSC::LoopStation*, "VROSC", "LoopStation");
// Type namespace: VROSC
namespace VROSC {
  // Size: 0x99
  #pragma pack(push, 1)
  // Autogenerated type: VROSC.LoopStation
  // [TokenAttribute] Offset: FFFFFFFF
  class LoopStation : public ::UnityEngine::MonoBehaviour {
    public:
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // private VROSC.MovementPlane _movementPlane
    // Size: 0x8
    // Offset: 0x18
    ::VROSC::MovementPlane* movementPlane;
    // Field size check
    static_assert(sizeof(::VROSC::MovementPlane*) == 0x8);
    // private VROSC.LoopStationButtons _buttons
    // Size: 0x8
    // Offset: 0x20
    ::VROSC::LoopStationButtons* buttons;
    // Field size check
    static_assert(sizeof(::VROSC::LoopStationButtons*) == 0x8);
    // private VROSC.LoopStationLoopHandler _loopHandler
    // Size: 0x8
    // Offset: 0x28
    ::VROSC::LoopStationLoopHandler* loopHandler;
    // Field size check
    static_assert(sizeof(::VROSC::LoopStationLoopHandler*) == 0x8);
    // private VROSC.LoopStationRecorder _recorder
    // Size: 0x8
    // Offset: 0x30
    ::VROSC::LoopStationRecorder* recorder;
    // Field size check
    static_assert(sizeof(::VROSC::LoopStationRecorder*) == 0x8);
    // private VROSC.LoopStationRecordingButton _recordingButton
    // Size: 0x8
    // Offset: 0x38
    ::VROSC::LoopStationRecordingButton* recordingButton;
    // Field size check
    static_assert(sizeof(::VROSC::LoopStationRecordingButton*) == 0x8);
    // private VROSC.LoopStationGroupCore _groups
    // Size: 0x8
    // Offset: 0x40
    ::VROSC::LoopStationGroupCore* groups;
    // Field size check
    static_assert(sizeof(::VROSC::LoopStationGroupCore*) == 0x8);
    // private VROSC.TransformMover _mover
    // Size: 0x8
    // Offset: 0x48
    ::VROSC::TransformMover* mover;
    // Field size check
    static_assert(sizeof(::VROSC::TransformMover*) == 0x8);
    // private UnityEngine.Transform _loopLocation
    // Size: 0x8
    // Offset: 0x50
    ::UnityEngine::Transform* loopLocation;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private UnityEngine.Transform _launchpadParent
    // Size: 0x8
    // Offset: 0x58
    ::UnityEngine::Transform* launchpadParent;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private VROSC.SelectionBar _loopLengthSelectionBar
    // Size: 0x8
    // Offset: 0x60
    ::VROSC::SelectionBar* loopLengthSelectionBar;
    // Field size check
    static_assert(sizeof(::VROSC::SelectionBar*) == 0x8);
    // private UnityEngine.GameObject _loopLengthUIParent
    // Size: 0x8
    // Offset: 0x68
    ::UnityEngine::GameObject* loopLengthUIParent;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private VROSC.LoopStationSoloHandler _soloHandler
    // Size: 0x8
    // Offset: 0x70
    ::VROSC::LoopStationSoloHandler* soloHandler;
    // Field size check
    static_assert(sizeof(::VROSC::LoopStationSoloHandler*) == 0x8);
    // public System.Action`1<System.Single> OnBPMSet
    // Size: 0x8
    // Offset: 0x78
    ::System::Action_1<float>* OnBPMSet;
    // Field size check
    static_assert(sizeof(::System::Action_1<float>*) == 0x8);
    // public System.Action`1<System.Single> OnVolumeChanged
    // Size: 0x8
    // Offset: 0x80
    ::System::Action_1<float>* OnVolumeChanged;
    // Field size check
    static_assert(sizeof(::System::Action_1<float>*) == 0x8);
    // private System.Int32 <LongestLoopLengthSamples>k__BackingField
    // Size: 0x4
    // Offset: 0x88
    int LongestLoopLengthSamples;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: LongestLoopLengthSamples and: Data
    char __padding14[0x4] = {};
    // private VROSC.LoopStationDataController <Data>k__BackingField
    // Size: 0x8
    // Offset: 0x90
    ::VROSC::LoopStationDataController* Data;
    // Field size check
    static_assert(sizeof(::VROSC::LoopStationDataController*) == 0x8);
    // private System.Boolean <IsSetup>k__BackingField
    // Size: 0x1
    // Offset: 0x98
    bool IsSetup;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: private VROSC.MovementPlane _movementPlane
    ::VROSC::MovementPlane*& dyn__movementPlane();
    // Get instance field reference: private VROSC.LoopStationButtons _buttons
    ::VROSC::LoopStationButtons*& dyn__buttons();
    // Get instance field reference: private VROSC.LoopStationLoopHandler _loopHandler
    ::VROSC::LoopStationLoopHandler*& dyn__loopHandler();
    // Get instance field reference: private VROSC.LoopStationRecorder _recorder
    ::VROSC::LoopStationRecorder*& dyn__recorder();
    // Get instance field reference: private VROSC.LoopStationRecordingButton _recordingButton
    ::VROSC::LoopStationRecordingButton*& dyn__recordingButton();
