// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Type namespace: VROSC
namespace VROSC {
  // Forward declaring type: LoopPlaybackConfigOverrideFlags
  class LoopPlaybackConfigOverrideFlags;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::VROSC::LoopPlaybackConfigOverrideFlags);
DEFINE_IL2CPP_ARG_TYPE(::VROSC::LoopPlaybackConfigOverrideFlags*, "VROSC", "LoopPlaybackConfigOverrideFlags");
// Type namespace: VROSC
namespace VROSC {
  // Size: 0x16
  #pragma pack(push, 1)
  // Autogenerated type: VROSC.LoopPlaybackConfigOverrideFlags
  // [TokenAttribute] Offset: FFFFFFFF
  class LoopPlaybackConfigOverrideFlags : public ::Il2CppObject {
    public:
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // public System.Boolean OverrideStartMode
    // Size: 0x1
    // Offset: 0x10
    bool OverrideStartMode;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean OverrideStopMode
    // Size: 0x1
    // Offset: 0x11
    bool OverrideStopMode;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean OverrideFadeIn
    // Size: 0x1
    // Offset: 0x12
    bool OverrideFadeIn;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean OverrideFadeOut
    // Size: 0x1
    // Offset: 0x13
    bool OverrideFadeOut;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean OverrideOneShot
    // Size: 0x1
    // Offset: 0x14
    bool OverrideOneShot;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean OverrideRetrigger
    // Size: 0x1
    // Offset: 0x15
    bool OverrideRetrigger;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Get instance field reference: public System.Boolean OverrideStartMode
    bool& dyn_OverrideStartMode();
    // Get instance field reference: public System.Boolean OverrideStopMode
    bool& dyn_OverrideStopMode();
    // Get instance field reference: public System.Boolean OverrideFadeIn
    bool& dyn_OverrideFadeIn();
    // Get instance field reference: public System.Boolean OverrideFadeOut
    bool& dyn_OverrideFadeOut();
    // Get instance field reference: public System.Boolean OverrideOneShot
    bool& dyn_OverrideOneShot();
    // Get instance field reference: public System.Boolean OverrideRetrigger
    bool& dyn_OverrideRetrigger();
    // public System.Void .ctor()
    // Offset: 0x1396DE8
    // Implemented from: System.Object
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static LoopPlaybackConfigOverrideFlags* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::VROSC::LoopPlaybackConfigOverrideFlags::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<LoopPlaybackConfigOverrideFlags*, creationType>()));
    }
  }; // VROSC.LoopPlaybackConfigOverrideFlags
  #pragma pack(pop)
  static check_size<sizeof(LoopPlaybackConfigOverrideFlags), 21 + sizeof(bool)> __VROSC_LoopPlaybackConfigOverrideFlagsSizeCheck;
  static_assert(sizeof(LoopPlaybackConfigOverrideFlags) == 0x16);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: VROSC::LoopPlaybackConfigOverrideFlags::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
