// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: VROSC
namespace VROSC {
  // Forward declaring type: TransformData
  class TransformData;
}
// Completed forward declares
// Type namespace: VROSC
namespace VROSC {
  // Forward declaring type: LoopStationLaunchpad
  class LoopStationLaunchpad;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::VROSC::LoopStationLaunchpad);
DEFINE_IL2CPP_ARG_TYPE(::VROSC::LoopStationLaunchpad*, "VROSC", "LoopStationLaunchpad");
// Type namespace: VROSC
namespace VROSC {
  // Size: 0x30
  #pragma pack(push, 1)
  // Autogenerated type: VROSC.LoopStationLaunchpad
  // [TokenAttribute] Offset: FFFFFFFF
  class LoopStationLaunchpad : public ::Il2CppObject {
    public:
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // public System.Boolean IsGroup
    // Size: 0x1
    // Offset: 0x10
    bool IsGroup;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: IsGroup and: _ID
    char __padding0[0x7] = {};
    // public System.String ID
    // Size: 0x8
    // Offset: 0x18
    ::StringW _ID;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String TargetID
    // Size: 0x8
    // Offset: 0x20
    ::StringW TargetID;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public VROSC.TransformData TransformData
    // Size: 0x8
    // Offset: 0x28
    ::VROSC::TransformData* TransformData;
    // Field size check
    static_assert(sizeof(::VROSC::TransformData*) == 0x8);
    public:
    // Get instance field reference: public System.Boolean IsGroup
    bool& dyn_IsGroup();
    // Get instance field reference: public System.String ID
    ::StringW& dyn_ID();
    // Get instance field reference: public System.String TargetID
    ::StringW& dyn_TargetID();
    // Get instance field reference: public VROSC.TransformData TransformData
    ::VROSC::TransformData*& dyn_TransformData();
    // public System.Void .ctor()
    // Offset: 0x912E18
    // Implemented from: System.Object
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static LoopStationLaunchpad* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::VROSC::LoopStationLaunchpad::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<LoopStationLaunchpad*, creationType>()));
    }
  }; // VROSC.LoopStationLaunchpad
  #pragma pack(pop)
  static check_size<sizeof(LoopStationLaunchpad), 40 + sizeof(::VROSC::TransformData*)> __VROSC_LoopStationLaunchpadSizeCheck;
  static_assert(sizeof(LoopStationLaunchpad) == 0x30);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: VROSC::LoopStationLaunchpad::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
