// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: VROSC
namespace VROSC {
  // Forward declaring type: OverridePlaybackSettingsUI
  class OverridePlaybackSettingsUI;
  // Forward declaring type: LoopPlayButton
  class LoopPlayButton;
  // Forward declaring type: LoopPlaybackConfigOverride
  class LoopPlaybackConfigOverride;
  // Forward declaring type: LoopStationGroup
  class LoopStationGroup;
  // Forward declaring type: LoopStation
  class LoopStation;
  // Forward declaring type: LoopPlayer
  class LoopPlayer;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Color
  struct Color;
}
// Completed forward declares
// Type namespace: VROSC
namespace VROSC {
  // Forward declaring type: LoopStationGroupPlaybackUI
  class LoopStationGroupPlaybackUI;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::VROSC::LoopStationGroupPlaybackUI);
DEFINE_IL2CPP_ARG_TYPE(::VROSC::LoopStationGroupPlaybackUI*, "VROSC", "LoopStationGroupPlaybackUI");
// Type namespace: VROSC
namespace VROSC {
  // Size: 0x51
  #pragma pack(push, 1)
  // Autogenerated type: VROSC.LoopStationGroupPlaybackUI
  // [TokenAttribute] Offset: FFFFFFFF
  class LoopStationGroupPlaybackUI : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // private VROSC.OverridePlaybackSettingsUI _overridePlaybackSettingsUI
    // Size: 0x8
    // Offset: 0x18
    ::VROSC::OverridePlaybackSettingsUI* overridePlaybackSettingsUI;
    // Field size check
    static_assert(sizeof(::VROSC::OverridePlaybackSettingsUI*) == 0x8);
    // private VROSC.LoopPlayButton _playButton
    // Size: 0x8
    // Offset: 0x20
    ::VROSC::LoopPlayButton* playButton;
    // Field size check
    static_assert(sizeof(::VROSC::LoopPlayButton*) == 0x8);
    // private VROSC.LoopPlaybackConfigOverride <PlaybackConfig>k__BackingField
    // Size: 0x8
    // Offset: 0x28
    ::VROSC::LoopPlaybackConfigOverride* PlaybackConfig;
    // Field size check
    static_assert(sizeof(::VROSC::LoopPlaybackConfigOverride*) == 0x8);
    // private VROSC.LoopStationGroup _loopGroup
    // Size: 0x8
    // Offset: 0x30
    ::VROSC::LoopStationGroup* loopGroup;
    // Field size check
    static_assert(sizeof(::VROSC::LoopStationGroup*) == 0x8);
    // private VROSC.LoopStation _loopStation
    // Size: 0x8
    // Offset: 0x38
    ::VROSC::LoopStation* loopStation;
    // Field size check
    static_assert(sizeof(::VROSC::LoopStation*) == 0x8);
    // private VROSC.LoopPlayer _firstLoopPlayer
    // Size: 0x8
    // Offset: 0x40
    ::VROSC::LoopPlayer* firstLoopPlayer;
    // Field size check
    static_assert(sizeof(::VROSC::LoopPlayer*) == 0x8);
    // private VROSC.LoopPlayer _longestLoopPlayer
    // Size: 0x8
    // Offset: 0x48
    ::VROSC::LoopPlayer* longestLoopPlayer;
    // Field size check
    static_assert(sizeof(::VROSC::LoopPlayer*) == 0x8);
    // private System.Boolean _shouldUpdatePlayback
    // Size: 0x1
    // Offset: 0x50
    bool shouldUpdatePlayback;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: private VROSC.OverridePlaybackSettingsUI _overridePlaybackSettingsUI
    [[deprecated]] ::VROSC::OverridePlaybackSettingsUI*& dyn__overridePlaybackSettingsUI();
    // Get instance field reference: private VROSC.LoopPlayButton _playButton
    [[deprecated]] ::VROSC::LoopPlayButton*& dyn__playButton();
    // Get instance field reference: private VROSC.LoopPlaybackConfigOverride <PlaybackConfig>k__BackingField
    [[deprecated]] ::VROSC::LoopPlaybackConfigOverride*& dyn_$PlaybackConfig$k__BackingField();
    // Get instance field reference: private VROSC.LoopStationGroup _loopGroup
    [[deprecated]] ::VROSC::LoopStationGroup*& dyn__loopGroup();
    // Get instance field reference: private VROSC.LoopStation _loopStation
    [[deprecated]] ::VROSC::LoopStation*& dyn__loopStation();
    // Get instance field reference: private VROSC.LoopPlayer _firstLoopPlayer
    [[deprecated]] ::VROSC::LoopPlayer*& dyn__firstLoopPlayer();
    // Get instance field reference: private VROSC.LoopPlayer _longestLoopPlayer
    [[deprecated]] ::VROSC::LoopPlayer*& dyn__longestLoopPlayer();
    // Get instance field reference: private System.Boolean _shouldUpdatePlayback
    [[deprecated]] bool& dyn__shouldUpdatePlayback();
    // public VROSC.LoopPlaybackConfigOverride get_PlaybackConfig()
    // Offset: 0x1970464
    ::VROSC::LoopPlaybackConfigOverride* get_PlaybackConfig();
    // private System.Void set_PlaybackConfig(VROSC.LoopPlaybackConfigOverride value)
    // Offset: 0x197045C
    void set_PlaybackConfig(::VROSC::LoopPlaybackConfigOverride* value);
    // public System.Void Setup(VROSC.LoopStation loopStation, VROSC.LoopStationGroup loopGroup, VROSC.LoopPlaybackConfigOverride configOverride)
    // Offset: 0x197046C
    void Setup(::VROSC::LoopStation* loopStation, ::VROSC::LoopStationGroup* loopGroup, ::VROSC::LoopPlaybackConfigOverride* configOverride);
    // private System.Void LoopAdded(VROSC.LoopPlayer player)
    // Offset: 0x1970708
    void LoopAdded(::VROSC::LoopPlayer* player);
    // private System.Void LoopRemoved(VROSC.LoopPlayer player)
    // Offset: 0x1970874
    void LoopRemoved(::VROSC::LoopPlayer* player);
    // private System.Void Update()
    // Offset: 0x19709D4
    void Update();
    // private System.Void UpdatePlayback()
    // Offset: 0x1970868
    void UpdatePlayback();
    // private System.Void SetPlaybackConfig(VROSC.LoopPlaybackConfigOverride playbackOverride)
    // Offset: 0x19706E4
    void SetPlaybackConfig(::VROSC::LoopPlaybackConfigOverride* playbackOverride);
    // private System.Void OnDestroy()
    // Offset: 0x1970B94
    void OnDestroy();
    // private System.Void ConfigChanged()
    // Offset: 0x1970D98
    void ConfigChanged();
    // private System.Void PlayToggled(System.Boolean play)
    // Offset: 0x1970EB4
    void PlayToggled(bool play);
    // private VROSC.LoopPlayer GetLongestLoopCurrentlyPlaying()
    // Offset: 0x1970A1C
    ::VROSC::LoopPlayer* GetLongestLoopCurrentlyPlaying();
    // public System.Void SetColor(UnityEngine.Color color)
    // Offset: 0x19711C0
    void SetColor(::UnityEngine::Color color);
    // public System.Void .ctor()
    // Offset: 0x19711DC
    // Implemented from: UnityEngine.MonoBehaviour
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static LoopStationGroupPlaybackUI* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::VROSC::LoopStationGroupPlaybackUI::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<LoopStationGroupPlaybackUI*, creationType>()));
    }
  }; // VROSC.LoopStationGroupPlaybackUI
  #pragma pack(pop)
  static check_size<sizeof(LoopStationGroupPlaybackUI), 80 + sizeof(bool)> __VROSC_LoopStationGroupPlaybackUISizeCheck;
  static_assert(sizeof(LoopStationGroupPlaybackUI) == 0x51);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: VROSC::LoopStationGroupPlaybackUI::get_PlaybackConfig
// Il2CppName: get_PlaybackConfig
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::VROSC::LoopPlaybackConfigOverride* (VROSC::LoopStationGroupPlaybackUI::*)()>(&VROSC::LoopStationGroupPlaybackUI::get_PlaybackConfig)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(VROSC::LoopStationGroupPlaybackUI*), "get_PlaybackConfig", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: VROSC::LoopStationGroupPlaybackUI::set_PlaybackConfig
// Il2CppName: set_PlaybackConfig
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::LoopStationGroupPlaybackUI::*)(::VROSC::LoopPlaybackConfigOverride*)>(&VROSC::LoopStationGroupPlaybackUI::set_PlaybackConfig)> {
  static const MethodInfo* get() {
    static auto* value = &::il2cpp_utils::GetClassFromName("VROSC", "LoopPlaybackConfigOverride")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(VROSC::LoopStationGroupPlaybackUI*), "set_PlaybackConfig", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{value});
  }
};
// Writing MetadataGetter for method: VROSC::LoopStationGroupPlaybackUI::Setup
// Il2CppName: Setup
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::LoopStationGroupPlaybackUI::*)(::VROSC::LoopStation*, ::VROSC::LoopStationGroup*, ::VROSC::LoopPlaybackConfigOverride*)>(&VROSC::LoopStationGroupPlaybackUI::Setup)> {
  static const MethodInfo* get() {
    static auto* loopStation = &::il2cpp_utils::GetClassFromName("VROSC", "LoopStation")->byval_arg;
    static auto* loopGroup = &::il2cpp_utils::GetClassFromName("VROSC", "LoopStationGroup")->byval_arg;
    static auto* configOverride = &::il2cpp_utils::GetClassFromName("VROSC", "LoopPlaybackConfigOverride")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(VROSC::LoopStationGroupPlaybackUI*), "Setup", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{loopStation, loopGroup, configOverride});
  }
};
// Writing MetadataGetter for method: VROSC::LoopStationGroupPlaybackUI::LoopAdded
// Il2CppName: LoopAdded
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::LoopStationGroupPlaybackUI::*)(::VROSC::LoopPlayer*)>(&VROSC::LoopStationGroupPlaybackUI::LoopAdded)> {
  static const MethodInfo* get() {
    static auto* player = &::il2cpp_utils::GetClassFromName("VROSC", "LoopPlayer")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(VROSC::LoopStationGroupPlaybackUI*), "LoopAdded", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{player});
  }
};
// Writing MetadataGetter for method: VROSC::LoopStationGroupPlaybackUI::LoopRemoved
// Il2CppName: LoopRemoved
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::LoopStationGroupPlaybackUI::*)(::VROSC::LoopPlayer*)>(&VROSC::LoopStationGroupPlaybackUI::LoopRemoved)> {
  static const MethodInfo* get() {
    static auto* player = &::il2cpp_utils::GetClassFromName("VROSC", "LoopPlayer")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(VROSC::LoopStationGroupPlaybackUI*), "LoopRemoved", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{player});
  }
};
// Writing MetadataGetter for method: VROSC::LoopStationGroupPlaybackUI::Update
// Il2CppName: Update
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::LoopStationGroupPlaybackUI::*)()>(&VROSC::LoopStationGroupPlaybackUI::Update)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(VROSC::LoopStationGroupPlaybackUI*), "Update", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: VROSC::LoopStationGroupPlaybackUI::UpdatePlayback
// Il2CppName: UpdatePlayback
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::LoopStationGroupPlaybackUI::*)()>(&VROSC::LoopStationGroupPlaybackUI::UpdatePlayback)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(VROSC::LoopStationGroupPlaybackUI*), "UpdatePlayback", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: VROSC::LoopStationGroupPlaybackUI::SetPlaybackConfig
// Il2CppName: SetPlaybackConfig
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::LoopStationGroupPlaybackUI::*)(::VROSC::LoopPlaybackConfigOverride*)>(&VROSC::LoopStationGroupPlaybackUI::SetPlaybackConfig)> {
  static const MethodInfo* get() {
    static auto* playbackOverride = &::il2cpp_utils::GetClassFromName("VROSC", "LoopPlaybackConfigOverride")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(VROSC::LoopStationGroupPlaybackUI*), "SetPlaybackConfig", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{playbackOverride});
  }
};
// Writing MetadataGetter for method: VROSC::LoopStationGroupPlaybackUI::OnDestroy
// Il2CppName: OnDestroy
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::LoopStationGroupPlaybackUI::*)()>(&VROSC::LoopStationGroupPlaybackUI::OnDestroy)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(VROSC::LoopStationGroupPlaybackUI*), "OnDestroy", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: VROSC::LoopStationGroupPlaybackUI::ConfigChanged
// Il2CppName: ConfigChanged
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::LoopStationGroupPlaybackUI::*)()>(&VROSC::LoopStationGroupPlaybackUI::ConfigChanged)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(VROSC::LoopStationGroupPlaybackUI*), "ConfigChanged", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: VROSC::LoopStationGroupPlaybackUI::PlayToggled
// Il2CppName: PlayToggled
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::LoopStationGroupPlaybackUI::*)(bool)>(&VROSC::LoopStationGroupPlaybackUI::PlayToggled)> {
  static const MethodInfo* get() {
    static auto* play = &::il2cpp_utils::GetClassFromName("System", "Boolean")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(VROSC::LoopStationGroupPlaybackUI*), "PlayToggled", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{play});
  }
};
// Writing MetadataGetter for method: VROSC::LoopStationGroupPlaybackUI::GetLongestLoopCurrentlyPlaying
// Il2CppName: GetLongestLoopCurrentlyPlaying
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::VROSC::LoopPlayer* (VROSC::LoopStationGroupPlaybackUI::*)()>(&VROSC::LoopStationGroupPlaybackUI::GetLongestLoopCurrentlyPlaying)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(VROSC::LoopStationGroupPlaybackUI*), "GetLongestLoopCurrentlyPlaying", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: VROSC::LoopStationGroupPlaybackUI::SetColor
// Il2CppName: SetColor
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::LoopStationGroupPlaybackUI::*)(::UnityEngine::Color)>(&VROSC::LoopStationGroupPlaybackUI::SetColor)> {
  static const MethodInfo* get() {
    static auto* color = &::il2cpp_utils::GetClassFromName("UnityEngine", "Color")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(VROSC::LoopStationGroupPlaybackUI*), "SetColor", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{color});
  }
};
// Writing MetadataGetter for method: VROSC::LoopStationGroupPlaybackUI::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
