// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: VROSC
namespace VROSC {
  // Forward declaring type: LoopPlayer
  class LoopPlayer;
  // Forward declaring type: LoopStationGroupHandler
  class LoopStationGroupHandler;
  // Forward declaring type: LoopStationGroupMover
  class LoopStationGroupMover;
  // Forward declaring type: LoopListArranger
  class LoopListArranger;
  // Forward declaring type: LoopStationGroupUI
  class LoopStationGroupUI;
  // Forward declaring type: InteractionDisabler
  class InteractionDisabler;
  // Forward declaring type: LoopStation
  class LoopStation;
  // Forward declaring type: LoopPlaybackConfigOverride
  class LoopPlaybackConfigOverride;
  // Forward declaring type: TransformDataController
  class TransformDataController;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Collider
  class Collider;
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: RectTransform
  class RectTransform;
  // Skipping declaration: Vector3 because it is already included!
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`2<T1, T2>
  template<typename T1, typename T2>
  class Action_2;
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
  // Forward declaring type: Action
  class Action;
}
// Completed forward declares
// Type namespace: VROSC
namespace VROSC {
  // Forward declaring type: LoopStationGroup
  class LoopStationGroup;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::VROSC::LoopStationGroup);
DEFINE_IL2CPP_ARG_TYPE(::VROSC::LoopStationGroup*, "VROSC", "LoopStationGroup");
// Type namespace: VROSC
namespace VROSC {
  // Size: 0xA8
  #pragma pack(push, 1)
  // Autogenerated type: VROSC.LoopStationGroup
  // [TokenAttribute] Offset: FFFFFFFF
  class LoopStationGroup : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::VROSC::LoopStationGroup::SetupVariables
    struct SetupVariables;
    public:
    // private System.Int32 <RowInAutoArrange>k__BackingField
    // Size: 0x4
    // Offset: 0x18
    int RowInAutoArrange;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: RowInAutoArrange and: GroupID
    char __padding0[0x4] = {};
    // private System.String <GroupID>k__BackingField
    // Size: 0x8
    // Offset: 0x20
    ::StringW GroupID;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Collections.Generic.List`1<VROSC.LoopPlayer> <LoopPlayers>k__BackingField
    // Size: 0x8
    // Offset: 0x28
    ::System::Collections::Generic::List_1<::VROSC::LoopPlayer*>* LoopPlayers;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::VROSC::LoopPlayer*>*) == 0x8);
    // private VROSC.LoopStationGroupHandler <Handler>k__BackingField
    // Size: 0x8
    // Offset: 0x30
    ::VROSC::LoopStationGroupHandler* Handler;
    // Field size check
    static_assert(sizeof(::VROSC::LoopStationGroupHandler*) == 0x8);
    // private UnityEngine.Collider _dropZone
    // Size: 0x8
    // Offset: 0x38
    ::UnityEngine::Collider* dropZone;
    // Field size check
    static_assert(sizeof(::UnityEngine::Collider*) == 0x8);
    // private UnityEngine.Transform _loopsParent
    // Size: 0x8
    // Offset: 0x40
    ::UnityEngine::Transform* loopsParent;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private UnityEngine.RectTransform _menuRect
    // Size: 0x8
    // Offset: 0x48
    ::UnityEngine::RectTransform* menuRect;
    // Field size check
    static_assert(sizeof(::UnityEngine::RectTransform*) == 0x8);
    // private UnityEngine.RectTransform _dimensions
    // Size: 0x8
    // Offset: 0x50
    ::UnityEngine::RectTransform* dimensions;
    // Field size check
    static_assert(sizeof(::UnityEngine::RectTransform*) == 0x8);
    // private VROSC.LoopStationGroupMover _autoMover
    // Size: 0x8
    // Offset: 0x58
    ::VROSC::LoopStationGroupMover* autoMover;
    // Field size check
    static_assert(sizeof(::VROSC::LoopStationGroupMover*) == 0x8);
    // private VROSC.LoopListArranger _arranger
    // Size: 0x8
    // Offset: 0x60
    ::VROSC::LoopListArranger* arranger;
    // Field size check
    static_assert(sizeof(::VROSC::LoopListArranger*) == 0x8);
    // private VROSC.LoopStationGroupUI _ui
    // Size: 0x8
    // Offset: 0x68
    ::VROSC::LoopStationGroupUI* ui;
    // Field size check
    static_assert(sizeof(::VROSC::LoopStationGroupUI*) == 0x8);
    // private VROSC.InteractionDisabler _disabler
    // Size: 0x8
    // Offset: 0x70
    ::VROSC::InteractionDisabler* disabler;
    // Field size check
    static_assert(sizeof(::VROSC::InteractionDisabler*) == 0x8);
    // public System.Action`2<VROSC.LoopStationGroup,System.Boolean> OnGroupRemoved
    // Size: 0x8
    // Offset: 0x78
    ::System::Action_2<::VROSC::LoopStationGroup*, bool>* OnGroupRemoved;
    // Field size check
    static_assert(sizeof(::System::Action_2<::VROSC::LoopStationGroup*, bool>*) == 0x8);
    // public System.Action`1<VROSC.LoopPlayer> OnLoopAdded
    // Size: 0x8
    // Offset: 0x80
    ::System::Action_1<::VROSC::LoopPlayer*>* OnLoopAdded;
    // Field size check
    static_assert(sizeof(::System::Action_1<::VROSC::LoopPlayer*>*) == 0x8);
    // public System.Action`1<VROSC.LoopPlayer> OnLoopRemoved
    // Size: 0x8
    // Offset: 0x88
    ::System::Action_1<::VROSC::LoopPlayer*>* OnLoopRemoved;
    // Field size check
    static_assert(sizeof(::System::Action_1<::VROSC::LoopPlayer*>*) == 0x8);
    // public System.Action OnGroupSizeChanged
    // Size: 0x8
    // Offset: 0x90
    ::System::Action* OnGroupSizeChanged;
    // Field size check
    static_assert(sizeof(::System::Action*) == 0x8);
    // public System.Action`2<VROSC.LoopStationGroup,System.Boolean> OnSoloChanged
    // Size: 0x8
    // Offset: 0x98
    ::System::Action_2<::VROSC::LoopStationGroup*, bool>* OnSoloChanged;
    // Field size check
    static_assert(sizeof(::System::Action_2<::VROSC::LoopStationGroup*, bool>*) == 0x8);
    // protected VROSC.LoopStation _loopStation
    // Size: 0x8
    // Offset: 0xA0
    ::VROSC::LoopStation* loopStation;
    // Field size check
    static_assert(sizeof(::VROSC::LoopStation*) == 0x8);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get static field: static public UnityEngine.Color DefaultGroupColor
    static ::UnityEngine::Color _get_DefaultGroupColor();
    // Set static field: static public UnityEngine.Color DefaultGroupColor
    static void _set_DefaultGroupColor(::UnityEngine::Color value);
    // Get instance field reference: private System.Int32 <RowInAutoArrange>k__BackingField
    [[deprecated]] int& dyn_$RowInAutoArrange$k__BackingField();
    // Get instance field reference: private System.String <GroupID>k__BackingField
    [[deprecated]] ::StringW& dyn_$GroupID$k__BackingField();
    // Get instance field reference: private System.Collections.Generic.List`1<VROSC.LoopPlayer> <LoopPlayers>k__BackingField
