// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.Single
#include "System/Single.hpp"
// Including type: VROSC.LoopPlaybackConfig
#include "VROSC/LoopPlaybackConfig.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: VROSC
namespace VROSC {
  // Forward declaring type: LoopPlaybackConfigOverride
  class LoopPlaybackConfigOverride;
  // Forward declaring type: Loop
  class Loop;
  // Forward declaring type: LoopPlayerPlaybackStoppedState
  class LoopPlayerPlaybackStoppedState;
  // Forward declaring type: LoopPlayerPlaybackWillStartState
  class LoopPlayerPlaybackWillStartState;
  // Forward declaring type: LoopPlayerPlaybackLoopingState
  class LoopPlayerPlaybackLoopingState;
  // Forward declaring type: LoopPlayerPlaybackWillStopState
  class LoopPlayerPlaybackWillStopState;
  // Forward declaring type: LoopPlayerPlaybackState
  class LoopPlayerPlaybackState;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action
  class Action;
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
}
// Completed forward declares
// Type namespace: VROSC
namespace VROSC {
  // Forward declaring type: LoopPlayerPlaybackSettings
  class LoopPlayerPlaybackSettings;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::VROSC::LoopPlayerPlaybackSettings);
DEFINE_IL2CPP_ARG_TYPE(::VROSC::LoopPlayerPlaybackSettings*, "VROSC", "LoopPlayerPlaybackSettings");
// Type namespace: VROSC
namespace VROSC {
  // Size: 0x98
  #pragma pack(push, 1)
  // Autogenerated type: VROSC.LoopPlayerPlaybackSettings
  // [TokenAttribute] Offset: FFFFFFFF
  class LoopPlayerPlaybackSettings : public ::Il2CppObject {
    public:
    public:
    // private VROSC.LoopPlaybackConfig <LocalPlaybackConfig>k__BackingField
    // Size: 0x8
    // Offset: 0x10
    ::VROSC::LoopPlaybackConfig* LocalPlaybackConfig;
    // Field size check
    static_assert(sizeof(::VROSC::LoopPlaybackConfig*) == 0x8);
    // private VROSC.LoopPlaybackConfig <PlayingConfig>k__BackingField
    // Size: 0x8
    // Offset: 0x18
    ::VROSC::LoopPlaybackConfig* PlayingConfig;
    // Field size check
    static_assert(sizeof(::VROSC::LoopPlaybackConfig*) == 0x8);
    // private VROSC.Loop <Loop>k__BackingField
    // Size: 0x8
    // Offset: 0x20
    ::VROSC::Loop* Loop;
    // Field size check
    static_assert(sizeof(::VROSC::Loop*) == 0x8);
    // private VROSC.LoopPlayerPlaybackStoppedState <StoppedState>k__BackingField
    // Size: 0x8
    // Offset: 0x28
    ::VROSC::LoopPlayerPlaybackStoppedState* StoppedState;
    // Field size check
    static_assert(sizeof(::VROSC::LoopPlayerPlaybackStoppedState*) == 0x8);
    // private VROSC.LoopPlayerPlaybackWillStartState <WillStartState>k__BackingField
    // Size: 0x8
    // Offset: 0x30
    ::VROSC::LoopPlayerPlaybackWillStartState* WillStartState;
    // Field size check
    static_assert(sizeof(::VROSC::LoopPlayerPlaybackWillStartState*) == 0x8);
    // private VROSC.LoopPlayerPlaybackLoopingState <LoopingState>k__BackingField
    // Size: 0x8
    // Offset: 0x38
    ::VROSC::LoopPlayerPlaybackLoopingState* LoopingState;
    // Field size check
    static_assert(sizeof(::VROSC::LoopPlayerPlaybackLoopingState*) == 0x8);
    // private VROSC.LoopPlayerPlaybackWillStopState <WillStopState>k__BackingField
    // Size: 0x8
    // Offset: 0x40
    ::VROSC::LoopPlayerPlaybackWillStopState* WillStopState;
    // Field size check
    static_assert(sizeof(::VROSC::LoopPlayerPlaybackWillStopState*) == 0x8);
    // private VROSC.LoopPlayerPlaybackState <CurrentState>k__BackingField
    // Size: 0x8
    // Offset: 0x48
    ::VROSC::LoopPlayerPlaybackState* CurrentState;
    // Field size check
    static_assert(sizeof(::VROSC::LoopPlayerPlaybackState*) == 0x8);
    // private VROSC.LoopPlayerPlaybackState <NextState>k__BackingField
    // Size: 0x8
    // Offset: 0x50
    ::VROSC::LoopPlayerPlaybackState* NextState;
    // Field size check
    static_assert(sizeof(::VROSC::LoopPlayerPlaybackState*) == 0x8);
    // private System.Boolean <Active>k__BackingField
    // Size: 0x1
    // Offset: 0x58
    bool Active;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean <Playing>k__BackingField
    // Size: 0x1
    // Offset: 0x59
    bool Playing;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: Playing and: FadeMultiplier
    char __padding10[0x2] = {};
    // private System.Single <FadeMultiplier>k__BackingField
    // Size: 0x4
    // Offset: 0x5C
    float FadeMultiplier;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Int32 <PlayFromStartOffset>k__BackingField
    // Size: 0x4
    // Offset: 0x60
    int PlayFromStartOffset;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 <StartOffsetBarRelative>k__BackingField
    // Size: 0x4
    // Offset: 0x64
    int StartOffsetBarRelative;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean _wasPlaying
    // Size: 0x1
    // Offset: 0x68
    bool wasPlaying;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _startedWithPlayFromStart
    // Size: 0x1
    // Offset: 0x69
    bool startedWithPlayFromStart;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: startedWithPlayFromStart and: noTailLoops
    char __padding15[0x2] = {};
    // private System.Int32 _noTailLoops
    // Size: 0x4
    // Offset: 0x6C
    int noTailLoops;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean _fadeWithNaturalTail
    // Size: 0x1
    // Offset: 0x70
    bool fadeWithNaturalTail;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: fadeWithNaturalTail and: playedLength
    char __padding17[0x3] = {};
    // private System.Int32 _playedLength
    // Size: 0x4
    // Offset: 0x74
    int playedLength;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _allowedLeadupToNoTailLoop
    // Size: 0x4
    // Offset: 0x78
    int allowedLeadupToNoTailLoop;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: allowedLeadupToNoTailLoop and: OnPlayingStart
    char __padding19[0x4] = {};
    // public System.Action OnPlayingStart
    // Size: 0x8
    // Offset: 0x80
    ::System::Action* OnPlayingStart;
    // Field size check
    static_assert(sizeof(::System::Action*) == 0x8);
    // public System.Action OnPlayingEnd
    // Size: 0x8
    // Offset: 0x88
    ::System::Action* OnPlayingEnd;
    // Field size check
    static_assert(sizeof(::System::Action*) == 0x8);
    // public System.Action`1<VROSC.LoopPlayerPlaybackState> OnStateChanged
    // Size: 0x8
    // Offset: 0x90
    ::System::Action_1<::VROSC::LoopPlayerPlaybackState*>* OnStateChanged;
    // Field size check
    static_assert(sizeof(::System::Action_1<::VROSC::LoopPlayerPlaybackState*>*) == 0x8);
    public:
    // static field const value: static private System.Single AllowedLeadupToNoTailLoopInSeconds
    static constexpr const float AllowedLeadupToNoTailLoopInSeconds = 0.1;
    // Get static field: static private System.Single AllowedLeadupToNoTailLoopInSeconds
    static float _get_AllowedLeadupToNoTailLoopInSeconds();
    // Set static field: static private System.Single AllowedLeadupToNoTailLoopInSeconds
    static void _set_AllowedLeadupToNoTailLoopInSeconds(float value);
    // Get instance field reference: private VROSC.LoopPlaybackConfig <LocalPlaybackConfig>k__BackingField
    [[deprecated("Use field access instead!")]] ::VROSC::LoopPlaybackConfig*& dyn_$LocalPlaybackConfig$k__BackingField();
