// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: VROSC.LoopStationRecorder
#include "VROSC/LoopStationRecorder.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: VROSC
namespace VROSC {
  // Forward declaring type: MicrophoneEffectsManager
  class MicrophoneEffectsManager;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: AudioSource
  class AudioSource;
}
// Forward declaring namespace: NatSuite::Devices
namespace NatSuite::Devices {
  // Forward declaring type: AudioDevice
  class AudioDevice;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action
  class Action;
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
}
// Forward declaring namespace: System::Threading::Tasks
namespace System::Threading::Tasks {
  // Forward declaring type: Task
  class Task;
}
// Completed forward declares
// Type namespace: VROSC
namespace VROSC {
  // Forward declaring type: MicrophoneDeviceManager
  class MicrophoneDeviceManager;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::VROSC::MicrophoneDeviceManager);
DEFINE_IL2CPP_ARG_TYPE(::VROSC::MicrophoneDeviceManager*, "VROSC", "MicrophoneDeviceManager");
// Type namespace: VROSC
namespace VROSC {
  // Size: 0x74
  #pragma pack(push, 1)
  // Autogenerated type: VROSC.MicrophoneDeviceManager
  // [TokenAttribute] Offset: FFFFFFFF
  class MicrophoneDeviceManager : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::VROSC::MicrophoneDeviceManager::$Setup$d__41
    struct $Setup$d__41;
    // Nested type: ::VROSC::MicrophoneDeviceManager::$InitializeNativeMicrophone$d__42
    struct $InitializeNativeMicrophone$d__42;
    // Nested type: ::VROSC::MicrophoneDeviceManager::$InitiateInputAfterBufferReceived$d__51
    struct $InitiateInputAfterBufferReceived$d__51;
    public:
    // private UnityEngine.AudioSource _audioSource
    // Size: 0x8
    // Offset: 0x18
    ::UnityEngine::AudioSource* audioSource;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioSource*) == 0x8);
    // private VROSC.MicrophoneEffectsManager _microphoneEffectsManager
    // Size: 0x8
    // Offset: 0x20
    ::VROSC::MicrophoneEffectsManager* microphoneEffectsManager;
    // Field size check
    static_assert(sizeof(::VROSC::MicrophoneEffectsManager*) == 0x8);
    // private System.Int32 _nativeMicrophoneBufferSize
    // Size: 0x4
    // Offset: 0x28
    int nativeMicrophoneBufferSize;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: nativeMicrophoneBufferSize and: microphoneDevice
    char __padding2[0x4] = {};
    // private NatSuite.Devices.AudioDevice _microphoneDevice
    // Size: 0x8
    // Offset: 0x30
    ::NatSuite::Devices::AudioDevice* microphoneDevice;
    // Field size check
    static_assert(sizeof(::NatSuite::Devices::AudioDevice*) == 0x8);
    // private System.Single[] _ringBuffer
    // Size: 0x8
    // Offset: 0x38
    ::ArrayW<float> ringBuffer;
    // Field size check
    static_assert(sizeof(::ArrayW<float>) == 0x8);
    // private System.Int32 _ringBufferWriteIndex
    // Size: 0x4
    // Offset: 0x40
    int ringBufferWriteIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _ringBufferReadIndex
    // Size: 0x4
    // Offset: 0x44
    int ringBufferReadIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean _takingInput
    // Size: 0x1
    // Offset: 0x48
    bool takingInput;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _microphoneEnabled
    // Size: 0x1
    // Offset: 0x49
    bool microphoneEnabled;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _microphoneTakingInput
    // Size: 0x1
    // Offset: 0x4A
    bool microphoneTakingInput;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _useProximity
    // Size: 0x1
    // Offset: 0x4B
    bool useProximity;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Single _microphoneProximity
    // Size: 0x4
    // Offset: 0x4C
    float microphoneProximity;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single <StopFadeTime>k__BackingField
    // Size: 0x4
    // Offset: 0x50
    float StopFadeTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean <IsInitialized>k__BackingField
    // Size: 0x1
    // Offset: 0x54
    bool IsInitialized;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: IsInitialized and: preampVolume
    char __padding13[0x3] = {};
    // private System.Single _preampVolume
    // Size: 0x4
    // Offset: 0x58
    float preampVolume;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _peakDisplayDuration
    // Size: 0x4
    // Offset: 0x5C
    float peakDisplayDuration;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _peakValue
    // Size: 0x4
    // Offset: 0x60
    float peakValue;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _peakTimer
    // Size: 0x4
    // Offset: 0x64
    float peakTimer;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean _isInPeak
    // Size: 0x1
    // Offset: 0x68
    bool isInPeak;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isInPeak and: writeAheadBuffers
    char __padding18[0x3] = {};
    // private System.Int32 _writeAheadBuffers
    // Size: 0x4
    // Offset: 0x6C
    int writeAheadBuffers;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _receivedBuffers
    // Size: 0x4
    // Offset: 0x70
    int receivedBuffers;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get static field: static private System.Double <Latency>k__BackingField
    static double _get_$Latency$k__BackingField();
    // Set static field: static private System.Double <Latency>k__BackingField
    static void _set_$Latency$k__BackingField(double value);
    // Get static field: static private System.Boolean <HasWorkingMicrophone>k__BackingField
    static bool _get_$HasWorkingMicrophone$k__BackingField();
    // Set static field: static private System.Boolean <HasWorkingMicrophone>k__BackingField
    static void _set_$HasWorkingMicrophone$k__BackingField(bool value);
    // Get static field: static public System.Action OnPeakReach
    static ::System::Action* _get_OnPeakReach();
