// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: VROSC.NotefieldAnimationSettings
#include "VROSC/NotefieldAnimationSettings.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: AnimationCurve
  class AnimationCurve;
}
// Completed forward declares
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::VROSC::NotefieldAnimationSettings::TimelineSettings);
DEFINE_IL2CPP_ARG_TYPE(::VROSC::NotefieldAnimationSettings::TimelineSettings*, "VROSC", "NotefieldAnimationSettings/TimelineSettings");
// Type namespace: VROSC
namespace VROSC {
  // Size: 0x30
  #pragma pack(push, 1)
  // Autogenerated type: VROSC.NotefieldAnimationSettings/VROSC.TimelineSettings
  // [TokenAttribute] Offset: FFFFFFFF
  class NotefieldAnimationSettings::TimelineSettings : public ::Il2CppObject {
    public:
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // private UnityEngine.AnimationCurve _sizeCurve
    // Size: 0x8
    // Offset: 0x10
    ::UnityEngine::AnimationCurve* sizeCurve;
    // Field size check
    static_assert(sizeof(::UnityEngine::AnimationCurve*) == 0x8);
    // private UnityEngine.AnimationCurve _positionDeviationCurve
    // Size: 0x8
    // Offset: 0x18
    ::UnityEngine::AnimationCurve* positionDeviationCurve;
    // Field size check
    static_assert(sizeof(::UnityEngine::AnimationCurve*) == 0x8);
    // private UnityEngine.AnimationCurve _rotationDeviationCurve
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::AnimationCurve* rotationDeviationCurve;
    // Field size check
    static_assert(sizeof(::UnityEngine::AnimationCurve*) == 0x8);
    // private System.Single _positionDeviationAmount
    // Size: 0x4
    // Offset: 0x28
    float positionDeviationAmount;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _rotationDeviationAmount
    // Size: 0x4
    // Offset: 0x2C
    float rotationDeviationAmount;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    public:
    // Get instance field reference: private UnityEngine.AnimationCurve _sizeCurve
    ::UnityEngine::AnimationCurve*& dyn__sizeCurve();
    // Get instance field reference: private UnityEngine.AnimationCurve _positionDeviationCurve
    ::UnityEngine::AnimationCurve*& dyn__positionDeviationCurve();
    // Get instance field reference: private UnityEngine.AnimationCurve _rotationDeviationCurve
    ::UnityEngine::AnimationCurve*& dyn__rotationDeviationCurve();
    // Get instance field reference: private System.Single _positionDeviationAmount
    float& dyn__positionDeviationAmount();
    // Get instance field reference: private System.Single _rotationDeviationAmount
    float& dyn__rotationDeviationAmount();
    // public UnityEngine.AnimationCurve get_SizeCurve()
    // Offset: 0x133F4E4
    ::UnityEngine::AnimationCurve* get_SizeCurve();
    // public UnityEngine.AnimationCurve get_PositionDeviationCurve()
    // Offset: 0x133F4EC
    ::UnityEngine::AnimationCurve* get_PositionDeviationCurve();
    // public UnityEngine.AnimationCurve get_RotationDeviationCurve()
    // Offset: 0x133F4F4
    ::UnityEngine::AnimationCurve* get_RotationDeviationCurve();
    // public System.Single get_PositionDeviationAmount()
    // Offset: 0x133F4FC
    float get_PositionDeviationAmount();
    // public System.Single get_RotationDeviationAmount()
    // Offset: 0x133F504
    float get_RotationDeviationAmount();
    // public System.Void .ctor()
    // Offset: 0x133F50C
    // Implemented from: System.Object
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static NotefieldAnimationSettings::TimelineSettings* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::VROSC::NotefieldAnimationSettings::TimelineSettings::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<NotefieldAnimationSettings::TimelineSettings*, creationType>()));
    }
  }; // VROSC.NotefieldAnimationSettings/VROSC.TimelineSettings
  #pragma pack(pop)
  static check_size<sizeof(NotefieldAnimationSettings::TimelineSettings), 44 + sizeof(float)> __VROSC_NotefieldAnimationSettings_TimelineSettingsSizeCheck;
  static_assert(sizeof(NotefieldAnimationSettings::TimelineSettings) == 0x30);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: VROSC::NotefieldAnimationSettings::TimelineSettings::get_SizeCurve
// Il2CppName: get_SizeCurve
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::UnityEngine::AnimationCurve* (VROSC::NotefieldAnimationSettings::TimelineSettings::*)()>(&VROSC::NotefieldAnimationSettings::TimelineSettings::get_SizeCurve)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(VROSC::NotefieldAnimationSettings::TimelineSettings*), "get_SizeCurve", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: VROSC::NotefieldAnimationSettings::TimelineSettings::get_PositionDeviationCurve
// Il2CppName: get_PositionDeviationCurve
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::UnityEngine::AnimationCurve* (VROSC::NotefieldAnimationSettings::TimelineSettings::*)()>(&VROSC::NotefieldAnimationSettings::TimelineSettings::get_PositionDeviationCurve)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(VROSC::NotefieldAnimationSettings::TimelineSettings*), "get_PositionDeviationCurve", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: VROSC::NotefieldAnimationSettings::TimelineSettings::get_RotationDeviationCurve
// Il2CppName: get_RotationDeviationCurve
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::UnityEngine::AnimationCurve* (VROSC::NotefieldAnimationSettings::TimelineSettings::*)()>(&VROSC::NotefieldAnimationSettings::TimelineSettings::get_RotationDeviationCurve)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(VROSC::NotefieldAnimationSettings::TimelineSettings*), "get_RotationDeviationCurve", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: VROSC::NotefieldAnimationSettings::TimelineSettings::get_PositionDeviationAmount
// Il2CppName: get_PositionDeviationAmount
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<float (VROSC::NotefieldAnimationSettings::TimelineSettings::*)()>(&VROSC::NotefieldAnimationSettings::TimelineSettings::get_PositionDeviationAmount)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(VROSC::NotefieldAnimationSettings::TimelineSettings*), "get_PositionDeviationAmount", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: VROSC::NotefieldAnimationSettings::TimelineSettings::get_RotationDeviationAmount
// Il2CppName: get_RotationDeviationAmount
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<float (VROSC::NotefieldAnimationSettings::TimelineSettings::*)()>(&VROSC::NotefieldAnimationSettings::TimelineSettings::get_RotationDeviationAmount)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(VROSC::NotefieldAnimationSettings::TimelineSettings*), "get_RotationDeviationAmount", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: VROSC::NotefieldAnimationSettings::TimelineSettings::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
