// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: VROSC
namespace VROSC {
  // Forward declaring type: UIButton
  class UIButton;
  // Forward declaring type: IntNode
  class IntNode;
  // Forward declaring type: SynthController
  class SynthController;
}
// Forward declaring namespace: TMPro
namespace TMPro {
  // Forward declaring type: TextMeshPro
  class TextMeshPro;
}
// Completed forward declares
// Type namespace: VROSC
namespace VROSC {
  // Forward declaring type: OctaveControlUI
  class OctaveControlUI;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::VROSC::OctaveControlUI);
DEFINE_IL2CPP_ARG_TYPE(::VROSC::OctaveControlUI*, "VROSC", "OctaveControlUI");
// Type namespace: VROSC
namespace VROSC {
  // Size: 0x40
  #pragma pack(push, 1)
  // Autogenerated type: VROSC.OctaveControlUI
  // [TokenAttribute] Offset: FFFFFFFF
  class OctaveControlUI : public ::UnityEngine::MonoBehaviour {
    public:
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // private VROSC.UIButton _incrementButton
    // Size: 0x8
    // Offset: 0x18
    ::VROSC::UIButton* incrementButton;
    // Field size check
    static_assert(sizeof(::VROSC::UIButton*) == 0x8);
    // private VROSC.UIButton _decrementButton
    // Size: 0x8
    // Offset: 0x20
    ::VROSC::UIButton* decrementButton;
    // Field size check
    static_assert(sizeof(::VROSC::UIButton*) == 0x8);
    // protected TMPro.TextMeshPro _display
    // Size: 0x8
    // Offset: 0x28
    ::TMPro::TextMeshPro* display;
    // Field size check
    static_assert(sizeof(::TMPro::TextMeshPro*) == 0x8);
    // protected VROSC.IntNode _output
    // Size: 0x8
    // Offset: 0x30
    ::VROSC::IntNode* output;
    // Field size check
    static_assert(sizeof(::VROSC::IntNode*) == 0x8);
    // protected VROSC.SynthController _instrumentController
    // Size: 0x8
    // Offset: 0x38
    ::VROSC::SynthController* instrumentController;
    // Field size check
    static_assert(sizeof(::VROSC::SynthController*) == 0x8);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: private VROSC.UIButton _incrementButton
    ::VROSC::UIButton*& dyn__incrementButton();
    // Get instance field reference: private VROSC.UIButton _decrementButton
    ::VROSC::UIButton*& dyn__decrementButton();
    // Get instance field reference: protected TMPro.TextMeshPro _display
    ::TMPro::TextMeshPro*& dyn__display();
    // Get instance field reference: protected VROSC.IntNode _output
    ::VROSC::IntNode*& dyn__output();
    // Get instance field reference: protected VROSC.SynthController _instrumentController
    ::VROSC::SynthController*& dyn__instrumentController();
    // public System.Void Setup(VROSC.SynthController instrumentController)
    // Offset: 0x91AB34
    void Setup(::VROSC::SynthController* instrumentController);
    // private System.Void Start()
    // Offset: 0x91AB44
    void Start();
    // private System.Void OnEnable()
    // Offset: 0x91ACEC
    void OnEnable();
    // protected System.Void IncrementButtonPressed()
    // Offset: 0x91AD78
    void IncrementButtonPressed();
    // protected System.Void DecrementButtonPressed()
    // Offset: 0x91ADB4
    void DecrementButtonPressed();
    // protected System.Void UpdateDisplayAndOutput()
    // Offset: 0x91ADF0
    void UpdateDisplayAndOutput();
    // protected System.Void OnDestroy()
    // Offset: 0x91AE84
    void OnDestroy();
    // public System.Void .ctor()
    // Offset: 0x91AF88
    // Implemented from: UnityEngine.MonoBehaviour
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static OctaveControlUI* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::VROSC::OctaveControlUI::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<OctaveControlUI*, creationType>()));
    }
  }; // VROSC.OctaveControlUI
  #pragma pack(pop)
  static check_size<sizeof(OctaveControlUI), 56 + sizeof(::VROSC::SynthController*)> __VROSC_OctaveControlUISizeCheck;
  static_assert(sizeof(OctaveControlUI) == 0x40);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: VROSC::OctaveControlUI::Setup
// Il2CppName: Setup
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::OctaveControlUI::*)(::VROSC::SynthController*)>(&VROSC::OctaveControlUI::Setup)> {
  static const MethodInfo* get() {
    static auto* instrumentController = &::il2cpp_utils::GetClassFromName("VROSC", "SynthController")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(VROSC::OctaveControlUI*), "Setup", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{instrumentController});
  }
};
// Writing MetadataGetter for method: VROSC::OctaveControlUI::Start
// Il2CppName: Start
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::OctaveControlUI::*)()>(&VROSC::OctaveControlUI::Start)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(VROSC::OctaveControlUI*), "Start", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: VROSC::OctaveControlUI::OnEnable
// Il2CppName: OnEnable
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::OctaveControlUI::*)()>(&VROSC::OctaveControlUI::OnEnable)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(VROSC::OctaveControlUI*), "OnEnable", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: VROSC::OctaveControlUI::IncrementButtonPressed
// Il2CppName: IncrementButtonPressed
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::OctaveControlUI::*)()>(&VROSC::OctaveControlUI::IncrementButtonPressed)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(VROSC::OctaveControlUI*), "IncrementButtonPressed", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: VROSC::OctaveControlUI::DecrementButtonPressed
// Il2CppName: DecrementButtonPressed
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::OctaveControlUI::*)()>(&VROSC::OctaveControlUI::DecrementButtonPressed)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(VROSC::OctaveControlUI*), "DecrementButtonPressed", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: VROSC::OctaveControlUI::UpdateDisplayAndOutput
// Il2CppName: UpdateDisplayAndOutput
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::OctaveControlUI::*)()>(&VROSC::OctaveControlUI::UpdateDisplayAndOutput)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(VROSC::OctaveControlUI*), "UpdateDisplayAndOutput", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: VROSC::OctaveControlUI::OnDestroy
// Il2CppName: OnDestroy
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::OctaveControlUI::*)()>(&VROSC::OctaveControlUI::OnDestroy)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(VROSC::OctaveControlUI*), "OnDestroy", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: VROSC::OctaveControlUI::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
