// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: VROSC.SynthParameterController/VROSC.TargetParameter
#include "VROSC/SynthParameterController_TargetParameter.hpp"
// Including type: VROSC.MidiCC
#include "VROSC/MidiCC.hpp"
// Including type: VROSC.ValueSourceSelector/VROSC.ValueSource
#include "VROSC/ValueSourceSelector.hpp"
// Including type: VROSC.HandType
#include "VROSC/HandType.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: AnimationCurve
  class AnimationCurve;
}
// Completed forward declares
// Type namespace: VROSC
namespace VROSC {
  // Forward declaring type: ParameterLink
  class ParameterLink;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::VROSC::ParameterLink);
DEFINE_IL2CPP_ARG_TYPE(::VROSC::ParameterLink*, "VROSC", "ParameterLink");
// Type namespace: VROSC
namespace VROSC {
  // Size: 0x35
  #pragma pack(push, 1)
  // Autogenerated type: VROSC.ParameterLink
  // [TokenAttribute] Offset: FFFFFFFF
  class ParameterLink : public ::Il2CppObject {
    public:
    public:
    // public VROSC.SynthParameterController/VROSC.TargetParameter TargetParameter
    // Size: 0x4
    // Offset: 0x10
    ::VROSC::SynthParameterController::TargetParameter TargetParameter;
    // Field size check
    static_assert(sizeof(::VROSC::SynthParameterController::TargetParameter) == 0x4);
    // public VROSC.MidiCC MidiCC
    // Size: 0x4
    // Offset: 0x14
    ::VROSC::MidiCC MidiCC;
    // Field size check
    static_assert(sizeof(::VROSC::MidiCC) == 0x4);
    // public VROSC.ValueSourceSelector/VROSC.ValueSource ValueSource
    // Size: 0x4
    // Offset: 0x18
    ::VROSC::ValueSourceSelector::ValueSource ValueSource;
    // Field size check
    static_assert(sizeof(::VROSC::ValueSourceSelector::ValueSource) == 0x4);
    // public VROSC.HandType HandType
    // Size: 0x4
    // Offset: 0x1C
    ::VROSC::HandType HandType;
    // Field size check
    static_assert(sizeof(::VROSC::HandType) == 0x4);
    // public System.Boolean LinkHands
    // Size: 0x1
    // Offset: 0x20
    bool LinkHands;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: LinkHands and: TransformationCurve
    char __padding4[0x7] = {};
    // public UnityEngine.AnimationCurve TransformationCurve
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::AnimationCurve* TransformationCurve;
    // Field size check
    static_assert(sizeof(::UnityEngine::AnimationCurve*) == 0x8);
    // public System.Single Factor
    // Size: 0x4
    // Offset: 0x30
    float Factor;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Boolean CenterOnHalf
    // Size: 0x1
    // Offset: 0x34
    bool CenterOnHalf;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Get instance field reference: public VROSC.SynthParameterController/VROSC.TargetParameter TargetParameter
    [[deprecated("Use field access instead!")]] ::VROSC::SynthParameterController::TargetParameter& dyn_TargetParameter();
    // Get instance field reference: public VROSC.MidiCC MidiCC
    [[deprecated("Use field access instead!")]] ::VROSC::MidiCC& dyn_MidiCC();
    // Get instance field reference: public VROSC.ValueSourceSelector/VROSC.ValueSource ValueSource
    [[deprecated("Use field access instead!")]] ::VROSC::ValueSourceSelector::ValueSource& dyn_ValueSource();
    // Get instance field reference: public VROSC.HandType HandType
    [[deprecated("Use field access instead!")]] ::VROSC::HandType& dyn_HandType();
    // Get instance field reference: public System.Boolean LinkHands
    [[deprecated("Use field access instead!")]] bool& dyn_LinkHands();
    // Get instance field reference: public UnityEngine.AnimationCurve TransformationCurve
    [[deprecated("Use field access instead!")]] ::UnityEngine::AnimationCurve*& dyn_TransformationCurve();
    // Get instance field reference: public System.Single Factor
    [[deprecated("Use field access instead!")]] float& dyn_Factor();
    // Get instance field reference: public System.Boolean CenterOnHalf
    [[deprecated("Use field access instead!")]] bool& dyn_CenterOnHalf();
    // public System.Void .ctor()
    // Offset: 0xADCBD0
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static ParameterLink* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::VROSC::ParameterLink::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<ParameterLink*, creationType>()));
    }
  }; // VROSC.ParameterLink
  #pragma pack(pop)
  static check_size<sizeof(ParameterLink), 52 + sizeof(bool)> __VROSC_ParameterLinkSizeCheck;
  static_assert(sizeof(ParameterLink) == 0x35);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: VROSC::ParameterLink::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
