// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include <initializer_list>
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: VROSC.TutorialStep
#include "VROSC/TutorialStep.hpp"
// Including type: VROSC.WidgetSettings
#include "VROSC/WidgetSettings.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: VROSC
namespace VROSC {
  // Forward declaring type: TutorialEvent
  struct TutorialEvent;
  // Forward declaring type: InputDevice
  class InputDevice;
  // Forward declaring type: TriggerButton
  struct TriggerButton;
  // Forward declaring type: PatchSettings
  class PatchSettings;
}
// Completed forward declares
// Type namespace: VROSC
namespace VROSC {
  // Forward declaring type: PlayMoreOnBoardTutorialStep
  class PlayMoreOnBoardTutorialStep;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::VROSC::PlayMoreOnBoardTutorialStep);
DEFINE_IL2CPP_ARG_TYPE(::VROSC::PlayMoreOnBoardTutorialStep*, "VROSC", "PlayMoreOnBoardTutorialStep");
// Type namespace: VROSC
namespace VROSC {
  // Size: 0x5F
  #pragma pack(push, 1)
  // Autogenerated type: VROSC.PlayMoreOnBoardTutorialStep
  // [TokenAttribute] Offset: FFFFFFFF
  class PlayMoreOnBoardTutorialStep : public ::VROSC::TutorialStep {
    public:
    public:
    // private System.Int32 _notesPlayed
    // Size: 0x4
    // Offset: 0x58
    int notesPlayed;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean _triggerPressed
    // Size: 0x1
    // Offset: 0x5C
    bool triggerPressed;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _gripPressed
    // Size: 0x1
    // Offset: 0x5D
    bool gripPressed;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _thumbPressed
    // Size: 0x1
    // Offset: 0x5E
    bool thumbPressed;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Get instance field reference: private System.Int32 _notesPlayed
    [[deprecated]] int& dyn__notesPlayed();
    // Get instance field reference: private System.Boolean _triggerPressed
    [[deprecated]] bool& dyn__triggerPressed();
    // Get instance field reference: private System.Boolean _gripPressed
    [[deprecated]] bool& dyn__gripPressed();
    // Get instance field reference: private System.Boolean _thumbPressed
    [[deprecated]] bool& dyn__thumbPressed();
    // public System.Void TutorialEventTriggered(VROSC.TutorialEvent tutorialEvent)
    // Offset: 0xAE0A58
    void TutorialEventTriggered(::VROSC::TutorialEvent tutorialEvent);
    // private System.Void ButtonPressed(VROSC.InputDevice inputDevice, VROSC.TriggerButton button)
    // Offset: 0xAE0BFC
    void ButtonPressed(::VROSC::InputDevice* inputDevice, ::VROSC::TriggerButton button);
    // private System.Void NotePlayed(VROSC.WidgetSettings/VROSC.Identifier id, VROSC.PatchSettings patch)
    // Offset: 0xAE0CB8
    void NotePlayed(::VROSC::WidgetSettings::Identifier id, ::VROSC::PatchSettings* patch);
    // public System.Void .ctor()
    // Offset: 0xAE0EAC
    // Implemented from: VROSC.TutorialStep
    // Base method: System.Void TutorialStep::.ctor()
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static PlayMoreOnBoardTutorialStep* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::VROSC::PlayMoreOnBoardTutorialStep::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<PlayMoreOnBoardTutorialStep*, creationType>()));
    }
    // public override System.Void OnEnter(params System.Object[] values)
    // Offset: 0xAE0954
    // Implemented from: VROSC.TutorialStep
    // Base method: System.Void TutorialStep::OnEnter(params System.Object[] values)
    void OnEnter(::ArrayW<::Il2CppObject*> values);
  }; // VROSC.PlayMoreOnBoardTutorialStep
  #pragma pack(pop)
  static check_size<sizeof(PlayMoreOnBoardTutorialStep), 94 + sizeof(bool)> __VROSC_PlayMoreOnBoardTutorialStepSizeCheck;
  static_assert(sizeof(PlayMoreOnBoardTutorialStep) == 0x5F);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: VROSC::PlayMoreOnBoardTutorialStep::TutorialEventTriggered
// Il2CppName: TutorialEventTriggered
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::PlayMoreOnBoardTutorialStep::*)(::VROSC::TutorialEvent)>(&VROSC::PlayMoreOnBoardTutorialStep::TutorialEventTriggered)> {
  static const MethodInfo* get() {
    static auto* tutorialEvent = &::il2cpp_utils::GetClassFromName("VROSC", "TutorialEvent")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(VROSC::PlayMoreOnBoardTutorialStep*), "TutorialEventTriggered", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{tutorialEvent});
  }
};
// Writing MetadataGetter for method: VROSC::PlayMoreOnBoardTutorialStep::ButtonPressed
// Il2CppName: ButtonPressed
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::PlayMoreOnBoardTutorialStep::*)(::VROSC::InputDevice*, ::VROSC::TriggerButton)>(&VROSC::PlayMoreOnBoardTutorialStep::ButtonPressed)> {
  static const MethodInfo* get() {
    static auto* inputDevice = &::il2cpp_utils::GetClassFromName("VROSC", "InputDevice")->byval_arg;
    static auto* button = &::il2cpp_utils::GetClassFromName("VROSC", "TriggerButton")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(VROSC::PlayMoreOnBoardTutorialStep*), "ButtonPressed", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{inputDevice, button});
  }
};
// Writing MetadataGetter for method: VROSC::PlayMoreOnBoardTutorialStep::NotePlayed
// Il2CppName: NotePlayed
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::PlayMoreOnBoardTutorialStep::*)(::VROSC::WidgetSettings::Identifier, ::VROSC::PatchSettings*)>(&VROSC::PlayMoreOnBoardTutorialStep::NotePlayed)> {
  static const MethodInfo* get() {
    static auto* id = &::il2cpp_utils::GetClassFromName("VROSC", "WidgetSettings/Identifier")->byval_arg;
    static auto* patch = &::il2cpp_utils::GetClassFromName("VROSC", "PatchSettings")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(VROSC::PlayMoreOnBoardTutorialStep*), "NotePlayed", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{id, patch});
  }
};
// Writing MetadataGetter for method: VROSC::PlayMoreOnBoardTutorialStep::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
// Writing MetadataGetter for method: VROSC::PlayMoreOnBoardTutorialStep::OnEnter
// Il2CppName: OnEnter
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::PlayMoreOnBoardTutorialStep::*)(::ArrayW<::Il2CppObject*>)>(&VROSC::PlayMoreOnBoardTutorialStep::OnEnter)> {
  static const MethodInfo* get() {
    static auto* values = &il2cpp_functions::array_class_get(::il2cpp_utils::GetClassFromName("System", "Object"), 1)->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(VROSC::PlayMoreOnBoardTutorialStep*), "OnEnter", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{values});
  }
};
