// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: VROSC.SessionsLibraryUI/VROSC.OrderingType
#include "VROSC/SessionsLibraryUI_OrderingType.hpp"
// Including type: VROSC.SessionsLibraryUI/VROSC.OrderingDirection
#include "VROSC/SessionsLibraryUI_OrderingDirection.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: VROSC
namespace VROSC {
  // Forward declaring type: OrderToggleButton
  class OrderToggleButton;
  // Forward declaring type: UIButton
  class UIButton;
  // Forward declaring type: InputDevice
  class InputDevice;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: UIInputField
  class UIInputField;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`2<T1, T2>
  template<typename T1, typename T2>
  class Action_2;
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
}
// Completed forward declares
// Type namespace: VROSC
namespace VROSC {
  // Forward declaring type: SessionsSearchBar
  class SessionsSearchBar;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::VROSC::SessionsSearchBar);
DEFINE_IL2CPP_ARG_TYPE(::VROSC::SessionsSearchBar*, "VROSC", "SessionsSearchBar");
// Type namespace: VROSC
namespace VROSC {
  // Size: 0x50
  #pragma pack(push, 1)
  // Autogenerated type: VROSC.SessionsSearchBar
  // [TokenAttribute] Offset: FFFFFFFF
  class SessionsSearchBar : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // private VROSC.OrderToggleButton _newestOrderToggle
    // Size: 0x8
    // Offset: 0x18
    ::VROSC::OrderToggleButton* newestOrderToggle;
    // Field size check
    static_assert(sizeof(::VROSC::OrderToggleButton*) == 0x8);
    // private VROSC.OrderToggleButton _azOrderToggle
    // Size: 0x8
    // Offset: 0x20
    ::VROSC::OrderToggleButton* azOrderToggle;
    // Field size check
    static_assert(sizeof(::VROSC::OrderToggleButton*) == 0x8);
    // private VROSC.OrderToggleButton _popularityOrderToggle
    // Size: 0x8
    // Offset: 0x28
    ::VROSC::OrderToggleButton* popularityOrderToggle;
    // Field size check
    static_assert(sizeof(::VROSC::OrderToggleButton*) == 0x8);
    // private UIInputField _searchField
    // Size: 0x8
    // Offset: 0x30
    ::GlobalNamespace::UIInputField* searchField;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::UIInputField*) == 0x8);
    // private VROSC.UIButton _clearSerachButton
    // Size: 0x8
    // Offset: 0x38
    ::VROSC::UIButton* clearSerachButton;
    // Field size check
    static_assert(sizeof(::VROSC::UIButton*) == 0x8);
    // public System.Action`2<VROSC.SessionsLibraryUI/VROSC.OrderingType,VROSC.SessionsLibraryUI/VROSC.OrderingDirection> OnOrderingChanged
    // Size: 0x8
    // Offset: 0x40
    ::System::Action_2<::VROSC::SessionsLibraryUI::OrderingType, ::VROSC::SessionsLibraryUI::OrderingDirection>* OnOrderingChanged;
    // Field size check
    static_assert(sizeof(::System::Action_2<::VROSC::SessionsLibraryUI::OrderingType, ::VROSC::SessionsLibraryUI::OrderingDirection>*) == 0x8);
    // public System.Action`1<System.String> OnSearchChanged
    // Size: 0x8
    // Offset: 0x48
    ::System::Action_1<::StringW>* OnSearchChanged;
    // Field size check
    static_assert(sizeof(::System::Action_1<::StringW>*) == 0x8);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: private VROSC.OrderToggleButton _newestOrderToggle
    [[deprecated("Use field access instead!")]] ::VROSC::OrderToggleButton*& dyn__newestOrderToggle();
    // Get instance field reference: private VROSC.OrderToggleButton _azOrderToggle
    [[deprecated("Use field access instead!")]] ::VROSC::OrderToggleButton*& dyn__azOrderToggle();
    // Get instance field reference: private VROSC.OrderToggleButton _popularityOrderToggle
    [[deprecated("Use field access instead!")]] ::VROSC::OrderToggleButton*& dyn__popularityOrderToggle();
    // Get instance field reference: private UIInputField _searchField
    [[deprecated("Use field access instead!")]] ::GlobalNamespace::UIInputField*& dyn__searchField();
    // Get instance field reference: private VROSC.UIButton _clearSerachButton
    [[deprecated("Use field access instead!")]] ::VROSC::UIButton*& dyn__clearSerachButton();
    // Get instance field reference: public System.Action`2<VROSC.SessionsLibraryUI/VROSC.OrderingType,VROSC.SessionsLibraryUI/VROSC.OrderingDirection> OnOrderingChanged
    [[deprecated("Use field access instead!")]] ::System::Action_2<::VROSC::SessionsLibraryUI::OrderingType, ::VROSC::SessionsLibraryUI::OrderingDirection>*& dyn_OnOrderingChanged();
    // Get instance field reference: public System.Action`1<System.String> OnSearchChanged
    [[deprecated("Use field access instead!")]] ::System::Action_1<::StringW>*& dyn_OnSearchChanged();
    // public System.Void .ctor()
    // Offset: 0x1997F68
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static SessionsSearchBar* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::VROSC::SessionsSearchBar::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<SessionsSearchBar*, creationType>()));
    }
    // private System.Void Awake()
    // Offset: 0x1997330
    void Awake();
    // private System.Void OnDestroy()
    // Offset: 0x1997744
    void OnDestroy();
    // public System.Void SetSearchText(System.String text)
    // Offset: 0x19920E0
    void SetSearchText(::StringW text);
    // private System.Void NewestOrderButtonToggled(VROSC.InputDevice device, System.Boolean isToggled)
    // Offset: 0x1997B38
    void NewestOrderButtonToggled(::VROSC::InputDevice* device, bool isToggled);
    // private System.Void AzOrderButtonToggled(VROSC.InputDevice device, System.Boolean isToggled)
    // Offset: 0x1997BD8
    void AzOrderButtonToggled(::VROSC::InputDevice* device, bool isToggled);
    // private System.Void PopularityOrderButtonToggled(VROSC.InputDevice device, System.Boolean isToggled)
    // Offset: 0x1997C78
    void PopularityOrderButtonToggled(::VROSC::InputDevice* device, bool isToggled);
    // private System.Void NewestOrderButtonStateChanged(System.Int32 state)
    // Offset: 0x1997D18
    void NewestOrderButtonStateChanged(int state);
    // private System.Void AzOrderButtonStateChanged(System.Int32 state)
    // Offset: 0x1997D8C
    void AzOrderButtonStateChanged(int state);
    // private System.Void PopularityOrderButtonStateChanged(System.Int32 state)
    // Offset: 0x1997E00
    void PopularityOrderButtonStateChanged(int state);
    // private System.Void SearchFieldChanged(System.String text)
    // Offset: 0x1997E74
    void SearchFieldChanged(::StringW text);
    // private System.Void ClearSearchField()
    // Offset: 0x1997F10
    void ClearSearchField();
  }; // VROSC.SessionsSearchBar
  #pragma pack(pop)
  static check_size<sizeof(SessionsSearchBar), 72 + sizeof(::System::Action_1<::StringW>*)> __VROSC_SessionsSearchBarSizeCheck;
  static_assert(sizeof(SessionsSearchBar) == 0x50);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: VROSC::SessionsSearchBar::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
// Writing MetadataGetter for method: VROSC::SessionsSearchBar::Awake
// Il2CppName: Awake
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::SessionsSearchBar::*)()>(&VROSC::SessionsSearchBar::Awake)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(VROSC::SessionsSearchBar*), "Awake", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: VROSC::SessionsSearchBar::OnDestroy
// Il2CppName: OnDestroy
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::SessionsSearchBar::*)()>(&VROSC::SessionsSearchBar::OnDestroy)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(VROSC::SessionsSearchBar*), "OnDestroy", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: VROSC::SessionsSearchBar::SetSearchText
// Il2CppName: SetSearchText
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::SessionsSearchBar::*)(::StringW)>(&VROSC::SessionsSearchBar::SetSearchText)> {
  static const MethodInfo* get() {
    static auto* text = &::il2cpp_utils::GetClassFromName("System", "String")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(VROSC::SessionsSearchBar*), "SetSearchText", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{text});
  }
};
// Writing MetadataGetter for method: VROSC::SessionsSearchBar::NewestOrderButtonToggled
// Il2CppName: NewestOrderButtonToggled
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::SessionsSearchBar::*)(::VROSC::InputDevice*, bool)>(&VROSC::SessionsSearchBar::NewestOrderButtonToggled)> {
  static const MethodInfo* get() {
    static auto* device = &::il2cpp_utils::GetClassFromName("VROSC", "InputDevice")->byval_arg;
    static auto* isToggled = &::il2cpp_utils::GetClassFromName("System", "Boolean")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(VROSC::SessionsSearchBar*), "NewestOrderButtonToggled", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{device, isToggled});
  }
};
// Writing MetadataGetter for method: VROSC::SessionsSearchBar::AzOrderButtonToggled
// Il2CppName: AzOrderButtonToggled
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::SessionsSearchBar::*)(::VROSC::InputDevice*, bool)>(&VROSC::SessionsSearchBar::AzOrderButtonToggled)> {
  static const MethodInfo* get() {
    static auto* device = &::il2cpp_utils::GetClassFromName("VROSC", "InputDevice")->byval_arg;
    static auto* isToggled = &::il2cpp_utils::GetClassFromName("System", "Boolean")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(VROSC::SessionsSearchBar*), "AzOrderButtonToggled", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{device, isToggled});
  }
};
// Writing MetadataGetter for method: VROSC::SessionsSearchBar::PopularityOrderButtonToggled
// Il2CppName: PopularityOrderButtonToggled
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::SessionsSearchBar::*)(::VROSC::InputDevice*, bool)>(&VROSC::SessionsSearchBar::PopularityOrderButtonToggled)> {
  static const MethodInfo* get() {
    static auto* device = &::il2cpp_utils::GetClassFromName("VROSC", "InputDevice")->byval_arg;
    static auto* isToggled = &::il2cpp_utils::GetClassFromName("System", "Boolean")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(VROSC::SessionsSearchBar*), "PopularityOrderButtonToggled", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{device, isToggled});
  }
};
// Writing MetadataGetter for method: VROSC::SessionsSearchBar::NewestOrderButtonStateChanged
// Il2CppName: NewestOrderButtonStateChanged
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::SessionsSearchBar::*)(int)>(&VROSC::SessionsSearchBar::NewestOrderButtonStateChanged)> {
  static const MethodInfo* get() {
    static auto* state = &::il2cpp_utils::GetClassFromName("System", "Int32")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(VROSC::SessionsSearchBar*), "NewestOrderButtonStateChanged", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{state});
  }
};
// Writing MetadataGetter for method: VROSC::SessionsSearchBar::AzOrderButtonStateChanged
// Il2CppName: AzOrderButtonStateChanged
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::SessionsSearchBar::*)(int)>(&VROSC::SessionsSearchBar::AzOrderButtonStateChanged)> {
  static const MethodInfo* get() {
    static auto* state = &::il2cpp_utils::GetClassFromName("System", "Int32")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(VROSC::SessionsSearchBar*), "AzOrderButtonStateChanged", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{state});
  }
};
// Writing MetadataGetter for method: VROSC::SessionsSearchBar::PopularityOrderButtonStateChanged
// Il2CppName: PopularityOrderButtonStateChanged
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::SessionsSearchBar::*)(int)>(&VROSC::SessionsSearchBar::PopularityOrderButtonStateChanged)> {
  static const MethodInfo* get() {
    static auto* state = &::il2cpp_utils::GetClassFromName("System", "Int32")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(VROSC::SessionsSearchBar*), "PopularityOrderButtonStateChanged", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{state});
  }
};
// Writing MetadataGetter for method: VROSC::SessionsSearchBar::SearchFieldChanged
// Il2CppName: SearchFieldChanged
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::SessionsSearchBar::*)(::StringW)>(&VROSC::SessionsSearchBar::SearchFieldChanged)> {
  static const MethodInfo* get() {
    static auto* text = &::il2cpp_utils::GetClassFromName("System", "String")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(VROSC::SessionsSearchBar*), "SearchFieldChanged", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{text});
  }
};
// Writing MetadataGetter for method: VROSC::SessionsSearchBar::ClearSearchField
// Il2CppName: ClearSearchField
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::SessionsSearchBar::*)()>(&VROSC::SessionsSearchBar::ClearSearchField)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(VROSC::SessionsSearchBar*), "ClearSearchField", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
