// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: VROSC.Error
#include "VROSC/Error.hpp"
// Including type: VROSC.Session
#include "VROSC/Session.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: VROSC
namespace VROSC {
  // Forward declaring type: UserDataControllers
  class UserDataControllers;
  // Forward declaring type: SaveLoadManager
  class SaveLoadManager;
  // Forward declaring type: OldSavesHandler
  class OldSavesHandler;
  // Forward declaring type: LocalSessionsDataController
  class LocalSessionsDataController;
  // Forward declaring type: CloudSessionsDataController
  class CloudSessionsDataController;
  // Forward declaring type: CommunitySessionsDataController
  class CommunitySessionsDataController;
  // Forward declaring type: SessionUIData
  class SessionUIData;
  // Forward declaring type: SessionsDataController
  class SessionsDataController;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action
  class Action;
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
  // Forward declaring type: Action`2<T1, T2>
  template<typename T1, typename T2>
  class Action_2;
  // Forward declaring type: Action`3<T1, T2, T3>
  template<typename T1, typename T2, typename T3>
  class Action_3;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: AudioClip
  class AudioClip;
}
// Completed forward declares
// Type namespace: VROSC
namespace VROSC {
  // Forward declaring type: SessionsManager
  class SessionsManager;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::VROSC::SessionsManager);
DEFINE_IL2CPP_ARG_TYPE(::VROSC::SessionsManager*, "VROSC", "SessionsManager");
// Type namespace: VROSC
namespace VROSC {
  // Size: 0x58
  #pragma pack(push, 1)
  // Autogenerated type: VROSC.SessionsManager
  // [TokenAttribute] Offset: FFFFFFFF
  class SessionsManager : public ::Il2CppObject {
    public:
    // Nested type: ::VROSC::SessionsManager::$$c__DisplayClass52_0
    class $$c__DisplayClass52_0;
    // Nested type: ::VROSC::SessionsManager::$$c__DisplayClass53_0
    class $$c__DisplayClass53_0;
    // Nested type: ::VROSC::SessionsManager::$$c__DisplayClass54_0
    class $$c__DisplayClass54_0;
    // Nested type: ::VROSC::SessionsManager::$$c__DisplayClass57_0
    class $$c__DisplayClass57_0;
    // Nested type: ::VROSC::SessionsManager::$$c__DisplayClass58_0
    class $$c__DisplayClass58_0;
    // Nested type: ::VROSC::SessionsManager::$$c__DisplayClass59_0
    class $$c__DisplayClass59_0;
    // Nested type: ::VROSC::SessionsManager::$$c__DisplayClass59_1
    class $$c__DisplayClass59_1;
    // Nested type: ::VROSC::SessionsManager::$$c__DisplayClass65_0
    class $$c__DisplayClass65_0;
    // Nested type: ::VROSC::SessionsManager::$$c__DisplayClass65_1
    class $$c__DisplayClass65_1;
    // Nested type: ::VROSC::SessionsManager::$$c__DisplayClass66_0
    class $$c__DisplayClass66_0;
    // Nested type: ::VROSC::SessionsManager::$$c__DisplayClass66_1
    class $$c__DisplayClass66_1;
    // Nested type: ::VROSC::SessionsManager::$$c__DisplayClass67_0
    class $$c__DisplayClass67_0;
    // Nested type: ::VROSC::SessionsManager::$$c__DisplayClass67_1
    class $$c__DisplayClass67_1;
    // Nested type: ::VROSC::SessionsManager::$$c__DisplayClass68_0
    class $$c__DisplayClass68_0;
    // Nested type: ::VROSC::SessionsManager::$$c__DisplayClass68_1
    class $$c__DisplayClass68_1;
    // Nested type: ::VROSC::SessionsManager::$$c__DisplayClass69_0
    class $$c__DisplayClass69_0;
    // Nested type: ::VROSC::SessionsManager::$$c__DisplayClass70_0
    class $$c__DisplayClass70_0;
    // Nested type: ::VROSC::SessionsManager::$$c__DisplayClass73_0
    class $$c__DisplayClass73_0;
    // Nested type: ::VROSC::SessionsManager::$$c__DisplayClass78_0
    class $$c__DisplayClass78_0;
    public:
    // private VROSC.UserDataControllers _userDataControllers
    // Size: 0x8
    // Offset: 0x10
    ::VROSC::UserDataControllers* userDataControllers;
    // Field size check
    static_assert(sizeof(::VROSC::UserDataControllers*) == 0x8);
    // private VROSC.SaveLoadManager _saveLoadManager
    // Size: 0x8
    // Offset: 0x18
    ::VROSC::SaveLoadManager* saveLoadManager;
    // Field size check
    static_assert(sizeof(::VROSC::SaveLoadManager*) == 0x8);
    // private VROSC.OldSavesHandler _oldSavesHandler
    // Size: 0x8
    // Offset: 0x20
    ::VROSC::OldSavesHandler* oldSavesHandler;
    // Field size check
    static_assert(sizeof(::VROSC::OldSavesHandler*) == 0x8);
    // private VROSC.LocalSessionsDataController _localSessionsDataController
    // Size: 0x8
    // Offset: 0x28
    ::VROSC::LocalSessionsDataController* localSessionsDataController;
    // Field size check
    static_assert(sizeof(::VROSC::LocalSessionsDataController*) == 0x8);
    // private VROSC.CloudSessionsDataController _cloudSessionsDataController
    // Size: 0x8
    // Offset: 0x30
    ::VROSC::CloudSessionsDataController* cloudSessionsDataController;
    // Field size check
    static_assert(sizeof(::VROSC::CloudSessionsDataController*) == 0x8);
    // private VROSC.CommunitySessionsDataController _communitySessionsDataController
    // Size: 0x8
    // Offset: 0x38
    ::VROSC::CommunitySessionsDataController* communitySessionsDataController;
    // Field size check
    static_assert(sizeof(::VROSC::CommunitySessionsDataController*) == 0x8);
    // private System.String _loadedSessionId
    // Size: 0x8
    // Offset: 0x40
    ::StringW loadedSessionId;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Boolean <IsSessionDataValidated>k__BackingField
    // Size: 0x1
    // Offset: 0x48
    bool IsSessionDataValidated;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: IsSessionDataValidated and: CurrentSessionDisplayName
    char __padding7[0x7] = {};
    // private System.String <CurrentSessionDisplayName>k__BackingField
    // Size: 0x8
    // Offset: 0x50
    ::StringW CurrentSessionDisplayName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    public:
    // Get static field: static public System.Action OnSessionsValidated
    static ::System::Action* _get_OnSessionsValidated();
    // Set static field: static public System.Action OnSessionsValidated
    static void _set_OnSessionsValidated(::System::Action* value);
    // Get static field: static public System.Action`1<System.Collections.Generic.List`1<VROSC.SessionUIData>> OnLocalSessionsDataLoadSuccess
    static ::System::Action_1<::System::Collections::Generic::List_1<::VROSC::SessionUIData*>*>* _get_OnLocalSessionsDataLoadSuccess();
    // Set static field: static public System.Action`1<System.Collections.Generic.List`1<VROSC.SessionUIData>> OnLocalSessionsDataLoadSuccess
    static void _set_OnLocalSessionsDataLoadSuccess(::System::Action_1<::System::Collections::Generic::List_1<::VROSC::SessionUIData*>*>* value);
