// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: VROSC.ConfirmationUIPopup
#include "VROSC/ConfirmationUIPopup.hpp"
// Including type: VROSC.LoginUIPopup
#include "VROSC/LoginUIPopup.hpp"
// Including type: System.Enum
#include "System/Enum.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: VROSC
namespace VROSC {
  // Forward declaring type: SessionsPanelUI
  class SessionsPanelUI;
  // Forward declaring type: MySessionsPanelUI
  class MySessionsPanelUI;
  // Forward declaring type: MySharedSessionsPanelUI
  class MySharedSessionsPanelUI;
  // Forward declaring type: CommunitySessionsPanelUI
  class CommunitySessionsPanelUI;
  // Forward declaring type: FavoritesSessionsPanelUI
  class FavoritesSessionsPanelUI;
  // Forward declaring type: UIButton
  class UIButton;
  // Forward declaring type: PreviewOptionsUI
  class PreviewOptionsUI;
  // Forward declaring type: SaveSessionUIPopup
  class SaveSessionUIPopup;
  // Forward declaring type: LoadSessionUIPopup
  class LoadSessionUIPopup;
  // Forward declaring type: UserProfilePopup
  class UserProfilePopup;
  // Forward declaring type: SessionInfoPopup
  class SessionInfoPopup;
  // Forward declaring type: SessionsSearchBar
  class SessionsSearchBar;
  // Forward declaring type: SessionItemData
  class SessionItemData;
  // Forward declaring type: Error
  struct Error;
}
// Forward declaring namespace: VROSC::UI
namespace VROSC::UI {
  // Forward declaring type: TabController
  class TabController;
  // Forward declaring type: TabButton
  class TabButton;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: AudioClip
  class AudioClip;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action
  class Action;
}
// Completed forward declares
// Type namespace: VROSC
namespace VROSC {
  // Forward declaring type: SessionsLibraryUI
  class SessionsLibraryUI;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::VROSC::SessionsLibraryUI);
DEFINE_IL2CPP_ARG_TYPE(::VROSC::SessionsLibraryUI*, "VROSC", "SessionsLibraryUI");
// Type namespace: VROSC
namespace VROSC {
  // Size: 0x118
  #pragma pack(push, 1)
  // Autogenerated type: VROSC.SessionsLibraryUI
  // [TokenAttribute] Offset: FFFFFFFF
  class SessionsLibraryUI : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::VROSC::SessionsLibraryUI::State
    struct State;
    // Nested type: ::VROSC::SessionsLibraryUI::OrderingType
    struct OrderingType;
    // Nested type: ::VROSC::SessionsLibraryUI::OrderingDirection
    struct OrderingDirection;
    // Nested type: ::VROSC::SessionsLibraryUI::SessionSaveData
    class SessionSaveData;
    // Nested type: ::VROSC::SessionsLibraryUI::$$c__DisplayClass64_0
    class $$c__DisplayClass64_0;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: VROSC.SessionsLibraryUI/VROSC.State
    // [TokenAttribute] Offset: FFFFFFFF
    struct State/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: State
      constexpr State(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public VROSC.SessionsLibraryUI/VROSC.State Main
      static constexpr const int Main = 0;
      // Get static field: static public VROSC.SessionsLibraryUI/VROSC.State Main
      static ::VROSC::SessionsLibraryUI::State _get_Main();
      // Set static field: static public VROSC.SessionsLibraryUI/VROSC.State Main
      static void _set_Main(::VROSC::SessionsLibraryUI::State value);
      // static field const value: static public VROSC.SessionsLibraryUI/VROSC.State Saving
      static constexpr const int Saving = 1;
      // Get static field: static public VROSC.SessionsLibraryUI/VROSC.State Saving
      static ::VROSC::SessionsLibraryUI::State _get_Saving();
      // Set static field: static public VROSC.SessionsLibraryUI/VROSC.State Saving
      static void _set_Saving(::VROSC::SessionsLibraryUI::State value);
      // static field const value: static public VROSC.SessionsLibraryUI/VROSC.State Loading
      static constexpr const int Loading = 2;
      // Get static field: static public VROSC.SessionsLibraryUI/VROSC.State Loading
      static ::VROSC::SessionsLibraryUI::State _get_Loading();
      // Set static field: static public VROSC.SessionsLibraryUI/VROSC.State Loading
      static void _set_Loading(::VROSC::SessionsLibraryUI::State value);
      // static field const value: static public VROSC.SessionsLibraryUI/VROSC.State Confirmation
      static constexpr const int Confirmation = 3;
      // Get static field: static public VROSC.SessionsLibraryUI/VROSC.State Confirmation
      static ::VROSC::SessionsLibraryUI::State _get_Confirmation();
      // Set static field: static public VROSC.SessionsLibraryUI/VROSC.State Confirmation
      static void _set_Confirmation(::VROSC::SessionsLibraryUI::State value);
      // static field const value: static public VROSC.SessionsLibraryUI/VROSC.State WaitingForValidation
      static constexpr const int WaitingForValidation = 4;
      // Get static field: static public VROSC.SessionsLibraryUI/VROSC.State WaitingForValidation
      static ::VROSC::SessionsLibraryUI::State _get_WaitingForValidation();
      // Set static field: static public VROSC.SessionsLibraryUI/VROSC.State WaitingForValidation
      static void _set_WaitingForValidation(::VROSC::SessionsLibraryUI::State value);
      // static field const value: static public VROSC.SessionsLibraryUI/VROSC.State LoggingIn
      static constexpr const int LoggingIn = 5;
      // Get static field: static public VROSC.SessionsLibraryUI/VROSC.State LoggingIn
      static ::VROSC::SessionsLibraryUI::State _get_LoggingIn();
      // Set static field: static public VROSC.SessionsLibraryUI/VROSC.State LoggingIn
      static void _set_LoggingIn(::VROSC::SessionsLibraryUI::State value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // VROSC.SessionsLibraryUI/VROSC.State
    #pragma pack(pop)
    static check_size<sizeof(SessionsLibraryUI::State), 0 + sizeof(int)> __VROSC_SessionsLibraryUI_StateSizeCheck;
    static_assert(sizeof(SessionsLibraryUI::State) == 0x4);
    public:
    // private VROSC.LoginUIPopup _loginPopupUI
    // Size: 0x8
    // Offset: 0x18
    ::VROSC::LoginUIPopup* loginPopupUI;
    // Field size check
    static_assert(sizeof(::VROSC::LoginUIPopup*) == 0x8);
    // private VROSC.MySessionsPanelUI _mySessionsPanelUI
    // Size: 0x8
    // Offset: 0x20
    ::VROSC::MySessionsPanelUI* mySessionsPanelUI;
    // Field size check
    static_assert(sizeof(::VROSC::MySessionsPanelUI*) == 0x8);
    // private VROSC.MySharedSessionsPanelUI _mySharedSessionsPanelUI
    // Size: 0x8
    // Offset: 0x28
    ::VROSC::MySharedSessionsPanelUI* mySharedSessionsPanelUI;
    // Field size check
    static_assert(sizeof(::VROSC::MySharedSessionsPanelUI*) == 0x8);
    // private VROSC.CommunitySessionsPanelUI _communitySessionsPanelUI
    // Size: 0x8
    // Offset: 0x30
    ::VROSC::CommunitySessionsPanelUI* communitySessionsPanelUI;
    // Field size check
    static_assert(sizeof(::VROSC::CommunitySessionsPanelUI*) == 0x8);
    // private VROSC.FavoritesSessionsPanelUI _favoritesSessionsPanelUI
    // Size: 0x8
    // Offset: 0x38
    ::VROSC::FavoritesSessionsPanelUI* favoritesSessionsPanelUI;
    // Field size check
    static_assert(sizeof(::VROSC::FavoritesSessionsPanelUI*) == 0x8);
    // private VROSC.UI.TabController _tabController
    // Size: 0x8
    // Offset: 0x40
    ::VROSC::UI::TabController* tabController;
    // Field size check
    static_assert(sizeof(::VROSC::UI::TabController*) == 0x8);
    // private VROSC.UIButton _profileButton
    // Size: 0x8
    // Offset: 0x48
    ::VROSC::UIButton* profileButton;
    // Field size check
    static_assert(sizeof(::VROSC::UIButton*) == 0x8);
    // private VROSC.UIButton _closeButton
    // Size: 0x8
    // Offset: 0x50
    ::VROSC::UIButton* closeButton;
    // Field size check
    static_assert(sizeof(::VROSC::UIButton*) == 0x8);
    // private VROSC.UIButton _newSessionButton
    // Size: 0x8
    // Offset: 0x58
    ::VROSC::UIButton* newSessionButton;
    // Field size check
    static_assert(sizeof(::VROSC::UIButton*) == 0x8);
    // private VROSC.UIButton _saveSessionButton
    // Size: 0x8
    // Offset: 0x60
    ::VROSC::UIButton* saveSessionButton;
    // Field size check
    static_assert(sizeof(::VROSC::UIButton*) == 0x8);
    // private VROSC.UIButton _saveAsSessionButton
    // Size: 0x8
    // Offset: 0x68
    ::VROSC::UIButton* saveAsSessionButton;
    // Field size check
    static_assert(sizeof(::VROSC::UIButton*) == 0x8);
    // private VROSC.UIButton _loadSessionButton
    // Size: 0x8
    // Offset: 0x70
    ::VROSC::UIButton* loadSessionButton;
    // Field size check
    static_assert(sizeof(::VROSC::UIButton*) == 0x8);
    // private VROSC.UIButton _deleteSessionButton
    // Size: 0x8
    // Offset: 0x78
    ::VROSC::UIButton* deleteSessionButton;
    // Field size check
    static_assert(sizeof(::VROSC::UIButton*) == 0x8);
    // private VROSC.ConfirmationUIPopup _confirmationUIPopup
    // Size: 0x8
    // Offset: 0x80
    ::VROSC::ConfirmationUIPopup* confirmationUIPopup;
    // Field size check
    static_assert(sizeof(::VROSC::ConfirmationUIPopup*) == 0x8);
    // private VROSC.SaveSessionUIPopup _saveSessionUIPopup
    // Size: 0x8
    // Offset: 0x88
    ::VROSC::SaveSessionUIPopup* saveSessionUIPopup;
    // Field size check
    static_assert(sizeof(::VROSC::SaveSessionUIPopup*) == 0x8);
    // private VROSC.LoadSessionUIPopup _loadSessionUIPopup
    // Size: 0x8
    // Offset: 0x90
    ::VROSC::LoadSessionUIPopup* loadSessionUIPopup;
    // Field size check
    static_assert(sizeof(::VROSC::LoadSessionUIPopup*) == 0x8);
    // private UnityEngine.GameObject _waitingForDataValidationPopup
    // Size: 0x8
    // Offset: 0x98
    ::UnityEngine::GameObject* waitingForDataValidationPopup;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private VROSC.UserProfilePopup _userProfilePopup
    // Size: 0x8
    // Offset: 0xA0
    ::VROSC::UserProfilePopup* userProfilePopup;
    // Field size check
    static_assert(sizeof(::VROSC::UserProfilePopup*) == 0x8);
    // private VROSC.SessionInfoPopup _sessionInfoPopup
    // Size: 0x8
    // Offset: 0xA8
    ::VROSC::SessionInfoPopup* sessionInfoPopup;
    // Field size check
    static_assert(sizeof(::VROSC::SessionInfoPopup*) == 0x8);
    // private VROSC.SessionsSearchBar _searchBar
    // Size: 0x8
    // Offset: 0xB0
    ::VROSC::SessionsSearchBar* searchBar;
    // Field size check
    static_assert(sizeof(::VROSC::SessionsSearchBar*) == 0x8);
    // private VROSC.ConfirmationUIPopup/VROSC.Data _newSessionConfirmationData
    // Size: 0x8
    // Offset: 0xB8
    ::VROSC::ConfirmationUIPopup::Data* newSessionConfirmationData;
    // Field size check
    static_assert(sizeof(::VROSC::ConfirmationUIPopup::Data*) == 0x8);
    // private VROSC.ConfirmationUIPopup/VROSC.Data _loadSessionConfirmationData
    // Size: 0x8
    // Offset: 0xC0
    ::VROSC::ConfirmationUIPopup::Data* loadSessionConfirmationData;
    // Field size check
    static_assert(sizeof(::VROSC::ConfirmationUIPopup::Data*) == 0x8);
    // private VROSC.ConfirmationUIPopup/VROSC.Data _deleteSessionConfirmationData
    // Size: 0x8
    // Offset: 0xC8
    ::VROSC::ConfirmationUIPopup::Data* deleteSessionConfirmationData;
    // Field size check
    static_assert(sizeof(::VROSC::ConfirmationUIPopup::Data*) == 0x8);
    // private VROSC.PreviewOptionsUI _previewOptionsUI
    // Size: 0x8
    // Offset: 0xD0
    ::VROSC::PreviewOptionsUI* previewOptionsUI;
    // Field size check
    static_assert(sizeof(::VROSC::PreviewOptionsUI*) == 0x8);
    // private UnityEngine.GameObject _updateNoticeWindow
    // Size: 0x8
    // Offset: 0xD8
    ::UnityEngine::GameObject* updateNoticeWindow;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject _mainWindow
    // Size: 0x8
    // Offset: 0xE0
    ::UnityEngine::GameObject* mainWindow;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private VROSC.UIButton _updateContinueButton
    // Size: 0x8
    // Offset: 0xE8
    ::VROSC::UIButton* updateContinueButton;
    // Field size check
    static_assert(sizeof(::VROSC::UIButton*) == 0x8);
    // private VROSC.SessionsLibraryUI/VROSC.State _currentState
    // Size: 0x4
    // Offset: 0xF0
    ::VROSC::SessionsLibraryUI::State currentState;
    // Field size check
    static_assert(sizeof(::VROSC::SessionsLibraryUI::State) == 0x4);
    // Padding between fields: currentState and: cachedSaveData
    char __padding27[0x4] = {};
    // private VROSC.SessionsLibraryUI/VROSC.SessionSaveData _cachedSaveData
    // Size: 0x8
    // Offset: 0xF8
    ::VROSC::SessionsLibraryUI::SessionSaveData* cachedSaveData;
    // Field size check
    static_assert(sizeof(::VROSC::SessionsLibraryUI::SessionSaveData*) == 0x8);
    // private System.Boolean _allowOnline
    // Size: 0x1
    // Offset: 0x100
    bool allowOnline;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: allowOnline and: currentSessionsPanel
    char __padding29[0x7] = {};
    // private VROSC.SessionsPanelUI _currentSessionsPanel
    // Size: 0x8
    // Offset: 0x108
    ::VROSC::SessionsPanelUI* currentSessionsPanel;
    // Field size check
    static_assert(sizeof(::VROSC::SessionsPanelUI*) == 0x8);
    // private VROSC.SessionItemData _selectedItemData
    // Size: 0x8
    // Offset: 0x110
    ::VROSC::SessionItemData* selectedItemData;
    // Field size check
    static_assert(sizeof(::VROSC::SessionItemData*) == 0x8);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get static field: static public System.Action OnSaveConfirmed
    static ::System::Action* _get_OnSaveConfirmed();
    // Set static field: static public System.Action OnSaveConfirmed
    static void _set_OnSaveConfirmed(::System::Action* value);
    // Get static field: static public System.Action OnLoadConfirmed
    static ::System::Action* _get_OnLoadConfirmed();
    // Set static field: static public System.Action OnLoadConfirmed
    static void _set_OnLoadConfirmed(::System::Action* value);
    // Get static field: static public System.Action OnNewConfirmed
    static ::System::Action* _get_OnNewConfirmed();
    // Set static field: static public System.Action OnNewConfirmed
