// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: VROSC.BaseDataModel
#include "VROSC/BaseDataModel.hpp"
// Including type: VROSC.Note
#include "VROSC/Note.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: VROSC
namespace VROSC {
  // Forward declaring type: ScalePreset
  class ScalePreset;
}
// Completed forward declares
// Type namespace: VROSC
namespace VROSC {
  // Forward declaring type: SessionSettingsDataModel
  class SessionSettingsDataModel;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::VROSC::SessionSettingsDataModel);
DEFINE_IL2CPP_ARG_TYPE(::VROSC::SessionSettingsDataModel*, "VROSC", "SessionSettingsDataModel");
// Type namespace: VROSC
namespace VROSC {
  // Size: 0x3C
  #pragma pack(push, 1)
  // Autogenerated type: VROSC.SessionSettingsDataModel
  // [TokenAttribute] Offset: FFFFFFFF
  class SessionSettingsDataModel : public ::VROSC::BaseDataModel {
    public:
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // public System.Boolean UseExternalSynthesizer
    // Size: 0x1
    // Offset: 0x18
    bool UseExternalSynthesizer;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean SyncIsInternal
    // Size: 0x1
    // Offset: 0x19
    bool SyncIsInternal;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: SyncIsInternal and: InternalBeatLengthInSamples
    char __padding1[0x2] = {};
    // public System.Int32 InternalBeatLengthInSamples
    // Size: 0x4
    // Offset: 0x1C
    int InternalBeatLengthInSamples;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 SelectedScalePresetIndex
    // Size: 0x4
    // Offset: 0x20
    int SelectedScalePresetIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public VROSC.Note SelectedStartNote
    // Size: 0x4
    // Offset: 0x24
    ::VROSC::Note SelectedStartNote;
    // Field size check
    static_assert(sizeof(::VROSC::Note) == 0x4);
    // public System.Collections.Generic.List`1<VROSC.ScalePreset> ScalePresets
    // Size: 0x8
    // Offset: 0x28
    ::System::Collections::Generic::List_1<::VROSC::ScalePreset*>* ScalePresets;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::VROSC::ScalePreset*>*) == 0x8);
    // public System.String SelectedEnvironment
    // Size: 0x8
    // Offset: 0x30
    ::StringW SelectedEnvironment;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.Single EnvironmentEffectsAmount
    // Size: 0x4
    // Offset: 0x38
    float EnvironmentEffectsAmount;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    public:
    // Get instance field reference: public System.Boolean UseExternalSynthesizer
    bool& dyn_UseExternalSynthesizer();
    // Get instance field reference: public System.Boolean SyncIsInternal
    bool& dyn_SyncIsInternal();
    // Get instance field reference: public System.Int32 InternalBeatLengthInSamples
    int& dyn_InternalBeatLengthInSamples();
    // Get instance field reference: public System.Int32 SelectedScalePresetIndex
    int& dyn_SelectedScalePresetIndex();
    // Get instance field reference: public VROSC.Note SelectedStartNote
    ::VROSC::Note& dyn_SelectedStartNote();
    // Get instance field reference: public System.Collections.Generic.List`1<VROSC.ScalePreset> ScalePresets
    ::System::Collections::Generic::List_1<::VROSC::ScalePreset*>*& dyn_ScalePresets();
    // Get instance field reference: public System.String SelectedEnvironment
    ::StringW& dyn_SelectedEnvironment();
    // Get instance field reference: public System.Single EnvironmentEffectsAmount
    float& dyn_EnvironmentEffectsAmount();
    // public override System.String get_Key()
    // Offset: 0x13E8D70
    // Implemented from: VROSC.BaseDataModel
    // Base method: System.String BaseDataModel::get_Key()
    ::StringW get_Key();
    // public override System.Int32 get_Version()
    // Offset: 0x13E8DB4
    // Implemented from: VROSC.BaseDataModel
    // Base method: System.Int32 BaseDataModel::get_Version()
    int get_Version();
    // public System.Void .ctor()
    // Offset: 0x13E80F8
    // Implemented from: VROSC.BaseDataModel
    // Base method: System.Void BaseDataModel::.ctor()
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static SessionSettingsDataModel* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::VROSC::SessionSettingsDataModel::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<SessionSettingsDataModel*, creationType>()));
    }
  }; // VROSC.SessionSettingsDataModel
  #pragma pack(pop)
  static check_size<sizeof(SessionSettingsDataModel), 56 + sizeof(float)> __VROSC_SessionSettingsDataModelSizeCheck;
  static_assert(sizeof(SessionSettingsDataModel) == 0x3C);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: VROSC::SessionSettingsDataModel::get_Key
// Il2CppName: get_Key
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::StringW (VROSC::SessionSettingsDataModel::*)()>(&VROSC::SessionSettingsDataModel::get_Key)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(VROSC::SessionSettingsDataModel*), "get_Key", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: VROSC::SessionSettingsDataModel::get_Version
// Il2CppName: get_Version
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<int (VROSC::SessionSettingsDataModel::*)()>(&VROSC::SessionSettingsDataModel::get_Version)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(VROSC::SessionSettingsDataModel*), "get_Version", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: VROSC::SessionSettingsDataModel::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
