// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: VROSC.SessionsLibraryUI
#include "VROSC/SessionsLibraryUI.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::VROSC::SessionsLibraryUI::SessionSaveData);
DEFINE_IL2CPP_ARG_TYPE(::VROSC::SessionsLibraryUI::SessionSaveData*, "VROSC", "SessionsLibraryUI/SessionSaveData");
// Type namespace: VROSC
namespace VROSC {
  // Size: 0x32
  #pragma pack(push, 1)
  // Autogenerated type: VROSC.SessionsLibraryUI/VROSC.SessionSaveData
  // [TokenAttribute] Offset: FFFFFFFF
  class SessionsLibraryUI::SessionSaveData : public ::Il2CppObject {
    public:
    public:
    // public System.String Id
    // Size: 0x8
    // Offset: 0x10
    ::StringW Id;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String DisplayName
    // Size: 0x8
    // Offset: 0x18
    ::StringW DisplayName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String Description
    // Size: 0x8
    // Offset: 0x20
    ::StringW Description;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String[] Tags
    // Size: 0x8
    // Offset: 0x28
    ::ArrayW<::StringW> Tags;
    // Field size check
    static_assert(sizeof(::ArrayW<::StringW>) == 0x8);
    // public System.Boolean IsCloud
    // Size: 0x1
    // Offset: 0x30
    bool IsCloud;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean IsShared
    // Size: 0x1
    // Offset: 0x31
    bool IsShared;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Get instance field reference: public System.String Id
    [[deprecated]] ::StringW& dyn_Id();
    // Get instance field reference: public System.String DisplayName
    [[deprecated]] ::StringW& dyn_DisplayName();
    // Get instance field reference: public System.String Description
    [[deprecated]] ::StringW& dyn_Description();
    // Get instance field reference: public System.String[] Tags
    [[deprecated]] ::ArrayW<::StringW>& dyn_Tags();
    // Get instance field reference: public System.Boolean IsCloud
    [[deprecated]] bool& dyn_IsCloud();
    // Get instance field reference: public System.Boolean IsShared
    [[deprecated]] bool& dyn_IsShared();
    // public System.Void .ctor()
    // Offset: 0x8D520C
    // Implemented from: System.Object
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static SessionsLibraryUI::SessionSaveData* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::VROSC::SessionsLibraryUI::SessionSaveData::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<SessionsLibraryUI::SessionSaveData*, creationType>()));
    }
  }; // VROSC.SessionsLibraryUI/VROSC.SessionSaveData
  #pragma pack(pop)
  static check_size<sizeof(SessionsLibraryUI::SessionSaveData), 49 + sizeof(bool)> __VROSC_SessionsLibraryUI_SessionSaveDataSizeCheck;
  static_assert(sizeof(SessionsLibraryUI::SessionSaveData) == 0x32);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: VROSC::SessionsLibraryUI::SessionSaveData::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
