// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: VROSC.FloatChanger
#include "VROSC/FloatChanger.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: VROSC
namespace VROSC {
  // Forward declaring type: FloatField
  class FloatField;
  // Forward declaring type: Signal
  class Signal;
}
// Completed forward declares
// Type namespace: VROSC
namespace VROSC {
  // Forward declaring type: SetFloat
  class SetFloat;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::VROSC::SetFloat);
DEFINE_IL2CPP_ARG_TYPE(::VROSC::SetFloat*, "VROSC", "SetFloat");
// Type namespace: VROSC
namespace VROSC {
  // Size: 0x70
  #pragma pack(push, 1)
  // Autogenerated type: VROSC.SetFloat
  // [TokenAttribute] Offset: FFFFFFFF
  class SetFloat : public ::VROSC::FloatChanger {
    public:
    // Writing base type padding for base size: 0x49 to desired offset: 0x50
    char ___base_padding[0x7] = {};
    public:
    // private VROSC.FloatField _setTo
    // Size: 0x8
    // Offset: 0x50
    ::VROSC::FloatField* setTo;
    // Field size check
    static_assert(sizeof(::VROSC::FloatField*) == 0x8);
    // private System.Boolean _useSignalValue
    // Size: 0x1
    // Offset: 0x58
    bool useSignalValue;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: useSignalValue and: minValue
    char __padding1[0x7] = {};
    // private VROSC.FloatField _minValue
    // Size: 0x8
    // Offset: 0x60
    ::VROSC::FloatField* minValue;
    // Field size check
    static_assert(sizeof(::VROSC::FloatField*) == 0x8);
    // private VROSC.FloatField _maxValue
    // Size: 0x8
    // Offset: 0x68
    ::VROSC::FloatField* maxValue;
    // Field size check
    static_assert(sizeof(::VROSC::FloatField*) == 0x8);
    public:
    // Get instance field reference: private VROSC.FloatField _setTo
    [[deprecated("Use field access instead!")]] ::VROSC::FloatField*& dyn__setTo();
    // Get instance field reference: private System.Boolean _useSignalValue
    [[deprecated("Use field access instead!")]] bool& dyn__useSignalValue();
    // Get instance field reference: private VROSC.FloatField _minValue
    [[deprecated("Use field access instead!")]] ::VROSC::FloatField*& dyn__minValue();
    // Get instance field reference: private VROSC.FloatField _maxValue
    [[deprecated("Use field access instead!")]] ::VROSC::FloatField*& dyn__maxValue();
    // public System.Void .ctor()
    // Offset: 0x19249F4
    // Implemented from: VROSC.FloatChanger
    // Base method: System.Void FloatChanger::.ctor()
    // Base method: System.Void SignalNode::.ctor()
    // Base method: System.Void Node::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static SetFloat* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::VROSC::SetFloat::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<SetFloat*, creationType>()));
    }
    // protected override System.Void SetValueBySignal(VROSC.Signal signal)
    // Offset: 0x192493C
    // Implemented from: VROSC.FloatChanger
    // Base method: System.Void FloatChanger::SetValueBySignal(VROSC.Signal signal)
    void SetValueBySignal(::VROSC::Signal* signal);
  }; // VROSC.SetFloat
  #pragma pack(pop)
  static check_size<sizeof(SetFloat), 104 + sizeof(::VROSC::FloatField*)> __VROSC_SetFloatSizeCheck;
  static_assert(sizeof(SetFloat) == 0x70);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: VROSC::SetFloat::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
// Writing MetadataGetter for method: VROSC::SetFloat::SetValueBySignal
// Il2CppName: SetValueBySignal
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::SetFloat::*)(::VROSC::Signal*)>(&VROSC::SetFloat::SetValueBySignal)> {
  static const MethodInfo* get() {
    static auto* signal = &::il2cpp_utils::GetClassFromName("VROSC", "Signal")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(VROSC::SetFloat*), "SetValueBySignal", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{signal});
  }
};
