// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: VROSC.SynthsDataController
#include "VROSC/SynthsDataController.hpp"
// Including type: VROSC.Error
#include "VROSC/Error.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: VROSC
namespace VROSC {
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action
  class Action;
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
}
// Completed forward declares
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::VROSC::SynthsDataController::$$c__DisplayClass6_0);
DEFINE_IL2CPP_ARG_TYPE(::VROSC::SynthsDataController::$$c__DisplayClass6_0*, "VROSC", "SynthsDataController/<>c__DisplayClass6_0");
// Type namespace: VROSC
namespace VROSC {
  // Size: 0x30
  #pragma pack(push, 1)
  // Autogenerated type: VROSC.SynthsDataController/VROSC.<>c__DisplayClass6_0
  // [TokenAttribute] Offset: FFFFFFFF
  // [CompilerGeneratedAttribute] Offset: FFFFFFFF
  class SynthsDataController::$$c__DisplayClass6_0 : public ::Il2CppObject {
    public:
    // Nested type: ::VROSC::SynthsDataController::$$c__DisplayClass6_0::$$LoadData$b__0$d
    struct $$LoadData$b__0$d;
    public:
    // public VROSC.SynthsDataController <>4__this
    // Size: 0x8
    // Offset: 0x10
    ::VROSC::SynthsDataController* $$4__this;
    // Field size check
    static_assert(sizeof(::VROSC::SynthsDataController*) == 0x8);
    // public System.String sessionId
    // Size: 0x8
    // Offset: 0x18
    ::StringW sessionId;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.Action onSuccess
    // Size: 0x8
    // Offset: 0x20
    ::System::Action* onSuccess;
    // Field size check
    static_assert(sizeof(::System::Action*) == 0x8);
    // public System.Action`1<VROSC.Error> onFailure
    // Size: 0x8
    // Offset: 0x28
    ::System::Action_1<::VROSC::Error>* onFailure;
    // Field size check
    static_assert(sizeof(::System::Action_1<::VROSC::Error>*) == 0x8);
    public:
    // Get instance field reference: public VROSC.SynthsDataController <>4__this
    [[deprecated("Use field access instead!")]] ::VROSC::SynthsDataController*& dyn_$$4__this();
    // Get instance field reference: public System.String sessionId
    [[deprecated("Use field access instead!")]] ::StringW& dyn_sessionId();
    // Get instance field reference: public System.Action onSuccess
    [[deprecated("Use field access instead!")]] ::System::Action*& dyn_onSuccess();
    // Get instance field reference: public System.Action`1<VROSC.Error> onFailure
    [[deprecated("Use field access instead!")]] ::System::Action_1<::VROSC::Error>*& dyn_onFailure();
    // public System.Void .ctor()
    // Offset: 0x8DAF54
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static SynthsDataController::$$c__DisplayClass6_0* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::VROSC::SynthsDataController::$$c__DisplayClass6_0::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<SynthsDataController::$$c__DisplayClass6_0*, creationType>()));
    }
    // System.Void <LoadData>b__0(System.String data)
    // Offset: 0x8DAF5C
    void $LoadData$b__0(::StringW data);
  }; // VROSC.SynthsDataController/VROSC.<>c__DisplayClass6_0
  #pragma pack(pop)
  static check_size<sizeof(SynthsDataController::$$c__DisplayClass6_0), 40 + sizeof(::System::Action_1<::VROSC::Error>*)> __VROSC_SynthsDataController_$$c__DisplayClass6_0SizeCheck;
  static_assert(sizeof(SynthsDataController::$$c__DisplayClass6_0) == 0x30);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: VROSC::SynthsDataController::$$c__DisplayClass6_0::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
// Writing MetadataGetter for method: VROSC::SynthsDataController::$$c__DisplayClass6_0::$LoadData$b__0
// Il2CppName: <LoadData>b__0
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::SynthsDataController::$$c__DisplayClass6_0::*)(::StringW)>(&VROSC::SynthsDataController::$$c__DisplayClass6_0::$LoadData$b__0)> {
  static const MethodInfo* get() {
    static auto* data = &::il2cpp_utils::GetClassFromName("System", "String")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(VROSC::SynthsDataController::$$c__DisplayClass6_0*), "<LoadData>b__0", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{data});
  }
};
