// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: VROSC
namespace VROSC {
  // Forward declaring type: ControllerInputNode
  class ControllerInputNode;
  // Forward declaring type: TransformMover
  class TransformMover;
  // Forward declaring type: InstrumentController
  class InstrumentController;
  // Forward declaring type: HandType
  struct HandType;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: ParticleSystem
  class ParticleSystem;
  // Forward declaring type: Material
  class Material;
}
// Completed forward declares
// Type namespace: VROSC
namespace VROSC {
  // Forward declaring type: ThereminParticles
  class ThereminParticles;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::VROSC::ThereminParticles);
DEFINE_IL2CPP_ARG_TYPE(::VROSC::ThereminParticles*, "VROSC", "ThereminParticles");
// Type namespace: VROSC
namespace VROSC {
  // Size: 0x58
  #pragma pack(push, 1)
  // Autogenerated type: VROSC.ThereminParticles
  // [TokenAttribute] Offset: FFFFFFFF
  class ThereminParticles : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::VROSC::ThereminParticles::Hand
    class Hand;
    public:
    // private UnityEngine.ParticleSystem _particles
    // Size: 0x8
    // Offset: 0x18
    ::UnityEngine::ParticleSystem* particles;
    // Field size check
    static_assert(sizeof(::UnityEngine::ParticleSystem*) == 0x8);
    // private VROSC.ControllerInputNode _input
    // Size: 0x8
    // Offset: 0x20
    ::VROSC::ControllerInputNode* input;
    // Field size check
    static_assert(sizeof(::VROSC::ControllerInputNode*) == 0x8);
    // private VROSC.TransformMover _scaling
    // Size: 0x8
    // Offset: 0x28
    ::VROSC::TransformMover* scaling;
    // Field size check
    static_assert(sizeof(::VROSC::TransformMover*) == 0x8);
    // private VROSC.InstrumentController _wavemin
    // Size: 0x8
    // Offset: 0x30
    ::VROSC::InstrumentController* wavemin;
    // Field size check
    static_assert(sizeof(::VROSC::InstrumentController*) == 0x8);
    // private VROSC.ThereminParticles/VROSC.Hand _leftHand
    // Size: 0x8
    // Offset: 0x38
    ::VROSC::ThereminParticles::Hand* leftHand;
    // Field size check
    static_assert(sizeof(::VROSC::ThereminParticles::Hand*) == 0x8);
    // private VROSC.ThereminParticles/VROSC.Hand _rightHand
    // Size: 0x8
    // Offset: 0x40
    ::VROSC::ThereminParticles::Hand* rightHand;
    // Field size check
    static_assert(sizeof(::VROSC::ThereminParticles::Hand*) == 0x8);
    // private System.Single _visualDistance
    // Size: 0x4
    // Offset: 0x48
    float visualDistance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: visualDistance and: material
    char __padding6[0x4] = {};
    // private UnityEngine.Material _material
    // Size: 0x8
    // Offset: 0x50
    ::UnityEngine::Material* material;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: private UnityEngine.ParticleSystem _particles
    [[deprecated]] ::UnityEngine::ParticleSystem*& dyn__particles();
    // Get instance field reference: private VROSC.ControllerInputNode _input
    [[deprecated]] ::VROSC::ControllerInputNode*& dyn__input();
    // Get instance field reference: private VROSC.TransformMover _scaling
    [[deprecated]] ::VROSC::TransformMover*& dyn__scaling();
    // Get instance field reference: private VROSC.InstrumentController _wavemin
    [[deprecated]] ::VROSC::InstrumentController*& dyn__wavemin();
    // Get instance field reference: private VROSC.ThereminParticles/VROSC.Hand _leftHand
    [[deprecated]] ::VROSC::ThereminParticles::Hand*& dyn__leftHand();
    // Get instance field reference: private VROSC.ThereminParticles/VROSC.Hand _rightHand
    [[deprecated]] ::VROSC::ThereminParticles::Hand*& dyn__rightHand();
    // Get instance field reference: private System.Single _visualDistance
    [[deprecated]] float& dyn__visualDistance();
    // Get instance field reference: private UnityEngine.Material _material
    [[deprecated]] ::UnityEngine::Material*& dyn__material();
    // protected System.Void Awake()
    // Offset: 0xA25D50
    void Awake();
    // protected System.Void OnDestroy()
    // Offset: 0xA25E88
    void OnDestroy();
    // private System.Void Start()
    // Offset: 0xA25FC0
    void Start();
    // private System.Void OnEnable()
    // Offset: 0xA2604C
    void OnEnable();
    // private System.Void OnDisable()
    // Offset: 0xA262A4
    void OnDisable();
    // private System.Void ScaleChanged(VROSC.TransformMover transformMover)
    // Offset: 0xA26378
    void ScaleChanged(::VROSC::TransformMover* transformMover);
    // private System.Void Update()
    // Offset: 0xA26414
    void Update();
    // private System.Void PlayStarted(VROSC.HandType handType, System.Object source)
    // Offset: 0xA26450
    void PlayStarted(::VROSC::HandType handType, ::Il2CppObject* source);
    // private System.Void PlayStopped(VROSC.HandType handType, System.Object source)
    // Offset: 0xA26498
    void PlayStopped(::VROSC::HandType handType, ::Il2CppObject* source);
    // private VROSC.ThereminParticles/VROSC.Hand GetHandByHandtype(VROSC.HandType handType)
    // Offset: 0xA26480
    ::VROSC::ThereminParticles::Hand* GetHandByHandtype(::VROSC::HandType handType);
    // public System.Void .ctor()
    // Offset: 0xA264C8
    // Implemented from: UnityEngine.MonoBehaviour
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static ThereminParticles* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::VROSC::ThereminParticles::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<ThereminParticles*, creationType>()));
    }
  }; // VROSC.ThereminParticles
  #pragma pack(pop)
  static check_size<sizeof(ThereminParticles), 80 + sizeof(::UnityEngine::Material*)> __VROSC_ThereminParticlesSizeCheck;
  static_assert(sizeof(ThereminParticles) == 0x58);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: VROSC::ThereminParticles::Awake
// Il2CppName: Awake
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::ThereminParticles::*)()>(&VROSC::ThereminParticles::Awake)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(VROSC::ThereminParticles*), "Awake", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: VROSC::ThereminParticles::OnDestroy
// Il2CppName: OnDestroy
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::ThereminParticles::*)()>(&VROSC::ThereminParticles::OnDestroy)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(VROSC::ThereminParticles*), "OnDestroy", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: VROSC::ThereminParticles::Start
// Il2CppName: Start
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::ThereminParticles::*)()>(&VROSC::ThereminParticles::Start)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(VROSC::ThereminParticles*), "Start", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: VROSC::ThereminParticles::OnEnable
// Il2CppName: OnEnable
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::ThereminParticles::*)()>(&VROSC::ThereminParticles::OnEnable)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(VROSC::ThereminParticles*), "OnEnable", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: VROSC::ThereminParticles::OnDisable
// Il2CppName: OnDisable
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::ThereminParticles::*)()>(&VROSC::ThereminParticles::OnDisable)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(VROSC::ThereminParticles*), "OnDisable", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: VROSC::ThereminParticles::ScaleChanged
// Il2CppName: ScaleChanged
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::ThereminParticles::*)(::VROSC::TransformMover*)>(&VROSC::ThereminParticles::ScaleChanged)> {
  static const MethodInfo* get() {
    static auto* transformMover = &::il2cpp_utils::GetClassFromName("VROSC", "TransformMover")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(VROSC::ThereminParticles*), "ScaleChanged", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{transformMover});
  }
};
// Writing MetadataGetter for method: VROSC::ThereminParticles::Update
// Il2CppName: Update
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::ThereminParticles::*)()>(&VROSC::ThereminParticles::Update)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(VROSC::ThereminParticles*), "Update", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: VROSC::ThereminParticles::PlayStarted
// Il2CppName: PlayStarted
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::ThereminParticles::*)(::VROSC::HandType, ::Il2CppObject*)>(&VROSC::ThereminParticles::PlayStarted)> {
  static const MethodInfo* get() {
    static auto* handType = &::il2cpp_utils::GetClassFromName("VROSC", "HandType")->byval_arg;
    static auto* source = &::il2cpp_utils::GetClassFromName("System", "Object")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(VROSC::ThereminParticles*), "PlayStarted", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{handType, source});
  }
};
// Writing MetadataGetter for method: VROSC::ThereminParticles::PlayStopped
// Il2CppName: PlayStopped
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::ThereminParticles::*)(::VROSC::HandType, ::Il2CppObject*)>(&VROSC::ThereminParticles::PlayStopped)> {
  static const MethodInfo* get() {
    static auto* handType = &::il2cpp_utils::GetClassFromName("VROSC", "HandType")->byval_arg;
    static auto* source = &::il2cpp_utils::GetClassFromName("System", "Object")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(VROSC::ThereminParticles*), "PlayStopped", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{handType, source});
  }
};
// Writing MetadataGetter for method: VROSC::ThereminParticles::GetHandByHandtype
// Il2CppName: GetHandByHandtype
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::VROSC::ThereminParticles::Hand* (VROSC::ThereminParticles::*)(::VROSC::HandType)>(&VROSC::ThereminParticles::GetHandByHandtype)> {
  static const MethodInfo* get() {
    static auto* handType = &::il2cpp_utils::GetClassFromName("VROSC", "HandType")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(VROSC::ThereminParticles*), "GetHandByHandtype", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{handType});
  }
};
// Writing MetadataGetter for method: VROSC::ThereminParticles::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
