// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include <initializer_list>
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: VROSC.IState
#include "VROSC/IState.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: VROSC
namespace VROSC {
}
// Forward declaring namespace: UnityEngine::Playables
namespace UnityEngine::Playables {
  // Forward declaring type: PlayableDirector
  class PlayableDirector;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action
  class Action;
  // Forward declaring type: Func`1<TResult>
  template<typename TResult>
  class Func_1;
}
// Completed forward declares
// Type namespace: VROSC
namespace VROSC {
  // Forward declaring type: TutorialStep
  class TutorialStep;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::VROSC::TutorialStep);
DEFINE_IL2CPP_ARG_TYPE(::VROSC::TutorialStep*, "VROSC", "TutorialStep");
// Type namespace: VROSC
namespace VROSC {
  // Size: 0x50
  #pragma pack(push, 1)
  // Autogenerated type: VROSC.TutorialStep
  // [TokenAttribute] Offset: FFFFFFFF
  class TutorialStep : public ::UnityEngine::MonoBehaviour/*, public ::VROSC::IState*/ {
    public:
    // Nested type: ::VROSC::TutorialStep::$$c
    class $$c;
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // protected UnityEngine.Playables.PlayableDirector _playableDirector
    // Size: 0x8
    // Offset: 0x18
    ::UnityEngine::Playables::PlayableDirector* playableDirector;
    // Field size check
    static_assert(sizeof(::UnityEngine::Playables::PlayableDirector*) == 0x8);
    // protected System.String _instructionText
    // Size: 0x8
    // Offset: 0x20
    ::StringW instructionText;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // protected System.String _tipText
    // Size: 0x8
    // Offset: 0x28
    ::StringW tipText;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Boolean _autoContinue
    // Size: 0x1
    // Offset: 0x30
    bool autoContinue;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected System.Boolean _isFinished
    // Size: 0x1
    // Offset: 0x31
    bool isFinished;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isFinished and: OnConditionsCompleted
    char __padding4[0x6] = {};
    // public System.Action OnConditionsCompleted
    // Size: 0x8
    // Offset: 0x38
    ::System::Action* OnConditionsCompleted;
    // Field size check
    static_assert(sizeof(::System::Action*) == 0x8);
    // private System.Boolean <IsCompleted>k__BackingField
    // Size: 0x1
    // Offset: 0x40
    bool IsCompleted;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _timelineReachedEnd
    // Size: 0x1
    // Offset: 0x41
    bool timelineReachedEnd;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _isReplayingAudio
    // Size: 0x1
    // Offset: 0x42
    bool isReplayingAudio;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isReplayingAudio and: OnTimelineReachedEnd
    char __padding8[0x5] = {};
    // public System.Action OnTimelineReachedEnd
    // Size: 0x8
    // Offset: 0x48
    ::System::Action* OnTimelineReachedEnd;
    // Field size check
    static_assert(sizeof(::System::Action*) == 0x8);
    public:
    // Creating interface conversion operator: operator ::VROSC::IState
    operator ::VROSC::IState() noexcept {
      return *reinterpret_cast<::VROSC::IState*>(this);
    }
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: protected UnityEngine.Playables.PlayableDirector _playableDirector
    ::UnityEngine::Playables::PlayableDirector*& dyn__playableDirector();
    // Get instance field reference: protected System.String _instructionText
    ::StringW& dyn__instructionText();
    // Get instance field reference: protected System.String _tipText
    ::StringW& dyn__tipText();
    // Get instance field reference: private System.Boolean _autoContinue
    bool& dyn__autoContinue();
    // Get instance field reference: protected System.Boolean _isFinished
    bool& dyn__isFinished();
    // Get instance field reference: public System.Action OnConditionsCompleted
    ::System::Action*& dyn_OnConditionsCompleted();
    // Get instance field reference: private System.Boolean <IsCompleted>k__BackingField
    bool& dyn_$IsCompleted$k__BackingField();
    // Get instance field reference: private System.Boolean _timelineReachedEnd
    bool& dyn__timelineReachedEnd();
    // Get instance field reference: private System.Boolean _isReplayingAudio
    bool& dyn__isReplayingAudio();
    // Get instance field reference: public System.Action OnTimelineReachedEnd
    ::System::Action*& dyn_OnTimelineReachedEnd();
    // public System.String get_InstructionText()
    // Offset: 0x1409DAC
    ::StringW get_InstructionText();
    // public System.String get_TipText()
    // Offset: 0x1409DB4
    ::StringW get_TipText();
    // public System.Boolean get_AutoContinue()
    // Offset: 0x1409DBC
    bool get_AutoContinue();
    // public System.Boolean get_IsCompleted()
    // Offset: 0x1409DC4
    bool get_IsCompleted();
    // private System.Void set_IsCompleted(System.Boolean value)
    // Offset: 0x1409DCC
    void set_IsCompleted(bool value);
    // public System.Func`1<System.Boolean> IsFinished()
    // Offset: 0x140843C
    ::System::Func_1<bool>* IsFinished();
    // public System.Void OnEnter(params System.Object[] values)
    // Offset: 0x1409DD8
    void OnEnter(::ArrayW<::Il2CppObject*> values);
    // public System.Void OnExit()
    // Offset: 0x140A064
    void OnExit();
    // public System.Void Tick()
    // Offset: 0x140A1B4
    void Tick();
    // public System.Void UpdateData(params System.Object[] values)
    // Offset: 0x140A270
    void UpdateData(::ArrayW<::Il2CppObject*> values);
    // public System.Void Replay()
    // Offset: 0x140A274
    void Replay();
    // public System.Void TimelineReachedEnd()
    // Offset: 0x140A520
    void TimelineReachedEnd();
    // public System.Void FinishStep()
    // Offset: 0x1409304
    void FinishStep();
    // public System.Void Stop()
    // Offset: 0x14091E4
    void Stop();
    // private System.Void OnAppPaused(System.Boolean paused)
    // Offset: 0x140A5CC
    void OnAppPaused(bool paused);
    // private System.Boolean <IsFinished>b__10_0()
    // Offset: 0x140A5FC
    bool $IsFinished$b__10_0();
    // private System.Void <OnEnter>b__20_0()
    // Offset: 0x140A604
    void $OnEnter$b__20_0();
    // private System.Void <OnEnter>b__20_1(UnityEngine.Playables.PlayableDirector director)
    // Offset: 0x140A610
    void $OnEnter$b__20_1(::UnityEngine::Playables::PlayableDirector* director);
    // public System.Void .ctor()
    // Offset: 0x140A5F4
    // Implemented from: UnityEngine.MonoBehaviour
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static TutorialStep* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::VROSC::TutorialStep::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<TutorialStep*, creationType>()));
    }
  }; // VROSC.TutorialStep
  #pragma pack(pop)
  static check_size<sizeof(TutorialStep), 72 + sizeof(::System::Action*)> __VROSC_TutorialStepSizeCheck;
  static_assert(sizeof(TutorialStep) == 0x50);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: VROSC::TutorialStep::get_InstructionText
// Il2CppName: get_InstructionText
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::StringW (VROSC::TutorialStep::*)()>(&VROSC::TutorialStep::get_InstructionText)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(VROSC::TutorialStep*), "get_InstructionText", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: VROSC::TutorialStep::get_TipText
// Il2CppName: get_TipText
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::StringW (VROSC::TutorialStep::*)()>(&VROSC::TutorialStep::get_TipText)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(VROSC::TutorialStep*), "get_TipText", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: VROSC::TutorialStep::get_AutoContinue
// Il2CppName: get_AutoContinue
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<bool (VROSC::TutorialStep::*)()>(&VROSC::TutorialStep::get_AutoContinue)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(VROSC::TutorialStep*), "get_AutoContinue", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: VROSC::TutorialStep::get_IsCompleted
// Il2CppName: get_IsCompleted
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<bool (VROSC::TutorialStep::*)()>(&VROSC::TutorialStep::get_IsCompleted)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(VROSC::TutorialStep*), "get_IsCompleted", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: VROSC::TutorialStep::set_IsCompleted
// Il2CppName: set_IsCompleted
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::TutorialStep::*)(bool)>(&VROSC::TutorialStep::set_IsCompleted)> {
  static const MethodInfo* get() {
    static auto* value = &::il2cpp_utils::GetClassFromName("System", "Boolean")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(VROSC::TutorialStep*), "set_IsCompleted", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{value});
  }
};
// Writing MetadataGetter for method: VROSC::TutorialStep::IsFinished
// Il2CppName: IsFinished
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::System::Func_1<bool>* (VROSC::TutorialStep::*)()>(&VROSC::TutorialStep::IsFinished)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(VROSC::TutorialStep*), "IsFinished", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: VROSC::TutorialStep::OnEnter
// Il2CppName: OnEnter
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::TutorialStep::*)(::ArrayW<::Il2CppObject*>)>(&VROSC::TutorialStep::OnEnter)> {
  static const MethodInfo* get() {
    static auto* values = &il2cpp_functions::array_class_get(::il2cpp_utils::GetClassFromName("System", "Object"), 1)->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(VROSC::TutorialStep*), "OnEnter", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{values});
  }
};
// Writing MetadataGetter for method: VROSC::TutorialStep::OnExit
// Il2CppName: OnExit
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::TutorialStep::*)()>(&VROSC::TutorialStep::OnExit)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(VROSC::TutorialStep*), "OnExit", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: VROSC::TutorialStep::Tick
// Il2CppName: Tick
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::TutorialStep::*)()>(&VROSC::TutorialStep::Tick)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(VROSC::TutorialStep*), "Tick", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: VROSC::TutorialStep::UpdateData
// Il2CppName: UpdateData
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::TutorialStep::*)(::ArrayW<::Il2CppObject*>)>(&VROSC::TutorialStep::UpdateData)> {
  static const MethodInfo* get() {
    static auto* values = &il2cpp_functions::array_class_get(::il2cpp_utils::GetClassFromName("System", "Object"), 1)->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(VROSC::TutorialStep*), "UpdateData", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{values});
  }
};
// Writing MetadataGetter for method: VROSC::TutorialStep::Replay
// Il2CppName: Replay
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::TutorialStep::*)()>(&VROSC::TutorialStep::Replay)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(VROSC::TutorialStep*), "Replay", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: VROSC::TutorialStep::TimelineReachedEnd
// Il2CppName: TimelineReachedEnd
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::TutorialStep::*)()>(&VROSC::TutorialStep::TimelineReachedEnd)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(VROSC::TutorialStep*), "TimelineReachedEnd", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: VROSC::TutorialStep::FinishStep
// Il2CppName: FinishStep
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::TutorialStep::*)()>(&VROSC::TutorialStep::FinishStep)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(VROSC::TutorialStep*), "FinishStep", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: VROSC::TutorialStep::Stop
// Il2CppName: Stop
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::TutorialStep::*)()>(&VROSC::TutorialStep::Stop)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(VROSC::TutorialStep*), "Stop", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: VROSC::TutorialStep::OnAppPaused
// Il2CppName: OnAppPaused
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::TutorialStep::*)(bool)>(&VROSC::TutorialStep::OnAppPaused)> {
  static const MethodInfo* get() {
    static auto* paused = &::il2cpp_utils::GetClassFromName("System", "Boolean")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(VROSC::TutorialStep*), "OnAppPaused", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{paused});
  }
};
// Writing MetadataGetter for method: VROSC::TutorialStep::$IsFinished$b__10_0
// Il2CppName: <IsFinished>b__10_0
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<bool (VROSC::TutorialStep::*)()>(&VROSC::TutorialStep::$IsFinished$b__10_0)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(VROSC::TutorialStep*), "<IsFinished>b__10_0", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: VROSC::TutorialStep::$OnEnter$b__20_0
// Il2CppName: <OnEnter>b__20_0
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::TutorialStep::*)()>(&VROSC::TutorialStep::$OnEnter$b__20_0)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(VROSC::TutorialStep*), "<OnEnter>b__20_0", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: VROSC::TutorialStep::$OnEnter$b__20_1
// Il2CppName: <OnEnter>b__20_1
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::TutorialStep::*)(::UnityEngine::Playables::PlayableDirector*)>(&VROSC::TutorialStep::$OnEnter$b__20_1)> {
  static const MethodInfo* get() {
    static auto* director = &::il2cpp_utils::GetClassFromName("UnityEngine.Playables", "PlayableDirector")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(VROSC::TutorialStep*), "<OnEnter>b__20_1", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{director});
  }
};
// Writing MetadataGetter for method: VROSC::TutorialStep::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
