// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: VROSC
namespace VROSC {
  // Forward declaring type: UIScrollableItem
  class UIScrollableItem;
  // Forward declaring type: UIScrollableContainerInput
  class UIScrollableContainerInput;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
  // Skipping declaration: Vector3 because it is already included!
  // Forward declaring type: GameObject
  class GameObject;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Completed forward declares
// Type namespace: VROSC
namespace VROSC {
  // Forward declaring type: UIScrollableContainer
  class UIScrollableContainer;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::VROSC::UIScrollableContainer);
DEFINE_IL2CPP_ARG_TYPE(::VROSC::UIScrollableContainer*, "VROSC", "UIScrollableContainer");
// Type namespace: VROSC
namespace VROSC {
  // Size: 0x69
  #pragma pack(push, 1)
  // Autogenerated type: VROSC.UIScrollableContainer
  // [TokenAttribute] Offset: FFFFFFFF
  class UIScrollableContainer : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::VROSC::UIScrollableContainer::$MoveBar$d__48
    class $MoveBar$d__48;
    public:
    // private UnityEngine.Transform _itemsContainer
    // Size: 0x8
    // Offset: 0x18
    ::UnityEngine::Transform* itemsContainer;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private VROSC.UIScrollableItem _scrollableItemPrefab
    // Size: 0x8
    // Offset: 0x20
    ::VROSC::UIScrollableItem* scrollableItemPrefab;
    // Field size check
    static_assert(sizeof(::VROSC::UIScrollableItem*) == 0x8);
    // private System.Single _length
    // Size: 0x4
    // Offset: 0x28
    float length;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean _isHorizontal
    // Size: 0x1
    // Offset: 0x2C
    bool isHorizontal;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _invert
    // Size: 0x1
    // Offset: 0x2D
    bool invert;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: invert and: padding
    char __padding4[0x2] = {};
    // private System.Single _padding
    // Size: 0x4
    // Offset: 0x30
    float padding;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // protected System.Int32 _defaultSelection
    // Size: 0x4
    // Offset: 0x34
    int defaultSelection;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean _supportsMultipleSelection
    // Size: 0x1
    // Offset: 0x38
    bool supportsMultipleSelection;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _supportsNoSelection
    // Size: 0x1
    // Offset: 0x39
    bool supportsNoSelection;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: supportsNoSelection and: selectionInput
    char __padding8[0x6] = {};
    // private VROSC.UIScrollableContainerInput _selectionInput
    // Size: 0x8
    // Offset: 0x40
    ::VROSC::UIScrollableContainerInput* selectionInput;
    // Field size check
    static_assert(sizeof(::VROSC::UIScrollableContainerInput*) == 0x8);
    // private System.Int32 <SelectedItemIndex>k__BackingField
    // Size: 0x4
    // Offset: 0x48
    int SelectedItemIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: SelectedItemIndex and: Items
    char __padding10[0x4] = {};
    // private System.Collections.Generic.List`1<VROSC.UIScrollableItem> <Items>k__BackingField
    // Size: 0x8
    // Offset: 0x50
    ::System::Collections::Generic::List_1<::VROSC::UIScrollableItem*>* Items;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::VROSC::UIScrollableItem*>*) == 0x8);
    // public System.Action`1<VROSC.UIScrollableItem> OnItemSelected
    // Size: 0x8
    // Offset: 0x58
    ::System::Action_1<::VROSC::UIScrollableItem*>* OnItemSelected;
    // Field size check
    static_assert(sizeof(::System::Action_1<::VROSC::UIScrollableItem*>*) == 0x8);
    // public System.Action`1<VROSC.UIScrollableItem> OnItemDeselected
    // Size: 0x8
    // Offset: 0x60
    ::System::Action_1<::VROSC::UIScrollableItem*>* OnItemDeselected;
    // Field size check
    static_assert(sizeof(::System::Action_1<::VROSC::UIScrollableItem*>*) == 0x8);
    // protected System.Boolean _valuesSet
    // Size: 0x1
    // Offset: 0x68
    bool valuesSet;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: private UnityEngine.Transform _itemsContainer
    [[deprecated("Use field access instead!")]] ::UnityEngine::Transform*& dyn__itemsContainer();
    // Get instance field reference: private VROSC.UIScrollableItem _scrollableItemPrefab
    [[deprecated("Use field access instead!")]] ::VROSC::UIScrollableItem*& dyn__scrollableItemPrefab();
    // Get instance field reference: private System.Single _length
    [[deprecated("Use field access instead!")]] float& dyn__length();
    // Get instance field reference: private System.Boolean _isHorizontal
    [[deprecated("Use field access instead!")]] bool& dyn__isHorizontal();
    // Get instance field reference: private System.Boolean _invert
