// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: VROSC.UserUpVotesDataModel
#include "VROSC/UserUpVotesDataModel.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::VROSC::UserUpVotesDataModel::UpVote);
DEFINE_IL2CPP_ARG_TYPE(::VROSC::UserUpVotesDataModel::UpVote*, "VROSC", "UserUpVotesDataModel/UpVote");
// Type namespace: VROSC
namespace VROSC {
  // Size: 0x30
  #pragma pack(push, 1)
  // Autogenerated type: VROSC.UserUpVotesDataModel/VROSC.UpVote
  // [TokenAttribute] Offset: FFFFFFFF
  class UserUpVotesDataModel::UpVote : public ::Il2CppObject {
    public:
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // public System.String Id
    // Size: 0x8
    // Offset: 0x10
    ::StringW Id;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String SessionId
    // Size: 0x8
    // Offset: 0x18
    ::StringW SessionId;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String SessionUpVoteId
    // Size: 0x8
    // Offset: 0x20
    ::StringW SessionUpVoteId;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String Date
    // Size: 0x8
    // Offset: 0x28
    ::StringW Date;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    public:
    // Get instance field reference: public System.String Id
    ::StringW& dyn_Id();
    // Get instance field reference: public System.String SessionId
    ::StringW& dyn_SessionId();
    // Get instance field reference: public System.String SessionUpVoteId
    ::StringW& dyn_SessionUpVoteId();
    // Get instance field reference: public System.String Date
    ::StringW& dyn_Date();
    // public System.Void .ctor()
    // Offset: 0x1416D60
    // Implemented from: System.Object
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static UserUpVotesDataModel::UpVote* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::VROSC::UserUpVotesDataModel::UpVote::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<UserUpVotesDataModel::UpVote*, creationType>()));
    }
  }; // VROSC.UserUpVotesDataModel/VROSC.UpVote
  #pragma pack(pop)
  static check_size<sizeof(UserUpVotesDataModel::UpVote), 40 + sizeof(::StringW)> __VROSC_UserUpVotesDataModel_UpVoteSizeCheck;
  static_assert(sizeof(UserUpVotesDataModel::UpVote) == 0x30);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: VROSC::UserUpVotesDataModel::UpVote::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
