// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: VROSC.UserFavoritesDataModel
#include "VROSC/UserFavoritesDataModel.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: VROSC
namespace VROSC {
  // Forward declaring type: Session
  class Session;
}
// Completed forward declares
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::VROSC::UserFavoritesDataModel::Favorite);
DEFINE_IL2CPP_ARG_TYPE(::VROSC::UserFavoritesDataModel::Favorite*, "VROSC", "UserFavoritesDataModel/Favorite");
// Type namespace: VROSC
namespace VROSC {
  // Size: 0x38
  #pragma pack(push, 1)
  // Autogenerated type: VROSC.UserFavoritesDataModel/VROSC.Favorite
  // [TokenAttribute] Offset: FFFFFFFF
  class UserFavoritesDataModel::Favorite : public ::Il2CppObject {
    public:
    public:
    // public System.String Id
    // Size: 0x8
    // Offset: 0x10
    ::StringW Id;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String SessionId
    // Size: 0x8
    // Offset: 0x18
    ::StringW SessionId;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String SessionFavoriteId
    // Size: 0x8
    // Offset: 0x20
    ::StringW SessionFavoriteId;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String Date
    // Size: 0x8
    // Offset: 0x28
    ::StringW Date;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public VROSC.Session Session
    // Size: 0x8
    // Offset: 0x30
    ::VROSC::Session* Session;
    // Field size check
    static_assert(sizeof(::VROSC::Session*) == 0x8);
    public:
    // Get instance field reference: public System.String Id
    [[deprecated("Use field access instead!")]] ::StringW& dyn_Id();
    // Get instance field reference: public System.String SessionId
    [[deprecated("Use field access instead!")]] ::StringW& dyn_SessionId();
    // Get instance field reference: public System.String SessionFavoriteId
    [[deprecated("Use field access instead!")]] ::StringW& dyn_SessionFavoriteId();
    // Get instance field reference: public System.String Date
    [[deprecated("Use field access instead!")]] ::StringW& dyn_Date();
    // Get instance field reference: public VROSC.Session Session
    [[deprecated("Use field access instead!")]] ::VROSC::Session*& dyn_Session();
    // public System.Void .ctor()
    // Offset: 0xE874B4
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static UserFavoritesDataModel::Favorite* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::VROSC::UserFavoritesDataModel::Favorite::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<UserFavoritesDataModel::Favorite*, creationType>()));
    }
  }; // VROSC.UserFavoritesDataModel/VROSC.Favorite
  #pragma pack(pop)
  static check_size<sizeof(UserFavoritesDataModel::Favorite), 48 + sizeof(::VROSC::Session*)> __VROSC_UserFavoritesDataModel_FavoriteSizeCheck;
  static_assert(sizeof(UserFavoritesDataModel::Favorite) == 0x38);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: VROSC::UserFavoritesDataModel::Favorite::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
