// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: VROSC.WidgetSettings/VROSC.Identifier
#include "VROSC/WidgetSettings.hpp"
// Including type: VROSC.Error
#include "VROSC/Error.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: VROSC
namespace VROSC {
  // Forward declaring type: SessionsManager
  class SessionsManager;
  // Forward declaring type: InstrumentDataController
  class InstrumentDataController;
  // Forward declaring type: UserProfileDataController
  class UserProfileDataController;
  // Forward declaring type: UserPreferencesDataController
  class UserPreferencesDataController;
  // Forward declaring type: UserFavoritesDataController
  class UserFavoritesDataController;
  // Forward declaring type: UserUpVotesDataController
  class UserUpVotesDataController;
  // Forward declaring type: LoopStationDataController
  class LoopStationDataController;
  // Forward declaring type: TapeRecorderDataController
  class TapeRecorderDataController;
  // Forward declaring type: SessionSettingsDataController
  class SessionSettingsDataController;
  // Forward declaring type: SynthsDataController
  class SynthsDataController;
  // Forward declaring type: ModularDrumsDataController
  class ModularDrumsDataController;
  // Forward declaring type: MicrophoneDataController
  class MicrophoneDataController;
  // Forward declaring type: SaveLoadManager
  class SaveLoadManager;
  // Skipping declaration: WidgetSettings because it is already included!
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
  // Forward declaring type: Action`2<T1, T2>
  template<typename T1, typename T2>
  class Action_2;
  // Forward declaring type: Action
  class Action;
}
// Completed forward declares
// Type namespace: VROSC
namespace VROSC {
  // Forward declaring type: UserDataControllers
  class UserDataControllers;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::VROSC::UserDataControllers);
DEFINE_IL2CPP_ARG_TYPE(::VROSC::UserDataControllers*, "VROSC", "UserDataControllers");
// Type namespace: VROSC
namespace VROSC {
  // Size: 0x88
  #pragma pack(push, 1)
  // Autogenerated type: VROSC.UserDataControllers
  // [TokenAttribute] Offset: FFFFFFFF
  class UserDataControllers : public ::Il2CppObject {
    public:
    // Nested type: ::VROSC::UserDataControllers::$$c__DisplayClass64_0
    class $$c__DisplayClass64_0;
    // Nested type: ::VROSC::UserDataControllers::$$c
    class $$c;
    // Nested type: ::VROSC::UserDataControllers::$$c__DisplayClass67_0
    class $$c__DisplayClass67_0;
    // Nested type: ::VROSC::UserDataControllers::$$c__DisplayClass67_1
    class $$c__DisplayClass67_1;
    // Nested type: ::VROSC::UserDataControllers::$LoadControllers$d__67
    struct $LoadControllers$d__67;
    // Nested type: ::VROSC::UserDataControllers::$$c__DisplayClass68_0
    class $$c__DisplayClass68_0;
    // Nested type: ::VROSC::UserDataControllers::$$c__DisplayClass68_1
    class $$c__DisplayClass68_1;
    // Nested type: ::VROSC::UserDataControllers::$SaveControllers$d__68
    struct $SaveControllers$d__68;
    public:
    // private System.Int32 _loadSaveStepsFinished
    // Size: 0x4
    // Offset: 0x10
    int loadSaveStepsFinished;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _loadSaveTotalSteps
    // Size: 0x4
    // Offset: 0x14
    int loadSaveTotalSteps;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.String _loadSaveSessionId
    // Size: 0x8
    // Offset: 0x18
    ::StringW loadSaveSessionId;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Boolean <IsLocalDataLoaded>k__BackingField
    // Size: 0x1
    // Offset: 0x20
    bool IsLocalDataLoaded;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean <IsCloudDataLoaded>k__BackingField
    // Size: 0x1
    // Offset: 0x21
    bool IsCloudDataLoaded;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: IsCloudDataLoaded and: SessionsManager
    char __padding4[0x6] = {};
    // private VROSC.SessionsManager <SessionsManager>k__BackingField
    // Size: 0x8
    // Offset: 0x28
    ::VROSC::SessionsManager* SessionsManager;
    // Field size check
    static_assert(sizeof(::VROSC::SessionsManager*) == 0x8);
    // private System.Collections.Generic.Dictionary`2<VROSC.WidgetSettings/VROSC.Identifier,VROSC.InstrumentDataController> _instrumentsDataControllers
    // Size: 0x8
    // Offset: 0x30
    ::System::Collections::Generic::Dictionary_2<::VROSC::WidgetSettings::Identifier, ::VROSC::InstrumentDataController*>* instrumentsDataControllers;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::VROSC::WidgetSettings::Identifier, ::VROSC::InstrumentDataController*>*) == 0x8);
    // private VROSC.UserProfileDataController <UserProfileDataController>k__BackingField
    // Size: 0x8
    // Offset: 0x38
    ::VROSC::UserProfileDataController* UserProfileDataController;
    // Field size check
    static_assert(sizeof(::VROSC::UserProfileDataController*) == 0x8);
    // private VROSC.UserPreferencesDataController <UserPreferencesDataController>k__BackingField
    // Size: 0x8
    // Offset: 0x40
    ::VROSC::UserPreferencesDataController* UserPreferencesDataController;
    // Field size check
    static_assert(sizeof(::VROSC::UserPreferencesDataController*) == 0x8);
    // private VROSC.UserFavoritesDataController <UserFavoritesDataController>k__BackingField
    // Size: 0x8
    // Offset: 0x48
    ::VROSC::UserFavoritesDataController* UserFavoritesDataController;
    // Field size check
    static_assert(sizeof(::VROSC::UserFavoritesDataController*) == 0x8);
    // private VROSC.UserUpVotesDataController <UserUpVotesDataController>k__BackingField
    // Size: 0x8
    // Offset: 0x50
    ::VROSC::UserUpVotesDataController* UserUpVotesDataController;
    // Field size check
    static_assert(sizeof(::VROSC::UserUpVotesDataController*) == 0x8);
    // private VROSC.LoopStationDataController <LoopStationDataController>k__BackingField
    // Size: 0x8
    // Offset: 0x58
    ::VROSC::LoopStationDataController* LoopStationDataController;
    // Field size check
    static_assert(sizeof(::VROSC::LoopStationDataController*) == 0x8);
    // private VROSC.TapeRecorderDataController <TapeRecorderDataController>k__BackingField
    // Size: 0x8
    // Offset: 0x60
    ::VROSC::TapeRecorderDataController* TapeRecorderDataController;
    // Field size check
    static_assert(sizeof(::VROSC::TapeRecorderDataController*) == 0x8);
    // private VROSC.SessionSettingsDataController <SessionSettingsDataController>k__BackingField
    // Size: 0x8
    // Offset: 0x68
    ::VROSC::SessionSettingsDataController* SessionSettingsDataController;
    // Field size check
    static_assert(sizeof(::VROSC::SessionSettingsDataController*) == 0x8);
    // private VROSC.SynthsDataController <SynthsDataController>k__BackingField
    // Size: 0x8
    // Offset: 0x70
    ::VROSC::SynthsDataController* SynthsDataController;
    // Field size check
    static_assert(sizeof(::VROSC::SynthsDataController*) == 0x8);
    // private VROSC.ModularDrumsDataController <ModularDrumsDataController>k__BackingField
    // Size: 0x8
    // Offset: 0x78
    ::VROSC::ModularDrumsDataController* ModularDrumsDataController;
    // Field size check
    static_assert(sizeof(::VROSC::ModularDrumsDataController*) == 0x8);
    // private VROSC.MicrophoneDataController <MicrophoneDataController>k__BackingField
    // Size: 0x8
    // Offset: 0x80
    ::VROSC::MicrophoneDataController* MicrophoneDataController;
    // Field size check
    static_assert(sizeof(::VROSC::MicrophoneDataController*) == 0x8);
    public:
    // Get static field: static public System.Action`1<VROSC.UserDataControllers> OnControllersDataLoaded
    static ::System::Action_1<::VROSC::UserDataControllers*>* _get_OnControllersDataLoaded();
    // Set static field: static public System.Action`1<VROSC.UserDataControllers> OnControllersDataLoaded
    static void _set_OnControllersDataLoaded(::System::Action_1<::VROSC::UserDataControllers*>* value);
    // Get static field: static public System.Action`1<VROSC.UserDataControllers> OnPreferencesDataLoaded
    static ::System::Action_1<::VROSC::UserDataControllers*>* _get_OnPreferencesDataLoaded();
    // Set static field: static public System.Action`1<VROSC.UserDataControllers> OnPreferencesDataLoaded
