// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: TMPro
namespace TMPro {
  // Forward declaring type: TextMeshPro
  class TextMeshPro;
}
// Forward declaring namespace: VROSC
namespace VROSC {
  // Forward declaring type: UIButton
  class UIButton;
  // Forward declaring type: SessionsLibraryUI
  class SessionsLibraryUI;
}
// Completed forward declares
// Type namespace: VROSC
namespace VROSC {
  // Forward declaring type: UserProfilePopup
  class UserProfilePopup;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::VROSC::UserProfilePopup);
DEFINE_IL2CPP_ARG_TYPE(::VROSC::UserProfilePopup*, "VROSC", "UserProfilePopup");
// Type namespace: VROSC
namespace VROSC {
  // Size: 0x50
  #pragma pack(push, 1)
  // Autogenerated type: VROSC.UserProfilePopup
  // [TokenAttribute] Offset: FFFFFFFF
  class UserProfilePopup : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // private TMPro.TextMeshPro _usernameText
    // Size: 0x8
    // Offset: 0x18
    ::TMPro::TextMeshPro* usernameText;
    // Field size check
    static_assert(sizeof(::TMPro::TextMeshPro*) == 0x8);
    // private TMPro.TextMeshPro _emailText
    // Size: 0x8
    // Offset: 0x20
    ::TMPro::TextMeshPro* emailText;
    // Field size check
    static_assert(sizeof(::TMPro::TextMeshPro*) == 0x8);
    // private VROSC.UIButton _changeEmailButton
    // Size: 0x8
    // Offset: 0x28
    ::VROSC::UIButton* changeEmailButton;
    // Field size check
    static_assert(sizeof(::VROSC::UIButton*) == 0x8);
    // private VROSC.UIButton _changePasswordButton
    // Size: 0x8
    // Offset: 0x30
    ::VROSC::UIButton* changePasswordButton;
    // Field size check
    static_assert(sizeof(::VROSC::UIButton*) == 0x8);
    // private VROSC.UIButton _logoutButton
    // Size: 0x8
    // Offset: 0x38
    ::VROSC::UIButton* logoutButton;
    // Field size check
    static_assert(sizeof(::VROSC::UIButton*) == 0x8);
    // private VROSC.UIButton _deleteDataButton
    // Size: 0x8
    // Offset: 0x40
    ::VROSC::UIButton* deleteDataButton;
    // Field size check
    static_assert(sizeof(::VROSC::UIButton*) == 0x8);
    // private VROSC.SessionsLibraryUI _sessionsLibraryUI
    // Size: 0x8
    // Offset: 0x48
    ::VROSC::SessionsLibraryUI* sessionsLibraryUI;
    // Field size check
    static_assert(sizeof(::VROSC::SessionsLibraryUI*) == 0x8);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: private TMPro.TextMeshPro _usernameText
    [[deprecated]] ::TMPro::TextMeshPro*& dyn__usernameText();
    // Get instance field reference: private TMPro.TextMeshPro _emailText
    [[deprecated]] ::TMPro::TextMeshPro*& dyn__emailText();
    // Get instance field reference: private VROSC.UIButton _changeEmailButton
    [[deprecated]] ::VROSC::UIButton*& dyn__changeEmailButton();
    // Get instance field reference: private VROSC.UIButton _changePasswordButton
    [[deprecated]] ::VROSC::UIButton*& dyn__changePasswordButton();
    // Get instance field reference: private VROSC.UIButton _logoutButton
    [[deprecated]] ::VROSC::UIButton*& dyn__logoutButton();
    // Get instance field reference: private VROSC.UIButton _deleteDataButton
    [[deprecated]] ::VROSC::UIButton*& dyn__deleteDataButton();
    // Get instance field reference: private VROSC.SessionsLibraryUI _sessionsLibraryUI
    [[deprecated]] ::VROSC::SessionsLibraryUI*& dyn__sessionsLibraryUI();
    // private System.Void Awake()
    // Offset: 0x191FAF0
    void Awake();
    // private System.Void OnDestroy()
    // Offset: 0x191FE10
    void OnDestroy();
    // public System.Void Setup(VROSC.SessionsLibraryUI sessionsLibraryUI)
    // Offset: 0x1920110
    void Setup(::VROSC::SessionsLibraryUI* sessionsLibraryUI);
    // private System.Void OnEnable()
    // Offset: 0x1920118
    void OnEnable();
    // private System.Void PopulateData()
    // Offset: 0x1920194
    void PopulateData();
    // private System.Void ClearData()
    // Offset: 0x19202C0
    void ClearData();
    // private System.Void ChangeEmailButtonPressed()
    // Offset: 0x192039C
    void ChangeEmailButtonPressed();
    // private System.Void ChangePasswordButtonPressed()
    // Offset: 0x19203B8
    void ChangePasswordButtonPressed();
    // private System.Void LogoutButtonPressed()
    // Offset: 0x19203D4
    void LogoutButtonPressed();
    // private System.Void UserLoggedIn(System.String email, System.Boolean isVerified)
    // Offset: 0x192042C
    void UserLoggedIn(::StringW email, bool isVerified);
    // private System.Void UserLoggedOut()
    // Offset: 0x1920430
    void UserLoggedOut();
    // private System.Void UserEmailChanged()
    // Offset: 0x1920434
    void UserEmailChanged();
    // public System.Void .ctor()
    // Offset: 0x19204AC
    // Implemented from: UnityEngine.MonoBehaviour
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static UserProfilePopup* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::VROSC::UserProfilePopup::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<UserProfilePopup*, creationType>()));
    }
  }; // VROSC.UserProfilePopup
  #pragma pack(pop)
  static check_size<sizeof(UserProfilePopup), 72 + sizeof(::VROSC::SessionsLibraryUI*)> __VROSC_UserProfilePopupSizeCheck;
  static_assert(sizeof(UserProfilePopup) == 0x50);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: VROSC::UserProfilePopup::Awake
// Il2CppName: Awake
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::UserProfilePopup::*)()>(&VROSC::UserProfilePopup::Awake)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(VROSC::UserProfilePopup*), "Awake", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: VROSC::UserProfilePopup::OnDestroy
// Il2CppName: OnDestroy
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::UserProfilePopup::*)()>(&VROSC::UserProfilePopup::OnDestroy)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(VROSC::UserProfilePopup*), "OnDestroy", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: VROSC::UserProfilePopup::Setup
// Il2CppName: Setup
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::UserProfilePopup::*)(::VROSC::SessionsLibraryUI*)>(&VROSC::UserProfilePopup::Setup)> {
  static const MethodInfo* get() {
    static auto* sessionsLibraryUI = &::il2cpp_utils::GetClassFromName("VROSC", "SessionsLibraryUI")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(VROSC::UserProfilePopup*), "Setup", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{sessionsLibraryUI});
  }
};
// Writing MetadataGetter for method: VROSC::UserProfilePopup::OnEnable
// Il2CppName: OnEnable
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::UserProfilePopup::*)()>(&VROSC::UserProfilePopup::OnEnable)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(VROSC::UserProfilePopup*), "OnEnable", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: VROSC::UserProfilePopup::PopulateData
// Il2CppName: PopulateData
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::UserProfilePopup::*)()>(&VROSC::UserProfilePopup::PopulateData)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(VROSC::UserProfilePopup*), "PopulateData", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: VROSC::UserProfilePopup::ClearData
// Il2CppName: ClearData
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::UserProfilePopup::*)()>(&VROSC::UserProfilePopup::ClearData)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(VROSC::UserProfilePopup*), "ClearData", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: VROSC::UserProfilePopup::ChangeEmailButtonPressed
// Il2CppName: ChangeEmailButtonPressed
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::UserProfilePopup::*)()>(&VROSC::UserProfilePopup::ChangeEmailButtonPressed)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(VROSC::UserProfilePopup*), "ChangeEmailButtonPressed", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: VROSC::UserProfilePopup::ChangePasswordButtonPressed
// Il2CppName: ChangePasswordButtonPressed
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::UserProfilePopup::*)()>(&VROSC::UserProfilePopup::ChangePasswordButtonPressed)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(VROSC::UserProfilePopup*), "ChangePasswordButtonPressed", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: VROSC::UserProfilePopup::LogoutButtonPressed
// Il2CppName: LogoutButtonPressed
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::UserProfilePopup::*)()>(&VROSC::UserProfilePopup::LogoutButtonPressed)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(VROSC::UserProfilePopup*), "LogoutButtonPressed", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: VROSC::UserProfilePopup::UserLoggedIn
// Il2CppName: UserLoggedIn
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::UserProfilePopup::*)(::StringW, bool)>(&VROSC::UserProfilePopup::UserLoggedIn)> {
  static const MethodInfo* get() {
    static auto* email = &::il2cpp_utils::GetClassFromName("System", "String")->byval_arg;
    static auto* isVerified = &::il2cpp_utils::GetClassFromName("System", "Boolean")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(VROSC::UserProfilePopup*), "UserLoggedIn", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{email, isVerified});
  }
};
// Writing MetadataGetter for method: VROSC::UserProfilePopup::UserLoggedOut
// Il2CppName: UserLoggedOut
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::UserProfilePopup::*)()>(&VROSC::UserProfilePopup::UserLoggedOut)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(VROSC::UserProfilePopup*), "UserLoggedOut", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: VROSC::UserProfilePopup::UserEmailChanged
// Il2CppName: UserEmailChanged
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::UserProfilePopup::*)()>(&VROSC::UserProfilePopup::UserEmailChanged)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(VROSC::UserProfilePopup*), "UserEmailChanged", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: VROSC::UserProfilePopup::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
