// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.ScriptableObject
#include "UnityEngine/ScriptableObject.hpp"
// Including type: UnityEngine.Vector2
#include "UnityEngine/Vector2.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: VROSC::UI::Meshes
namespace VROSC::UI::Meshes {
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Mesh
  class Mesh;
  // Forward declaring type: Rect
  struct Rect;
}
// Forward declaring namespace: VROSC
namespace VROSC {
  // Forward declaring type: MinMaxFloat
  class MinMaxFloat;
}
// Completed forward declares
// Type namespace: VROSC.UI.Meshes
namespace VROSC::UI::Meshes {
  // Forward declaring type: AdjustableMeshData
  class AdjustableMeshData;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::VROSC::UI::Meshes::AdjustableMeshData);
DEFINE_IL2CPP_ARG_TYPE(::VROSC::UI::Meshes::AdjustableMeshData*, "VROSC.UI.Meshes", "AdjustableMeshData");
// Type namespace: VROSC.UI.Meshes
namespace VROSC::UI::Meshes {
  // Size: 0x59
  #pragma pack(push, 1)
  // Autogenerated type: VROSC.UI.Meshes.AdjustableMeshData
  // [TokenAttribute] Offset: FFFFFFFF
  // [CreateAssetMenuAttribute] Offset: 781614
  class AdjustableMeshData : public ::UnityEngine::ScriptableObject {
    public:
    // Nested type: ::VROSC::UI::Meshes::AdjustableMeshData::VertexData
    class VertexData;
    // Nested type: ::VROSC::UI::Meshes::AdjustableMeshData::$$c
    class $$c;
    public:
    // private UnityEngine.Mesh _mesh
    // Size: 0x8
    // Offset: 0x18
    ::UnityEngine::Mesh* mesh;
    // Field size check
    static_assert(sizeof(::UnityEngine::Mesh*) == 0x8);
    // private VROSC.UI.Meshes.AdjustableMeshData _childOf
    // Size: 0x8
    // Offset: 0x20
    ::VROSC::UI::Meshes::AdjustableMeshData* childOf;
    // Field size check
    static_assert(sizeof(::VROSC::UI::Meshes::AdjustableMeshData*) == 0x8);
    // private System.Single _height
    // Size: 0x4
    // Offset: 0x28
    float height;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _width
    // Size: 0x4
    // Offset: 0x2C
    float width;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Vector2 _center
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::Vector2 center;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // private System.Boolean _flipX
    // Size: 0x1
    // Offset: 0x38
    bool flipX;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _flipY
    // Size: 0x1
    // Offset: 0x39
    bool flipY;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _simple
    // Size: 0x1
    // Offset: 0x3A
    bool simple;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: simple and: data
    char __padding7[0x5] = {};
    // private VROSC.UI.Meshes.AdjustableMeshData/VROSC.UI.Meshes.VertexData[] _data
    // Size: 0x8
    // Offset: 0x40
    ::ArrayW<::VROSC::UI::Meshes::AdjustableMeshData::VertexData*> data;
    // Field size check
    static_assert(sizeof(::ArrayW<::VROSC::UI::Meshes::AdjustableMeshData::VertexData*>) == 0x8);
    // private VROSC.MinMaxFloat _x
    // Size: 0x8
    // Offset: 0x48
    ::VROSC::MinMaxFloat* x;
    // Field size check
    static_assert(sizeof(::VROSC::MinMaxFloat*) == 0x8);
    // private VROSC.MinMaxFloat _y
    // Size: 0x8
    // Offset: 0x50
    ::VROSC::MinMaxFloat* y;
    // Field size check
    static_assert(sizeof(::VROSC::MinMaxFloat*) == 0x8);
    // private System.Boolean _analyzed
    // Size: 0x1
    // Offset: 0x58
    bool analyzed;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: private UnityEngine.Mesh _mesh
    [[deprecated("Use field access instead!")]] ::UnityEngine::Mesh*& dyn__mesh();
    // Get instance field reference: private VROSC.UI.Meshes.AdjustableMeshData _childOf
    [[deprecated("Use field access instead!")]] ::VROSC::UI::Meshes::AdjustableMeshData*& dyn__childOf();
    // Get instance field reference: private System.Single _height
    [[deprecated("Use field access instead!")]] float& dyn__height();
    // Get instance field reference: private System.Single _width
    [[deprecated("Use field access instead!")]] float& dyn__width();
    // Get instance field reference: private UnityEngine.Vector2 _center
    [[deprecated("Use field access instead!")]] ::UnityEngine::Vector2& dyn__center();
    // Get instance field reference: private System.Boolean _flipX
    [[deprecated("Use field access instead!")]] bool& dyn__flipX();
    // Get instance field reference: private System.Boolean _flipY
    [[deprecated("Use field access instead!")]] bool& dyn__flipY();
    // Get instance field reference: private System.Boolean _simple
    [[deprecated("Use field access instead!")]] bool& dyn__simple();
    // Get instance field reference: private VROSC.UI.Meshes.AdjustableMeshData/VROSC.UI.Meshes.VertexData[] _data
    [[deprecated("Use field access instead!")]] ::ArrayW<::VROSC::UI::Meshes::AdjustableMeshData::VertexData*>& dyn__data();
    // Get instance field reference: private VROSC.MinMaxFloat _x
    [[deprecated("Use field access instead!")]] ::VROSC::MinMaxFloat*& dyn__x();
    // Get instance field reference: private VROSC.MinMaxFloat _y
    [[deprecated("Use field access instead!")]] ::VROSC::MinMaxFloat*& dyn__y();
    // Get instance field reference: private System.Boolean _analyzed
    [[deprecated("Use field access instead!")]] bool& dyn__analyzed();
    // public System.Boolean get_Analyzed()
    // Offset: 0x967628
    bool get_Analyzed();
    // public UnityEngine.Mesh get_Mesh()
    // Offset: 0x967630
    ::UnityEngine::Mesh* get_Mesh();
    // public System.Single get_Width()
    // Offset: 0x967638
    float get_Width();
    // public System.Single get_Height()
    // Offset: 0x967640
    float get_Height();
    // public System.Void .ctor()
    // Offset: 0x9680AC
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static AdjustableMeshData* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::VROSC::UI::Meshes::AdjustableMeshData::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<AdjustableMeshData*, creationType>()));
    }
    // public System.Void GetScaledMesh(UnityEngine.Vector3[] positions, System.Single targetWidth, System.Single targetHeight)
    // Offset: 0x967648
    void GetScaledMesh(::ArrayW<::UnityEngine::Vector3> positions, float targetWidth, float targetHeight);
    // public System.Void GetScaledMesh(UnityEngine.Vector3[] positions, UnityEngine.Rect rect)
    // Offset: 0x967734
    void GetScaledMesh(::ArrayW<::UnityEngine::Vector3> positions, ::UnityEngine::Rect rect);
    // public System.Void Analyze()
    // Offset: 0x9678C8
    void Analyze();
    // private System.Void GetDimensions()
    // Offset: 0x967A80
    void GetDimensions();
    // private UnityEngine.Vector2 GetScaling(System.Int32 i, VROSC.MinMaxFloat x, VROSC.MinMaxFloat y)
    // Offset: 0x967F50
    ::UnityEngine::Vector2 GetScaling(int i, ::VROSC::MinMaxFloat* x, ::VROSC::MinMaxFloat* y);
  }; // VROSC.UI.Meshes.AdjustableMeshData
  #pragma pack(pop)
  static check_size<sizeof(AdjustableMeshData), 88 + sizeof(bool)> __VROSC_UI_Meshes_AdjustableMeshDataSizeCheck;
  static_assert(sizeof(AdjustableMeshData) == 0x59);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: VROSC::UI::Meshes::AdjustableMeshData::get_Analyzed
// Il2CppName: get_Analyzed
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<bool (VROSC::UI::Meshes::AdjustableMeshData::*)()>(&VROSC::UI::Meshes::AdjustableMeshData::get_Analyzed)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(VROSC::UI::Meshes::AdjustableMeshData*), "get_Analyzed", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: VROSC::UI::Meshes::AdjustableMeshData::get_Mesh
// Il2CppName: get_Mesh
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::UnityEngine::Mesh* (VROSC::UI::Meshes::AdjustableMeshData::*)()>(&VROSC::UI::Meshes::AdjustableMeshData::get_Mesh)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(VROSC::UI::Meshes::AdjustableMeshData*), "get_Mesh", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: VROSC::UI::Meshes::AdjustableMeshData::get_Width
// Il2CppName: get_Width
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<float (VROSC::UI::Meshes::AdjustableMeshData::*)()>(&VROSC::UI::Meshes::AdjustableMeshData::get_Width)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(VROSC::UI::Meshes::AdjustableMeshData*), "get_Width", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: VROSC::UI::Meshes::AdjustableMeshData::get_Height
// Il2CppName: get_Height
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<float (VROSC::UI::Meshes::AdjustableMeshData::*)()>(&VROSC::UI::Meshes::AdjustableMeshData::get_Height)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(VROSC::UI::Meshes::AdjustableMeshData*), "get_Height", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: VROSC::UI::Meshes::AdjustableMeshData::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
// Writing MetadataGetter for method: VROSC::UI::Meshes::AdjustableMeshData::GetScaledMesh
// Il2CppName: GetScaledMesh
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::UI::Meshes::AdjustableMeshData::*)(::ArrayW<::UnityEngine::Vector3>, float, float)>(&VROSC::UI::Meshes::AdjustableMeshData::GetScaledMesh)> {
  static const MethodInfo* get() {
    static auto* positions = &il2cpp_functions::array_class_get(::il2cpp_utils::GetClassFromName("UnityEngine", "Vector3"), 1)->byval_arg;
    static auto* targetWidth = &::il2cpp_utils::GetClassFromName("System", "Single")->byval_arg;
    static auto* targetHeight = &::il2cpp_utils::GetClassFromName("System", "Single")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(VROSC::UI::Meshes::AdjustableMeshData*), "GetScaledMesh", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{positions, targetWidth, targetHeight});
  }
};
// Writing MetadataGetter for method: VROSC::UI::Meshes::AdjustableMeshData::GetScaledMesh
// Il2CppName: GetScaledMesh
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::UI::Meshes::AdjustableMeshData::*)(::ArrayW<::UnityEngine::Vector3>, ::UnityEngine::Rect)>(&VROSC::UI::Meshes::AdjustableMeshData::GetScaledMesh)> {
  static const MethodInfo* get() {
    static auto* positions = &il2cpp_functions::array_class_get(::il2cpp_utils::GetClassFromName("UnityEngine", "Vector3"), 1)->byval_arg;
    static auto* rect = &::il2cpp_utils::GetClassFromName("UnityEngine", "Rect")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(VROSC::UI::Meshes::AdjustableMeshData*), "GetScaledMesh", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{positions, rect});
  }
};
// Writing MetadataGetter for method: VROSC::UI::Meshes::AdjustableMeshData::Analyze
// Il2CppName: Analyze
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::UI::Meshes::AdjustableMeshData::*)()>(&VROSC::UI::Meshes::AdjustableMeshData::Analyze)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(VROSC::UI::Meshes::AdjustableMeshData*), "Analyze", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: VROSC::UI::Meshes::AdjustableMeshData::GetDimensions
// Il2CppName: GetDimensions
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::UI::Meshes::AdjustableMeshData::*)()>(&VROSC::UI::Meshes::AdjustableMeshData::GetDimensions)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(VROSC::UI::Meshes::AdjustableMeshData*), "GetDimensions", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: VROSC::UI::Meshes::AdjustableMeshData::GetScaling
// Il2CppName: GetScaling
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::UnityEngine::Vector2 (VROSC::UI::Meshes::AdjustableMeshData::*)(int, ::VROSC::MinMaxFloat*, ::VROSC::MinMaxFloat*)>(&VROSC::UI::Meshes::AdjustableMeshData::GetScaling)> {
  static const MethodInfo* get() {
    static auto* i = &::il2cpp_utils::GetClassFromName("System", "Int32")->byval_arg;
    static auto* x = &::il2cpp_utils::GetClassFromName("VROSC", "MinMaxFloat")->byval_arg;
    static auto* y = &::il2cpp_utils::GetClassFromName("VROSC", "MinMaxFloat")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(VROSC::UI::Meshes::AdjustableMeshData*), "GetScaling", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{i, x, y});
  }
};
