// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.IDisposable
#include "System/IDisposable.hpp"
// Including type: System.Runtime.InteropServices.HandleRef
#include "System/Runtime/InteropServices/HandleRef.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Firebase::Auth
namespace Firebase::Auth {
  // Forward declaring type: FirebaseUser
  class FirebaseUser;
}
// Forward declaring namespace: Firebase
namespace Firebase {
  // Forward declaring type: FirebaseApp
  class FirebaseApp;
  // Forward declaring type: InitResult
  struct InitResult;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: EventHandler
  class EventHandler;
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
  // Forward declaring type: EventArgs
  class EventArgs;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Forward declaring namespace: System::Threading::Tasks
namespace System::Threading::Tasks {
  // Forward declaring type: Task`1<TResult>
  template<typename TResult>
  class Task_1;
  // Forward declaring type: TaskCompletionSource`1<TResult>
  template<typename TResult>
  class TaskCompletionSource_1;
  // Forward declaring type: Task
  class Task;
}
// Completed forward declares
// Type namespace: Firebase.Auth
namespace Firebase::Auth {
  // Forward declaring type: FirebaseAuth
  class FirebaseAuth;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Firebase::Auth::FirebaseAuth);
DEFINE_IL2CPP_ARG_TYPE(::Firebase::Auth::FirebaseAuth*, "Firebase.Auth", "FirebaseAuth");
// Type namespace: Firebase.Auth
namespace Firebase::Auth {
  // Size: 0x61
  #pragma pack(push, 1)
  // Autogenerated type: Firebase.Auth.FirebaseAuth
  // [TokenAttribute] Offset: FFFFFFFF
  class FirebaseAuth : public ::Il2CppObject/*, public ::System::IDisposable*/ {
    public:
    // Nested type: ::Firebase::Auth::FirebaseAuth::StateChangedDelegate
    class StateChangedDelegate;
    // Nested type: ::Firebase::Auth::FirebaseAuth::$GetAuth$c__AnonStorey1
    class $GetAuth$c__AnonStorey1;
    // Nested type: ::Firebase::Auth::FirebaseAuth::$GetAuth$c__AnonStorey2
    class $GetAuth$c__AnonStorey2;
    // Nested type: ::Firebase::Auth::FirebaseAuth::$ForwardStateChange$c__AnonStorey3
    class $ForwardStateChange$c__AnonStorey3;
    // Nested type: ::Firebase::Auth::FirebaseAuth::$ForwardStateChange$c__AnonStorey4
    class $ForwardStateChange$c__AnonStorey4;
    // Nested type: ::Firebase::Auth::FirebaseAuth::$SignInWithEmailAndPasswordAsync$c__AnonStoreyA
    class $SignInWithEmailAndPasswordAsync$c__AnonStoreyA;
    // Nested type: ::Firebase::Auth::FirebaseAuth::$CreateUserWithEmailAndPasswordAsync$c__AnonStoreyB
    class $CreateUserWithEmailAndPasswordAsync$c__AnonStoreyB;
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // private System.Runtime.InteropServices.HandleRef swigCPtr
    // Size: 0x10
    // Offset: 0x10
    ::System::Runtime::InteropServices::HandleRef swigCPtr;
    // Field size check
    static_assert(sizeof(::System::Runtime::InteropServices::HandleRef) == 0x10);
    // private System.Boolean swigCMemOwn
    // Size: 0x1
    // Offset: 0x20
    bool swigCMemOwn;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: swigCMemOwn and: appProxy
    char __padding1[0x7] = {};
    // private Firebase.FirebaseApp appProxy
    // Size: 0x8
    // Offset: 0x28
    ::Firebase::FirebaseApp* appProxy;
    // Field size check
    static_assert(sizeof(::Firebase::FirebaseApp*) == 0x8);
    // private System.IntPtr appCPtr
    // Size: 0x8
    // Offset: 0x30
    ::System::IntPtr appCPtr;
    // Field size check
    static_assert(sizeof(::System::IntPtr) == 0x8);
    // private System.IntPtr authStateListener
    // Size: 0x8
    // Offset: 0x38
    ::System::IntPtr authStateListener;
    // Field size check
    static_assert(sizeof(::System::IntPtr) == 0x8);
    // private System.IntPtr idTokenListener
    // Size: 0x8
    // Offset: 0x40
    ::System::IntPtr idTokenListener;
    // Field size check
    static_assert(sizeof(::System::IntPtr) == 0x8);
    // private Firebase.Auth.FirebaseUser currentUser
    // Size: 0x8
    // Offset: 0x48
    ::Firebase::Auth::FirebaseUser* currentUser;
    // Field size check
    static_assert(sizeof(::Firebase::Auth::FirebaseUser*) == 0x8);
    // private System.EventHandler stateChangedImpl
    // Size: 0x8
    // Offset: 0x50
    ::System::EventHandler* stateChangedImpl;
    // Field size check
    static_assert(sizeof(::System::EventHandler*) == 0x8);
    // private System.EventHandler idTokenChangedImpl
    // Size: 0x8
    // Offset: 0x58
    ::System::EventHandler* idTokenChangedImpl;
    // Field size check
    static_assert(sizeof(::System::EventHandler*) == 0x8);
    // private System.Boolean persistentLoaded
    // Size: 0x1
    // Offset: 0x60
    bool persistentLoaded;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Creating interface conversion operator: operator ::System::IDisposable
    operator ::System::IDisposable() noexcept {
      return *reinterpret_cast<::System::IDisposable*>(this);
    }
    // Get static field: static private System.Collections.Generic.Dictionary`2<System.IntPtr,Firebase.Auth.FirebaseAuth> appCPtrToAuth
    static ::System::Collections::Generic::Dictionary_2<::System::IntPtr, ::Firebase::Auth::FirebaseAuth*>* _get_appCPtrToAuth();
    // Set static field: static private System.Collections.Generic.Dictionary`2<System.IntPtr,Firebase.Auth.FirebaseAuth> appCPtrToAuth
    static void _set_appCPtrToAuth(::System::Collections::Generic::Dictionary_2<::System::IntPtr, ::Firebase::Auth::FirebaseAuth*>* value);
    // Get static field: static private Firebase.Auth.FirebaseAuth/Firebase.Auth.StateChangedDelegate <>f__mg$cache0
