// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::EventSystems
namespace UnityEngine::EventSystems {
  // Forward declaring type: EventSystem
  class EventSystem;
}
// Forward declaring namespace: Oculus::Platform::Samples::VrBoardGame
namespace Oculus::Platform::Samples::VrBoardGame {
  // Forward declaring type: GameController
  class GameController;
  // Forward declaring type: GamePiece
  class GamePiece;
  // Forward declaring type: BoardPosition
  class BoardPosition;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: SphereCollider
  class SphereCollider;
}
// Forward declaring namespace: UnityEngine::UI
namespace UnityEngine::UI {
  // Forward declaring type: Button
  class Button;
}
// Completed forward declares
// Type namespace: Oculus.Platform.Samples.VrBoardGame
namespace Oculus::Platform::Samples::VrBoardGame {
  // Forward declaring type: EyeCamera
  class EyeCamera;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Oculus::Platform::Samples::VrBoardGame::EyeCamera);
DEFINE_IL2CPP_ARG_TYPE(::Oculus::Platform::Samples::VrBoardGame::EyeCamera*, "Oculus.Platform.Samples.VrBoardGame", "EyeCamera");
// Type namespace: Oculus.Platform.Samples.VrBoardGame
namespace Oculus::Platform::Samples::VrBoardGame {
  // Size: 0x48
  #pragma pack(push, 1)
  // Autogenerated type: Oculus.Platform.Samples.VrBoardGame.EyeCamera
  // [TokenAttribute] Offset: FFFFFFFF
  class EyeCamera : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // private UnityEngine.EventSystems.EventSystem m_eventSystem
    // Size: 0x8
    // Offset: 0x18
    ::UnityEngine::EventSystems::EventSystem* m_eventSystem;
    // Field size check
    static_assert(sizeof(::UnityEngine::EventSystems::EventSystem*) == 0x8);
    // private Oculus.Platform.Samples.VrBoardGame.GameController m_gameController
    // Size: 0x8
    // Offset: 0x20
    ::Oculus::Platform::Samples::VrBoardGame::GameController* m_gameController;
    // Field size check
    static_assert(sizeof(::Oculus::Platform::Samples::VrBoardGame::GameController*) == 0x8);
    // private UnityEngine.SphereCollider m_gazeTracker
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::SphereCollider* m_gazeTracker;
    // Field size check
    static_assert(sizeof(::UnityEngine::SphereCollider*) == 0x8);
    // private UnityEngine.UI.Button m_currentButton
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::UI::Button* m_currentButton;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Button*) == 0x8);
    // private Oculus.Platform.Samples.VrBoardGame.GamePiece m_currentPiece
    // Size: 0x8
    // Offset: 0x38
    ::Oculus::Platform::Samples::VrBoardGame::GamePiece* m_currentPiece;
    // Field size check
    static_assert(sizeof(::Oculus::Platform::Samples::VrBoardGame::GamePiece*) == 0x8);
    // private Oculus.Platform.Samples.VrBoardGame.BoardPosition m_boardPosition
    // Size: 0x8
    // Offset: 0x40
    ::Oculus::Platform::Samples::VrBoardGame::BoardPosition* m_boardPosition;
    // Field size check
    static_assert(sizeof(::Oculus::Platform::Samples::VrBoardGame::BoardPosition*) == 0x8);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: private UnityEngine.EventSystems.EventSystem m_eventSystem
    [[deprecated]] ::UnityEngine::EventSystems::EventSystem*& dyn_m_eventSystem();
    // Get instance field reference: private Oculus.Platform.Samples.VrBoardGame.GameController m_gameController
    [[deprecated]] ::Oculus::Platform::Samples::VrBoardGame::GameController*& dyn_m_gameController();
    // Get instance field reference: private UnityEngine.SphereCollider m_gazeTracker
    [[deprecated]] ::UnityEngine::SphereCollider*& dyn_m_gazeTracker();
    // Get instance field reference: private UnityEngine.UI.Button m_currentButton
    [[deprecated]] ::UnityEngine::UI::Button*& dyn_m_currentButton();
    // Get instance field reference: private Oculus.Platform.Samples.VrBoardGame.GamePiece m_currentPiece
    [[deprecated]] ::Oculus::Platform::Samples::VrBoardGame::GamePiece*& dyn_m_currentPiece();
    // Get instance field reference: private Oculus.Platform.Samples.VrBoardGame.BoardPosition m_boardPosition
    [[deprecated]] ::Oculus::Platform::Samples::VrBoardGame::BoardPosition*& dyn_m_boardPosition();
    // private System.Void Update()
    // Offset: 0x92E69C
    void Update();
    // public System.Void .ctor()
    // Offset: 0x92EF78
    // Implemented from: UnityEngine.MonoBehaviour
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static EyeCamera* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::Oculus::Platform::Samples::VrBoardGame::EyeCamera::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<EyeCamera*, creationType>()));
    }
  }; // Oculus.Platform.Samples.VrBoardGame.EyeCamera
  #pragma pack(pop)
  static check_size<sizeof(EyeCamera), 64 + sizeof(::Oculus::Platform::Samples::VrBoardGame::BoardPosition*)> __Oculus_Platform_Samples_VrBoardGame_EyeCameraSizeCheck;
  static_assert(sizeof(EyeCamera) == 0x48);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: Oculus::Platform::Samples::VrBoardGame::EyeCamera::Update
// Il2CppName: Update
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Oculus::Platform::Samples::VrBoardGame::EyeCamera::*)()>(&Oculus::Platform::Samples::VrBoardGame::EyeCamera::Update)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Oculus::Platform::Samples::VrBoardGame::EyeCamera*), "Update", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Oculus::Platform::Samples::VrBoardGame::EyeCamera::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
