// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
// Including type: Oculus.Platform.Samples.VrBoardGame.GamePiece
#include "Oculus/Platform/Samples/VrBoardGame/GamePiece.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Oculus::Platform::Samples::VrBoardGame
namespace Oculus::Platform::Samples::VrBoardGame {
  // Skipping declaration: GameState because it is already included!
  // Forward declaring type: MatchmakingManager
  class MatchmakingManager;
  // Forward declaring type: GameBoard
  class GameBoard;
  // Forward declaring type: BoardPosition
  class BoardPosition;
}
// Forward declaring namespace: UnityEngine::UI
namespace UnityEngine::UI {
  // Forward declaring type: Text
  class Text;
}
// Completed forward declares
// Type namespace: Oculus.Platform.Samples.VrBoardGame
namespace Oculus::Platform::Samples::VrBoardGame {
  // Forward declaring type: GameController
  class GameController;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Oculus::Platform::Samples::VrBoardGame::GameController);
DEFINE_IL2CPP_ARG_TYPE(::Oculus::Platform::Samples::VrBoardGame::GameController*, "Oculus.Platform.Samples.VrBoardGame", "GameController");
// Type namespace: Oculus.Platform.Samples.VrBoardGame
namespace Oculus::Platform::Samples::VrBoardGame {
  // Size: 0xC8
  #pragma pack(push, 1)
  // Autogenerated type: Oculus.Platform.Samples.VrBoardGame.GameController
  // [TokenAttribute] Offset: FFFFFFFF
  class GameController : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::Oculus::Platform::Samples::VrBoardGame::GameController::GameState
    struct GameState;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: Oculus.Platform.Samples.VrBoardGame.GameController/Oculus.Platform.Samples.VrBoardGame.GameState
    // [TokenAttribute] Offset: FFFFFFFF
    struct GameState/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: GameState
      constexpr GameState(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public Oculus.Platform.Samples.VrBoardGame.GameController/Oculus.Platform.Samples.VrBoardGame.GameState None
      static constexpr const int None = 0;
      // Get static field: static public Oculus.Platform.Samples.VrBoardGame.GameController/Oculus.Platform.Samples.VrBoardGame.GameState None
      static ::Oculus::Platform::Samples::VrBoardGame::GameController::GameState _get_None();
      // Set static field: static public Oculus.Platform.Samples.VrBoardGame.GameController/Oculus.Platform.Samples.VrBoardGame.GameState None
      static void _set_None(::Oculus::Platform::Samples::VrBoardGame::GameController::GameState value);
      // static field const value: static public Oculus.Platform.Samples.VrBoardGame.GameController/Oculus.Platform.Samples.VrBoardGame.GameState PracticingMyTurn
      static constexpr const int PracticingMyTurn = 1;
      // Get static field: static public Oculus.Platform.Samples.VrBoardGame.GameController/Oculus.Platform.Samples.VrBoardGame.GameState PracticingMyTurn
      static ::Oculus::Platform::Samples::VrBoardGame::GameController::GameState _get_PracticingMyTurn();
      // Set static field: static public Oculus.Platform.Samples.VrBoardGame.GameController/Oculus.Platform.Samples.VrBoardGame.GameState PracticingMyTurn
      static void _set_PracticingMyTurn(::Oculus::Platform::Samples::VrBoardGame::GameController::GameState value);
      // static field const value: static public Oculus.Platform.Samples.VrBoardGame.GameController/Oculus.Platform.Samples.VrBoardGame.GameState PracticingAiTurn
      static constexpr const int PracticingAiTurn = 2;
      // Get static field: static public Oculus.Platform.Samples.VrBoardGame.GameController/Oculus.Platform.Samples.VrBoardGame.GameState PracticingAiTurn
      static ::Oculus::Platform::Samples::VrBoardGame::GameController::GameState _get_PracticingAiTurn();
      // Set static field: static public Oculus.Platform.Samples.VrBoardGame.GameController/Oculus.Platform.Samples.VrBoardGame.GameState PracticingAiTurn
      static void _set_PracticingAiTurn(::Oculus::Platform::Samples::VrBoardGame::GameController::GameState value);
      // static field const value: static public Oculus.Platform.Samples.VrBoardGame.GameController/Oculus.Platform.Samples.VrBoardGame.GameState OnlineMatchMyTurn
      static constexpr const int OnlineMatchMyTurn = 3;
      // Get static field: static public Oculus.Platform.Samples.VrBoardGame.GameController/Oculus.Platform.Samples.VrBoardGame.GameState OnlineMatchMyTurn
      static ::Oculus::Platform::Samples::VrBoardGame::GameController::GameState _get_OnlineMatchMyTurn();
      // Set static field: static public Oculus.Platform.Samples.VrBoardGame.GameController/Oculus.Platform.Samples.VrBoardGame.GameState OnlineMatchMyTurn
      static void _set_OnlineMatchMyTurn(::Oculus::Platform::Samples::VrBoardGame::GameController::GameState value);
      // static field const value: static public Oculus.Platform.Samples.VrBoardGame.GameController/Oculus.Platform.Samples.VrBoardGame.GameState OnlineMatchRemoteTurn
      static constexpr const int OnlineMatchRemoteTurn = 4;
      // Get static field: static public Oculus.Platform.Samples.VrBoardGame.GameController/Oculus.Platform.Samples.VrBoardGame.GameState OnlineMatchRemoteTurn
      static ::Oculus::Platform::Samples::VrBoardGame::GameController::GameState _get_OnlineMatchRemoteTurn();
      // Set static field: static public Oculus.Platform.Samples.VrBoardGame.GameController/Oculus.Platform.Samples.VrBoardGame.GameState OnlineMatchRemoteTurn
      static void _set_OnlineMatchRemoteTurn(::Oculus::Platform::Samples::VrBoardGame::GameController::GameState value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated]] int& dyn_value__();
    }; // Oculus.Platform.Samples.VrBoardGame.GameController/Oculus.Platform.Samples.VrBoardGame.GameState
    #pragma pack(pop)
    static check_size<sizeof(GameController::GameState), 0 + sizeof(int)> __Oculus_Platform_Samples_VrBoardGame_GameController_GameStateSizeCheck;
    static_assert(sizeof(GameController::GameState) == 0x4);
    public:
    // private Oculus.Platform.Samples.VrBoardGame.MatchmakingManager m_matchmaking
    // Size: 0x8
    // Offset: 0x18
    ::Oculus::Platform::Samples::VrBoardGame::MatchmakingManager* m_matchmaking;
    // Field size check
    static_assert(sizeof(::Oculus::Platform::Samples::VrBoardGame::MatchmakingManager*) == 0x8);
    // private Oculus.Platform.Samples.VrBoardGame.GameBoard m_board
    // Size: 0x8
    // Offset: 0x20
    ::Oculus::Platform::Samples::VrBoardGame::GameBoard* m_board;
    // Field size check
    static_assert(sizeof(::Oculus::Platform::Samples::VrBoardGame::GameBoard*) == 0x8);
    // private Oculus.Platform.Samples.VrBoardGame.GamePiece m_pieceA
    // Size: 0x8
    // Offset: 0x28
    ::Oculus::Platform::Samples::VrBoardGame::GamePiece* m_pieceA;
    // Field size check
    static_assert(sizeof(::Oculus::Platform::Samples::VrBoardGame::GamePiece*) == 0x8);
    // private Oculus.Platform.Samples.VrBoardGame.GamePiece m_pieceB
    // Size: 0x8
    // Offset: 0x30
    ::Oculus::Platform::Samples::VrBoardGame::GamePiece* m_pieceB;
    // Field size check
    static_assert(sizeof(::Oculus::Platform::Samples::VrBoardGame::GamePiece*) == 0x8);
    // private Oculus.Platform.Samples.VrBoardGame.GamePiece m_powerPiece
    // Size: 0x8
    // Offset: 0x38
    ::Oculus::Platform::Samples::VrBoardGame::GamePiece* m_powerPiece;
    // Field size check
    static_assert(sizeof(::Oculus::Platform::Samples::VrBoardGame::GamePiece*) == 0x8);
    // private UnityEngine.Color m_unusableColor
    // Size: 0x10
    // Offset: 0x40
    ::UnityEngine::Color m_unusableColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private UnityEngine.Color m_unselectedColor
    // Size: 0x10
    // Offset: 0x50
    ::UnityEngine::Color m_unselectedColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private UnityEngine.Color m_selectedColor
    // Size: 0x10
    // Offset: 0x60
    ::UnityEngine::Color m_selectedColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private UnityEngine.Color m_highlightedColor
    // Size: 0x10
    // Offset: 0x70
    ::UnityEngine::Color m_highlightedColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private UnityEngine.UI.Text m_ballCountText
    // Size: 0x8
    // Offset: 0x80
    ::UnityEngine::UI::Text* m_ballCountText;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Text*) == 0x8);
    // private UnityEngine.UI.Text m_player0Text
    // Size: 0x8
    // Offset: 0x88
    ::UnityEngine::UI::Text* m_player0Text;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Text*) == 0x8);
    // private UnityEngine.UI.Text m_player1Text
    // Size: 0x8
    // Offset: 0x90
    ::UnityEngine::UI::Text* m_player1Text;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Text*) == 0x8);
    // private Oculus.Platform.Samples.VrBoardGame.GameController/Oculus.Platform.Samples.VrBoardGame.GameState m_state
    // Size: 0x4
    // Offset: 0x98
    ::Oculus::Platform::Samples::VrBoardGame::GameController::GameState m_state;
    // Field size check
    static_assert(sizeof(::Oculus::Platform::Samples::VrBoardGame::GameController::GameState) == 0x4);
    // Padding between fields: m_state and: m_interestedPiece
    char __padding12[0x4] = {};
    // private Oculus.Platform.Samples.VrBoardGame.GamePiece m_interestedPiece
    // Size: 0x8
    // Offset: 0xA0
    ::Oculus::Platform::Samples::VrBoardGame::GamePiece* m_interestedPiece;
    // Field size check
    static_assert(sizeof(::Oculus::Platform::Samples::VrBoardGame::GamePiece*) == 0x8);
    // private Oculus.Platform.Samples.VrBoardGame.GamePiece m_selectedPiece
    // Size: 0x8
    // Offset: 0xA8
    ::Oculus::Platform::Samples::VrBoardGame::GamePiece* m_selectedPiece;
    // Field size check
    static_assert(sizeof(::Oculus::Platform::Samples::VrBoardGame::GamePiece*) == 0x8);
    // private Oculus.Platform.Samples.VrBoardGame.GamePiece m_proposedPiece
    // Size: 0x8
    // Offset: 0xB0
    ::Oculus::Platform::Samples::VrBoardGame::GamePiece* m_proposedPiece;
    // Field size check
    static_assert(sizeof(::Oculus::Platform::Samples::VrBoardGame::GamePiece*) == 0x8);
    // private System.UInt32 m_powerBallcount
    // Size: 0x4
    // Offset: 0xB8
    uint m_powerBallcount;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // Padding between fields: m_powerBallcount and: m_opponentName
    char __padding16[0x4] = {};
    // private System.String m_opponentName
    // Size: 0x8
    // Offset: 0xC0
    ::StringW m_opponentName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: private Oculus.Platform.Samples.VrBoardGame.MatchmakingManager m_matchmaking
    [[deprecated]] ::Oculus::Platform::Samples::VrBoardGame::MatchmakingManager*& dyn_m_matchmaking();
    // Get instance field reference: private Oculus.Platform.Samples.VrBoardGame.GameBoard m_board
    [[deprecated]] ::Oculus::Platform::Samples::VrBoardGame::GameBoard*& dyn_m_board();
    // Get instance field reference: private Oculus.Platform.Samples.VrBoardGame.GamePiece m_pieceA
    [[deprecated]] ::Oculus::Platform::Samples::VrBoardGame::GamePiece*& dyn_m_pieceA();
    // Get instance field reference: private Oculus.Platform.Samples.VrBoardGame.GamePiece m_pieceB
