// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: VROSC.AudioReactive.AudioReactiveEffectData
#include "VROSC/AudioReactive/AudioReactiveEffectData.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: VROSC
namespace VROSC {
  // Forward declaring type: MinMaxVector3
  class MinMaxVector3;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: AnimationCurve
  class AnimationCurve;
}
// Completed forward declares
// Type namespace: VROSC.AudioReactive
namespace VROSC::AudioReactive {
  // Forward declaring type: ScaleEffectData
  class ScaleEffectData;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::VROSC::AudioReactive::ScaleEffectData);
DEFINE_IL2CPP_ARG_TYPE(::VROSC::AudioReactive::ScaleEffectData*, "VROSC.AudioReactive", "ScaleEffectData");
// Type namespace: VROSC.AudioReactive
namespace VROSC::AudioReactive {
  // Size: 0x30
  #pragma pack(push, 1)
  // Autogenerated type: VROSC.AudioReactive.ScaleEffectData
  // [TokenAttribute] Offset: FFFFFFFF
  // [CreateAssetMenuAttribute] Offset: 780C5C
  class ScaleEffectData : public ::VROSC::AudioReactive::AudioReactiveEffectData {
    public:
    public:
    // private VROSC.MinMaxVector3 _scaling
    // Size: 0x8
    // Offset: 0x18
    ::VROSC::MinMaxVector3* scaling;
    // Field size check
    static_assert(sizeof(::VROSC::MinMaxVector3*) == 0x8);
    // private System.Boolean _uniformRandom
    // Size: 0x1
    // Offset: 0x20
    bool uniformRandom;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: uniformRandom and: duration
    char __padding1[0x3] = {};
    // private System.Single _duration
    // Size: 0x4
    // Offset: 0x24
    float duration;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.AnimationCurve _curve
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::AnimationCurve* curve;
    // Field size check
    static_assert(sizeof(::UnityEngine::AnimationCurve*) == 0x8);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: private VROSC.MinMaxVector3 _scaling
    [[deprecated]] ::VROSC::MinMaxVector3*& dyn__scaling();
    // Get instance field reference: private System.Boolean _uniformRandom
    [[deprecated]] bool& dyn__uniformRandom();
    // Get instance field reference: private System.Single _duration
    [[deprecated]] float& dyn__duration();
    // Get instance field reference: private UnityEngine.AnimationCurve _curve
    [[deprecated]] ::UnityEngine::AnimationCurve*& dyn__curve();
    // public VROSC.MinMaxVector3 get_Scaling()
    // Offset: 0xDE2974
    ::VROSC::MinMaxVector3* get_Scaling();
    // public System.Boolean get_UniformRandom()
    // Offset: 0xDE297C
    bool get_UniformRandom();
    // public System.Single get_Duration()
    // Offset: 0xDE2984
    float get_Duration();
    // public UnityEngine.AnimationCurve get_Curve()
    // Offset: 0xDE298C
    ::UnityEngine::AnimationCurve* get_Curve();
    // public System.Void .ctor()
    // Offset: 0xDE2994
    // Implemented from: VROSC.AudioReactive.AudioReactiveEffectData
    // Base method: System.Void AudioReactiveEffectData::.ctor()
    // Base method: System.Void ScriptableObject::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static ScaleEffectData* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::VROSC::AudioReactive::ScaleEffectData::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<ScaleEffectData*, creationType>()));
    }
  }; // VROSC.AudioReactive.ScaleEffectData
  #pragma pack(pop)
  static check_size<sizeof(ScaleEffectData), 40 + sizeof(::UnityEngine::AnimationCurve*)> __VROSC_AudioReactive_ScaleEffectDataSizeCheck;
  static_assert(sizeof(ScaleEffectData) == 0x30);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: VROSC::AudioReactive::ScaleEffectData::get_Scaling
// Il2CppName: get_Scaling
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::VROSC::MinMaxVector3* (VROSC::AudioReactive::ScaleEffectData::*)()>(&VROSC::AudioReactive::ScaleEffectData::get_Scaling)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(VROSC::AudioReactive::ScaleEffectData*), "get_Scaling", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: VROSC::AudioReactive::ScaleEffectData::get_UniformRandom
// Il2CppName: get_UniformRandom
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<bool (VROSC::AudioReactive::ScaleEffectData::*)()>(&VROSC::AudioReactive::ScaleEffectData::get_UniformRandom)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(VROSC::AudioReactive::ScaleEffectData*), "get_UniformRandom", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: VROSC::AudioReactive::ScaleEffectData::get_Duration
// Il2CppName: get_Duration
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<float (VROSC::AudioReactive::ScaleEffectData::*)()>(&VROSC::AudioReactive::ScaleEffectData::get_Duration)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(VROSC::AudioReactive::ScaleEffectData*), "get_Duration", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: VROSC::AudioReactive::ScaleEffectData::get_Curve
// Il2CppName: get_Curve
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::UnityEngine::AnimationCurve* (VROSC::AudioReactive::ScaleEffectData::*)()>(&VROSC::AudioReactive::ScaleEffectData::get_Curve)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(VROSC::AudioReactive::ScaleEffectData*), "get_Curve", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: VROSC::AudioReactive::ScaleEffectData::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
