// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: VROSC.AudioReactive.CoroutineDrivenEffect
#include "VROSC/AudioReactive/CoroutineDrivenEffect.hpp"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: VROSC::AudioReactive
namespace VROSC::AudioReactive {
  // Forward declaring type: ShaderEffectData
  class ShaderEffectData;
  // Forward declaring type: AudioReactiveBehaviour
  class AudioReactiveBehaviour;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Renderer
  class Renderer;
  // Forward declaring type: MaterialPropertyBlock
  class MaterialPropertyBlock;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Completed forward declares
// Type namespace: VROSC.AudioReactive
namespace VROSC::AudioReactive {
  // Forward declaring type: ShaderEffect
  class ShaderEffect;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::VROSC::AudioReactive::ShaderEffect);
DEFINE_IL2CPP_ARG_TYPE(::VROSC::AudioReactive::ShaderEffect*, "VROSC.AudioReactive", "ShaderEffect");
// Type namespace: VROSC.AudioReactive
namespace VROSC::AudioReactive {
  // Size: 0x58
  #pragma pack(push, 1)
  // Autogenerated type: VROSC.AudioReactive.ShaderEffect
  // [TokenAttribute] Offset: FFFFFFFF
  class ShaderEffect : public ::VROSC::AudioReactive::CoroutineDrivenEffect {
    public:
    // Nested type: ::VROSC::AudioReactive::ShaderEffect::$SpecificFlow$d__9
    class $SpecificFlow$d__9;
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // private VROSC.AudioReactive.ShaderEffectData _data
    // Size: 0x8
    // Offset: 0x30
    ::VROSC::AudioReactive::ShaderEffectData* data;
    // Field size check
    static_assert(sizeof(::VROSC::AudioReactive::ShaderEffectData*) == 0x8);
    // private UnityEngine.Renderer[] _renderers
    // Size: 0x8
    // Offset: 0x38
    ::ArrayW<::UnityEngine::Renderer*> renderers;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Renderer*>) == 0x8);
    // private UnityEngine.MaterialPropertyBlock[] _materialBlocks
    // Size: 0x8
    // Offset: 0x40
    ::ArrayW<::UnityEngine::MaterialPropertyBlock*> materialBlocks;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::MaterialPropertyBlock*>) == 0x8);
    // private UnityEngine.Color _currentColor
    // Size: 0x10
    // Offset: 0x48
    ::UnityEngine::Color currentColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    public:
    // Get instance field reference: private VROSC.AudioReactive.ShaderEffectData _data
    ::VROSC::AudioReactive::ShaderEffectData*& dyn__data();
    // Get instance field reference: private UnityEngine.Renderer[] _renderers
    ::ArrayW<::UnityEngine::Renderer*>& dyn__renderers();
    // Get instance field reference: private UnityEngine.MaterialPropertyBlock[] _materialBlocks
    ::ArrayW<::UnityEngine::MaterialPropertyBlock*>& dyn__materialBlocks();
    // Get instance field reference: private UnityEngine.Color _currentColor
    ::UnityEngine::Color& dyn__currentColor();
    // public VROSC.AudioReactive.ShaderEffectData get_Data()
    // Offset: 0x13B3E2C
    ::VROSC::AudioReactive::ShaderEffectData* get_Data();
    // public UnityEngine.Renderer[] get_Renderer()
    // Offset: 0x13B3E34
    ::ArrayW<::UnityEngine::Renderer*> get_Renderer();
    // private System.Void SetShaderEffects(UnityEngine.Renderer renderer, UnityEngine.MaterialPropertyBlock block, System.Single value)
    // Offset: 0x13B4000
    void SetShaderEffects(::UnityEngine::Renderer* renderer, ::UnityEngine::MaterialPropertyBlock* block, float value);
    // public System.Void .ctor()
    // Offset: 0x13B409C
    // Implemented from: VROSC.AudioReactive.CoroutineDrivenEffect
    // Base method: System.Void CoroutineDrivenEffect::.ctor()
    // Base method: System.Void ReactiveEffect::.ctor()
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static ShaderEffect* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::VROSC::AudioReactive::ShaderEffect::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<ShaderEffect*, creationType>()));
    }
    // public override System.Void Setup(VROSC.AudioReactive.AudioReactiveBehaviour behaviour)
    // Offset: 0x13B3E3C
    // Implemented from: VROSC.AudioReactive.CoroutineDrivenEffect
    // Base method: System.Void CoroutineDrivenEffect::Setup(VROSC.AudioReactive.AudioReactiveBehaviour behaviour)
    void Setup(::VROSC::AudioReactive::AudioReactiveBehaviour* behaviour);
    // protected override System.Collections.IEnumerator SpecificFlow()
    // Offset: 0x13B3F94
    // Implemented from: VROSC.AudioReactive.CoroutineDrivenEffect
    // Base method: System.Collections.IEnumerator CoroutineDrivenEffect::SpecificFlow()
    ::System::Collections::IEnumerator* SpecificFlow();
  }; // VROSC.AudioReactive.ShaderEffect
  #pragma pack(pop)
  static check_size<sizeof(ShaderEffect), 72 + sizeof(::UnityEngine::Color)> __VROSC_AudioReactive_ShaderEffectSizeCheck;
  static_assert(sizeof(ShaderEffect) == 0x58);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: VROSC::AudioReactive::ShaderEffect::get_Data
// Il2CppName: get_Data
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::VROSC::AudioReactive::ShaderEffectData* (VROSC::AudioReactive::ShaderEffect::*)()>(&VROSC::AudioReactive::ShaderEffect::get_Data)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(VROSC::AudioReactive::ShaderEffect*), "get_Data", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: VROSC::AudioReactive::ShaderEffect::get_Renderer
// Il2CppName: get_Renderer
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::ArrayW<::UnityEngine::Renderer*> (VROSC::AudioReactive::ShaderEffect::*)()>(&VROSC::AudioReactive::ShaderEffect::get_Renderer)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(VROSC::AudioReactive::ShaderEffect*), "get_Renderer", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: VROSC::AudioReactive::ShaderEffect::SetShaderEffects
// Il2CppName: SetShaderEffects
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::AudioReactive::ShaderEffect::*)(::UnityEngine::Renderer*, ::UnityEngine::MaterialPropertyBlock*, float)>(&VROSC::AudioReactive::ShaderEffect::SetShaderEffects)> {
  static const MethodInfo* get() {
    static auto* renderer = &::il2cpp_utils::GetClassFromName("UnityEngine", "Renderer")->byval_arg;
    static auto* block = &::il2cpp_utils::GetClassFromName("UnityEngine", "MaterialPropertyBlock")->byval_arg;
    static auto* value = &::il2cpp_utils::GetClassFromName("System", "Single")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(VROSC::AudioReactive::ShaderEffect*), "SetShaderEffects", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{renderer, block, value});
  }
};
// Writing MetadataGetter for method: VROSC::AudioReactive::ShaderEffect::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
// Writing MetadataGetter for method: VROSC::AudioReactive::ShaderEffect::Setup
// Il2CppName: Setup
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::AudioReactive::ShaderEffect::*)(::VROSC::AudioReactive::AudioReactiveBehaviour*)>(&VROSC::AudioReactive::ShaderEffect::Setup)> {
  static const MethodInfo* get() {
    static auto* behaviour = &::il2cpp_utils::GetClassFromName("VROSC.AudioReactive", "AudioReactiveBehaviour")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(VROSC::AudioReactive::ShaderEffect*), "Setup", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{behaviour});
  }
};
// Writing MetadataGetter for method: VROSC::AudioReactive::ShaderEffect::SpecificFlow
// Il2CppName: SpecificFlow
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::System::Collections::IEnumerator* (VROSC::AudioReactive::ShaderEffect::*)()>(&VROSC::AudioReactive::ShaderEffect::SpecificFlow)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(VROSC::AudioReactive::ShaderEffect*), "SpecificFlow", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
