// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.Collections.DictionaryEntry
#include "System/Collections/DictionaryEntry.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Xml
namespace System::Xml {
  // Forward declaring type: XmlNameTable
  class XmlNameTable;
  // Forward declaring type: XmlReaderSettings
  class XmlReaderSettings;
  // Forward declaring type: XmlResolver
  class XmlResolver;
  // Forward declaring type: XmlReader
  class XmlReader;
  // Forward declaring type: XmlQualifiedName
  class XmlQualifiedName;
}
// Forward declaring namespace: System::Xml::Schema
namespace System::Xml::Schema {
  // Forward declaring type: SchemaNames
  class SchemaNames;
  // Forward declaring type: ValidationEventHandler
  class ValidationEventHandler;
  // Forward declaring type: SchemaInfo
  class SchemaInfo;
  // Forward declaring type: XmlSchema
  class XmlSchema;
  // Forward declaring type: XmlSchemaCompilationSettings
  class XmlSchemaCompilationSettings;
  // Forward declaring type: XmlSchemaObjectTable
  class XmlSchemaObjectTable;
  // Forward declaring type: XmlSchemaSubstitutionGroup
  class XmlSchemaSubstitutionGroup;
  // Forward declaring type: XmlSchemaObject
  class XmlSchemaObject;
  // Forward declaring type: ValidationEventArgs
  class ValidationEventArgs;
  // Forward declaring type: XmlSchemaException
  class XmlSchemaException;
  // Forward declaring type: XmlSeverityType
  struct XmlSeverityType;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: SortedList
  class SortedList;
  // Forward declaring type: Hashtable
  class Hashtable;
  // Forward declaring type: ICollection
  class ICollection;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Uri
  class Uri;
}
// Completed forward declares
// Type namespace: System.Xml.Schema
namespace System::Xml::Schema {
  // Forward declaring type: XmlSchemaSet
  class XmlSchemaSet;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::System::Xml::Schema::XmlSchemaSet);
DEFINE_IL2CPP_ARG_TYPE(::System::Xml::Schema::XmlSchemaSet*, "System.Xml.Schema", "XmlSchemaSet");
// Type namespace: System.Xml.Schema
namespace System::Xml::Schema {
  // Size: 0xB0
  #pragma pack(push, 1)
  // Autogenerated type: System.Xml.Schema.XmlSchemaSet
  // [TokenAttribute] Offset: FFFFFFFF
  class XmlSchemaSet : public ::Il2CppObject {
    public:
    public:
    // private System.Xml.XmlNameTable nameTable
    // Size: 0x8
    // Offset: 0x10
    ::System::Xml::XmlNameTable* nameTable;
    // Field size check
    static_assert(sizeof(::System::Xml::XmlNameTable*) == 0x8);
    // private System.Xml.Schema.SchemaNames schemaNames
    // Size: 0x8
    // Offset: 0x18
    ::System::Xml::Schema::SchemaNames* schemaNames;
    // Field size check
    static_assert(sizeof(::System::Xml::Schema::SchemaNames*) == 0x8);
    // private System.Collections.SortedList schemas
    // Size: 0x8
    // Offset: 0x20
    ::System::Collections::SortedList* schemas;
    // Field size check
    static_assert(sizeof(::System::Collections::SortedList*) == 0x8);
    // private System.Xml.Schema.ValidationEventHandler internalEventHandler
    // Size: 0x8
    // Offset: 0x28
    ::System::Xml::Schema::ValidationEventHandler* internalEventHandler;
    // Field size check
    static_assert(sizeof(::System::Xml::Schema::ValidationEventHandler*) == 0x8);
    // private System.Xml.Schema.ValidationEventHandler eventHandler
    // Size: 0x8
    // Offset: 0x30
    ::System::Xml::Schema::ValidationEventHandler* eventHandler;
    // Field size check
    static_assert(sizeof(::System::Xml::Schema::ValidationEventHandler*) == 0x8);
    // private System.Boolean isCompiled
    // Size: 0x1
    // Offset: 0x38
    bool isCompiled;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isCompiled and: schemaLocations
    char __padding5[0x7] = {};
    // private System.Collections.Hashtable schemaLocations
    // Size: 0x8
    // Offset: 0x40
    ::System::Collections::Hashtable* schemaLocations;
    // Field size check
    static_assert(sizeof(::System::Collections::Hashtable*) == 0x8);
    // private System.Collections.Hashtable chameleonSchemas
    // Size: 0x8
    // Offset: 0x48
    ::System::Collections::Hashtable* chameleonSchemas;
    // Field size check
    static_assert(sizeof(::System::Collections::Hashtable*) == 0x8);
    // private System.Collections.Hashtable targetNamespaces
    // Size: 0x8
    // Offset: 0x50
    ::System::Collections::Hashtable* targetNamespaces;
    // Field size check
    static_assert(sizeof(::System::Collections::Hashtable*) == 0x8);
    // private System.Boolean compileAll
    // Size: 0x1
    // Offset: 0x58
    bool compileAll;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: compileAll and: cachedCompiledInfo
    char __padding9[0x7] = {};
    // private System.Xml.Schema.SchemaInfo cachedCompiledInfo
    // Size: 0x8
    // Offset: 0x60
    ::System::Xml::Schema::SchemaInfo* cachedCompiledInfo;
    // Field size check
    static_assert(sizeof(::System::Xml::Schema::SchemaInfo*) == 0x8);
    // private System.Xml.XmlReaderSettings readerSettings
    // Size: 0x8
    // Offset: 0x68
    ::System::Xml::XmlReaderSettings* readerSettings;
    // Field size check
    static_assert(sizeof(::System::Xml::XmlReaderSettings*) == 0x8);
    // private System.Xml.Schema.XmlSchema schemaForSchema
    // Size: 0x8
    // Offset: 0x70
    ::System::Xml::Schema::XmlSchema* schemaForSchema;
    // Field size check
    static_assert(sizeof(::System::Xml::Schema::XmlSchema*) == 0x8);
    // private System.Xml.Schema.XmlSchemaCompilationSettings compilationSettings
    // Size: 0x8
    // Offset: 0x78
    ::System::Xml::Schema::XmlSchemaCompilationSettings* compilationSettings;
    // Field size check
    static_assert(sizeof(::System::Xml::Schema::XmlSchemaCompilationSettings*) == 0x8);
    // System.Xml.Schema.XmlSchemaObjectTable elements
    // Size: 0x8
    // Offset: 0x80
    ::System::Xml::Schema::XmlSchemaObjectTable* elements;
    // Field size check
    static_assert(sizeof(::System::Xml::Schema::XmlSchemaObjectTable*) == 0x8);
    // System.Xml.Schema.XmlSchemaObjectTable attributes
    // Size: 0x8
    // Offset: 0x88
    ::System::Xml::Schema::XmlSchemaObjectTable* attributes;
    // Field size check
    static_assert(sizeof(::System::Xml::Schema::XmlSchemaObjectTable*) == 0x8);
    // System.Xml.Schema.XmlSchemaObjectTable schemaTypes
    // Size: 0x8
    // Offset: 0x90
    ::System::Xml::Schema::XmlSchemaObjectTable* schemaTypes;
    // Field size check
    static_assert(sizeof(::System::Xml::Schema::XmlSchemaObjectTable*) == 0x8);
    // System.Xml.Schema.XmlSchemaObjectTable substitutionGroups
    // Size: 0x8
    // Offset: 0x98
    ::System::Xml::Schema::XmlSchemaObjectTable* substitutionGroups;
    // Field size check
    static_assert(sizeof(::System::Xml::Schema::XmlSchemaObjectTable*) == 0x8);
    // private System.Xml.Schema.XmlSchemaObjectTable typeExtensions
    // Size: 0x8
    // Offset: 0xA0
    ::System::Xml::Schema::XmlSchemaObjectTable* typeExtensions;
    // Field size check
    static_assert(sizeof(::System::Xml::Schema::XmlSchemaObjectTable*) == 0x8);
    // private System.Object internalSyncObject
    // Size: 0x8
    // Offset: 0xA8
    ::Il2CppObject* internalSyncObject;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    public:
    // Get instance field reference: private System.Xml.XmlNameTable nameTable
    [[deprecated]] ::System::Xml::XmlNameTable*& dyn_nameTable();
    // Get instance field reference: private System.Xml.Schema.SchemaNames schemaNames
    [[deprecated]] ::System::Xml::Schema::SchemaNames*& dyn_schemaNames();
    // Get instance field reference: private System.Collections.SortedList schemas
    [[deprecated]] ::System::Collections::SortedList*& dyn_schemas();
    // Get instance field reference: private System.Xml.Schema.ValidationEventHandler internalEventHandler
    [[deprecated]] ::System::Xml::Schema::ValidationEventHandler*& dyn_internalEventHandler();
    // Get instance field reference: private System.Xml.Schema.ValidationEventHandler eventHandler
    [[deprecated]] ::System::Xml::Schema::ValidationEventHandler*& dyn_eventHandler();
