// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.Nullable`1
#include "System/Nullable_1.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`2<T1, T2>
  template<typename T1, typename T2>
  class Action_2;
}
// Forward declaring namespace: Proyecto26
namespace Proyecto26 {
  // Forward declaring type: RequestException
  class RequestException;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: WWWForm
  class WWWForm;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: UnityEngine::Networking
namespace UnityEngine::Networking {
  // Forward declaring type: IMultipartFormSection
  class IMultipartFormSection;
  // Forward declaring type: CertificateHandler
  class CertificateHandler;
  // Forward declaring type: UploadHandler
  class UploadHandler;
  // Forward declaring type: DownloadHandler
  class DownloadHandler;
  // Forward declaring type: UnityWebRequest
  class UnityWebRequest;
}
// Completed forward declares
// Type namespace: Proyecto26
namespace Proyecto26 {
  // Forward declaring type: RequestHelper
  class RequestHelper;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Proyecto26::RequestHelper);
DEFINE_IL2CPP_ARG_TYPE(::Proyecto26::RequestHelper*, "Proyecto26", "RequestHelper");
// Type namespace: Proyecto26
namespace Proyecto26 {
  // WARNING Size may be invalid!
  // Autogenerated type: Proyecto26.RequestHelper
  // [TokenAttribute] Offset: FFFFFFFF
  class RequestHelper : public ::Il2CppObject {
    public:
    public:
    // private System.String _uri
    // Size: 0x8
    // Offset: 0x10
    ::StringW uri;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String _method
    // Size: 0x8
    // Offset: 0x18
    ::StringW method;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Object _body
    // Size: 0x8
    // Offset: 0x20
    ::Il2CppObject* body;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // private System.String _bodyString
    // Size: 0x8
    // Offset: 0x28
    ::StringW bodyString;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Byte[] _bodyRaw
    // Size: 0x8
    // Offset: 0x30
    ::ArrayW<uint8_t> bodyRaw;
    // Field size check
    static_assert(sizeof(::ArrayW<uint8_t>) == 0x8);
    // private System.Nullable`1<System.Int32> _timeout
    // Size: 0xFFFFFFFF
    // Offset: 0x38
    ::System::Nullable_1<int> timeout;
    // private System.String _contentType
    // Size: 0x8
    // Offset: 0x40
    ::StringW contentType;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Int32 _retries
    // Size: 0x4
    // Offset: 0x48
    int retries;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Single _retrySecondsDelay
    // Size: 0x4
    // Offset: 0x4C
    float retrySecondsDelay;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Action`2<Proyecto26.RequestException,System.Int32> _retryCallback
    // Size: 0x8
    // Offset: 0x50
    ::System::Action_2<::Proyecto26::RequestException*, int>* retryCallback;
    // Field size check
    static_assert(sizeof(::System::Action_2<::Proyecto26::RequestException*, int>*) == 0x8);
    // private System.Boolean _enableDebug
    // Size: 0x1
    // Offset: 0x58
    bool enableDebug;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Nullable`1<System.Boolean> _useHttpContinue
    // Size: 0xFFFFFFFF
    // Offset: 0x59
    ::System::Nullable_1<bool> useHttpContinue;
    // private System.Nullable`1<System.Int32> _redirectLimit
    // Size: 0xFFFFFFFF
    // Offset: 0x5C
    ::System::Nullable_1<int> redirectLimit;
    // private System.Boolean _ignoreHttpException
    // Size: 0x1
    // Offset: 0x64
    bool ignoreHttpException;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private UnityEngine.WWWForm _formData
    // Size: 0x8
    // Offset: 0x68
    ::UnityEngine::WWWForm* formData;
    // Field size check
    static_assert(sizeof(::UnityEngine::WWWForm*) == 0x8);
    // private System.Collections.Generic.Dictionary`2<System.String,System.String> _simpleForm
    // Size: 0x8
    // Offset: 0x70
    ::System::Collections::Generic::Dictionary_2<::StringW, ::StringW>* simpleForm;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::StringW, ::StringW>*) == 0x8);
    // private System.Collections.Generic.List`1<UnityEngine.Networking.IMultipartFormSection> _formSections
    // Size: 0x8
    // Offset: 0x78
    ::System::Collections::Generic::List_1<::UnityEngine::Networking::IMultipartFormSection*>* formSections;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::Networking::IMultipartFormSection*>*) == 0x8);
    // private UnityEngine.Networking.CertificateHandler _certificateHandler
    // Size: 0x8
    // Offset: 0x80
    ::UnityEngine::Networking::CertificateHandler* certificateHandler;
    // Field size check
    static_assert(sizeof(::UnityEngine::Networking::CertificateHandler*) == 0x8);
    // private UnityEngine.Networking.UploadHandler _uploadHandler
    // Size: 0x8
    // Offset: 0x88
    ::UnityEngine::Networking::UploadHandler* uploadHandler;
    // Field size check
    static_assert(sizeof(::UnityEngine::Networking::UploadHandler*) == 0x8);
    // private UnityEngine.Networking.DownloadHandler _downloadHandler
    // Size: 0x8
    // Offset: 0x90
    ::UnityEngine::Networking::DownloadHandler* downloadHandler;
    // Field size check
    static_assert(sizeof(::UnityEngine::Networking::DownloadHandler*) == 0x8);
    // private System.Collections.Generic.Dictionary`2<System.String,System.String> _headers
    // Size: 0x8
    // Offset: 0x98
    ::System::Collections::Generic::Dictionary_2<::StringW, ::StringW>* headers;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::StringW, ::StringW>*) == 0x8);
    // private System.Collections.Generic.Dictionary`2<System.String,System.String> _params
    // Size: 0x8
    // Offset: 0xA0
    ::System::Collections::Generic::Dictionary_2<::StringW, ::StringW>* params;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::StringW, ::StringW>*) == 0x8);
    // private System.Boolean _parseResponseBody
    // Size: 0x1
    // Offset: 0xA8
    bool parseResponseBody;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private UnityEngine.Networking.UnityWebRequest <Request>k__BackingField
    // Size: 0x8
    // Offset: 0xB0
    ::UnityEngine::Networking::UnityWebRequest* Request;
    // Field size check
    static_assert(sizeof(::UnityEngine::Networking::UnityWebRequest*) == 0x8);
    // private System.Boolean _isAborted
    // Size: 0x1
    // Offset: 0xB8
    bool isAborted;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _defaultContentType
    // Size: 0x1
    // Offset: 0xB9
    bool defaultContentType;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Get instance field reference: private System.String _uri
    [[deprecated("Use field access instead!")]] ::StringW& dyn__uri();
    // Get instance field reference: private System.String _method
    [[deprecated("Use field access instead!")]] ::StringW& dyn__method();
    // Get instance field reference: private System.Object _body
    [[deprecated("Use field access instead!")]] ::Il2CppObject*& dyn__body();
    // Get instance field reference: private System.String _bodyString
    [[deprecated("Use field access instead!")]] ::StringW& dyn__bodyString();
    // Get instance field reference: private System.Byte[] _bodyRaw
    [[deprecated("Use field access instead!")]] ::ArrayW<uint8_t>& dyn__bodyRaw();
    // Get instance field reference: private System.Nullable`1<System.Int32> _timeout
