// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: FirebaseHelper
#include "GlobalNamespace/FirebaseHelper.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::FirebaseHelper::ErrorLog);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::FirebaseHelper::ErrorLog*, "", "FirebaseHelper/ErrorLog");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x40
  #pragma pack(push, 1)
  // Autogenerated type: FirebaseHelper/ErrorLog
  // [TokenAttribute] Offset: FFFFFFFF
  class FirebaseHelper::ErrorLog : public ::Il2CppObject {
    public:
    public:
    // public System.String AppVersion
    // Size: 0x8
    // Offset: 0x10
    ::StringW AppVersion;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String Date
    // Size: 0x8
    // Offset: 0x18
    ::StringW Date;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String Device
    // Size: 0x8
    // Offset: 0x20
    ::StringW Device;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String OperatingSystem
    // Size: 0x8
    // Offset: 0x28
    ::StringW OperatingSystem;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String Message
    // Size: 0x8
    // Offset: 0x30
    ::StringW Message;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String Stack
    // Size: 0x8
    // Offset: 0x38
    ::StringW Stack;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    public:
    // Get instance field reference: public System.String AppVersion
    [[deprecated("Use field access instead!")]] ::StringW& dyn_AppVersion();
    // Get instance field reference: public System.String Date
    [[deprecated("Use field access instead!")]] ::StringW& dyn_Date();
    // Get instance field reference: public System.String Device
    [[deprecated("Use field access instead!")]] ::StringW& dyn_Device();
    // Get instance field reference: public System.String OperatingSystem
    [[deprecated("Use field access instead!")]] ::StringW& dyn_OperatingSystem();
    // Get instance field reference: public System.String Message
    [[deprecated("Use field access instead!")]] ::StringW& dyn_Message();
    // Get instance field reference: public System.String Stack
    [[deprecated("Use field access instead!")]] ::StringW& dyn_Stack();
    // public System.Void .ctor()
    // Offset: 0x1952858
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static FirebaseHelper::ErrorLog* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::GlobalNamespace::FirebaseHelper::ErrorLog::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<FirebaseHelper::ErrorLog*, creationType>()));
    }
  }; // FirebaseHelper/ErrorLog
  #pragma pack(pop)
  static check_size<sizeof(FirebaseHelper::ErrorLog), 56 + sizeof(::StringW)> __GlobalNamespace_FirebaseHelper_ErrorLogSizeCheck;
  static_assert(sizeof(FirebaseHelper::ErrorLog) == 0x40);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: GlobalNamespace::FirebaseHelper::ErrorLog::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
