// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: FirebaseHelper
#include "GlobalNamespace/FirebaseHelper.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::FirebaseHelper::NewUser);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::FirebaseHelper::NewUser*, "", "FirebaseHelper/NewUser");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x38
  #pragma pack(push, 1)
  // Autogenerated type: FirebaseHelper/NewUser
  // [TokenAttribute] Offset: FFFFFFFF
  class FirebaseHelper::NewUser : public ::Il2CppObject {
    public:
    public:
    // public System.String kind
    // Size: 0x8
    // Offset: 0x10
    ::StringW kind;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String idToken
    // Size: 0x8
    // Offset: 0x18
    ::StringW idToken;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String refreshToken
    // Size: 0x8
    // Offset: 0x20
    ::StringW refreshToken;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String expiresIn
    // Size: 0x8
    // Offset: 0x28
    ::StringW expiresIn;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String localId
    // Size: 0x8
    // Offset: 0x30
    ::StringW localId;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    public:
    // Get instance field reference: public System.String kind
    [[deprecated]] ::StringW& dyn_kind();
    // Get instance field reference: public System.String idToken
    [[deprecated]] ::StringW& dyn_idToken();
    // Get instance field reference: public System.String refreshToken
    [[deprecated]] ::StringW& dyn_refreshToken();
    // Get instance field reference: public System.String expiresIn
    [[deprecated]] ::StringW& dyn_expiresIn();
    // Get instance field reference: public System.String localId
    [[deprecated]] ::StringW& dyn_localId();
    // public System.Void .ctor()
    // Offset: 0x1952870
    // Implemented from: System.Object
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static FirebaseHelper::NewUser* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::GlobalNamespace::FirebaseHelper::NewUser::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<FirebaseHelper::NewUser*, creationType>()));
    }
  }; // FirebaseHelper/NewUser
  #pragma pack(pop)
  static check_size<sizeof(FirebaseHelper::NewUser), 48 + sizeof(::StringW)> __GlobalNamespace_FirebaseHelper_NewUserSizeCheck;
  static_assert(sizeof(FirebaseHelper::NewUser) == 0x38);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: GlobalNamespace::FirebaseHelper::NewUser::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
