// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: FirebaseHelper
#include "GlobalNamespace/FirebaseHelper.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::FirebaseHelper::RefreshedUser);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::FirebaseHelper::RefreshedUser*, "", "FirebaseHelper/RefreshedUser");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x48
  #pragma pack(push, 1)
  // Autogenerated type: FirebaseHelper/RefreshedUser
  // [TokenAttribute] Offset: FFFFFFFF
  class FirebaseHelper::RefreshedUser : public ::Il2CppObject {
    public:
    public:
    // public System.String access_token
    // Size: 0x8
    // Offset: 0x10
    ::StringW access_token;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String expires_in
    // Size: 0x8
    // Offset: 0x18
    ::StringW expires_in;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String token_type
    // Size: 0x8
    // Offset: 0x20
    ::StringW token_type;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String refresh_token
    // Size: 0x8
    // Offset: 0x28
    ::StringW refresh_token;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String id_token
    // Size: 0x8
    // Offset: 0x30
    ::StringW id_token;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String user_id
    // Size: 0x8
    // Offset: 0x38
    ::StringW user_id;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String project_id
    // Size: 0x8
    // Offset: 0x40
    ::StringW project_id;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    public:
    // Get instance field reference: public System.String access_token
    [[deprecated]] ::StringW& dyn_access_token();
    // Get instance field reference: public System.String expires_in
    [[deprecated]] ::StringW& dyn_expires_in();
    // Get instance field reference: public System.String token_type
    [[deprecated]] ::StringW& dyn_token_type();
    // Get instance field reference: public System.String refresh_token
    [[deprecated]] ::StringW& dyn_refresh_token();
    // Get instance field reference: public System.String id_token
    [[deprecated]] ::StringW& dyn_id_token();
    // Get instance field reference: public System.String user_id
    [[deprecated]] ::StringW& dyn_user_id();
    // Get instance field reference: public System.String project_id
    [[deprecated]] ::StringW& dyn_project_id();
    // public System.Void .ctor()
    // Offset: 0x19528CC
    // Implemented from: System.Object
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static FirebaseHelper::RefreshedUser* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::GlobalNamespace::FirebaseHelper::RefreshedUser::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<FirebaseHelper::RefreshedUser*, creationType>()));
    }
  }; // FirebaseHelper/RefreshedUser
  #pragma pack(pop)
  static check_size<sizeof(FirebaseHelper::RefreshedUser), 64 + sizeof(::StringW)> __GlobalNamespace_FirebaseHelper_RefreshedUserSizeCheck;
  static_assert(sizeof(FirebaseHelper::RefreshedUser) == 0x48);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: GlobalNamespace::FirebaseHelper::RefreshedUser::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
