// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Including type: ovrAvatarLightType
#include "GlobalNamespace/ovrAvatarLightType.hpp"
// Including type: UnityEngine.Vector3
#include "UnityEngine/Vector3.hpp"
// Completed includes
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: ovrAvatarLight
  struct ovrAvatarLight;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::ovrAvatarLight, "", "ovrAvatarLight");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x2C
  #pragma pack(push, 1)
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: ovrAvatarLight
  // [TokenAttribute] Offset: FFFFFFFF
  struct ovrAvatarLight/*, public ::System::ValueType*/ {
    public:
    public:
    // public System.UInt32 id
    // Size: 0x4
    // Offset: 0x0
    uint id;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // public ovrAvatarLightType type
    // Size: 0x14
    // Offset: 0x4
    ::GlobalNamespace::ovrAvatarLightType type;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ovrAvatarLightType) == 0x14);
    // public System.Single intensity
    // Size: 0x4
    // Offset: 0x8
    float intensity;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public UnityEngine.Vector3 worldDirection
    // Size: 0xC
    // Offset: 0xC
    ::UnityEngine::Vector3 worldDirection;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public UnityEngine.Vector3 worldPosition
    // Size: 0xC
    // Offset: 0x18
    ::UnityEngine::Vector3 worldPosition;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public System.Single range
    // Size: 0x4
    // Offset: 0x24
    float range;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single spotAngleDeg
    // Size: 0x4
    // Offset: 0x28
    float spotAngleDeg;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    public:
    // Creating value type constructor for type: ovrAvatarLight
    constexpr ovrAvatarLight(uint id_ = {}, ::GlobalNamespace::ovrAvatarLightType type_ = {}, float intensity_ = {}, ::UnityEngine::Vector3 worldDirection_ = {}, ::UnityEngine::Vector3 worldPosition_ = {}, float range_ = {}, float spotAngleDeg_ = {}) noexcept : id{id_}, type{type_}, intensity{intensity_}, worldDirection{worldDirection_}, worldPosition{worldPosition_}, range{range_}, spotAngleDeg{spotAngleDeg_} {}
    // Creating interface conversion operator: operator ::System::ValueType
    operator ::System::ValueType() noexcept {
      return *reinterpret_cast<::System::ValueType*>(this);
    }
    // Get instance field reference: public System.UInt32 id
    uint& dyn_id();
    // Get instance field reference: public ovrAvatarLightType type
    ::GlobalNamespace::ovrAvatarLightType& dyn_type();
    // Get instance field reference: public System.Single intensity
    float& dyn_intensity();
    // Get instance field reference: public UnityEngine.Vector3 worldDirection
    ::UnityEngine::Vector3& dyn_worldDirection();
    // Get instance field reference: public UnityEngine.Vector3 worldPosition
    ::UnityEngine::Vector3& dyn_worldPosition();
    // Get instance field reference: public System.Single range
    float& dyn_range();
    // Get instance field reference: public System.Single spotAngleDeg
    float& dyn_spotAngleDeg();
  }; // ovrAvatarLight
  #pragma pack(pop)
  static check_size<sizeof(ovrAvatarLight), 40 + sizeof(float)> __GlobalNamespace_ovrAvatarLightSizeCheck;
  static_assert(sizeof(ovrAvatarLight) == 0x2C);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
