// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include <stdint.h>
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: ovrAvatarMeshVertex
  struct ovrAvatarMeshVertex;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::ovrAvatarMeshVertex, "", "ovrAvatarMeshVertex");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x40
  #pragma pack(push, 1)
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: ovrAvatarMeshVertex
  // [TokenAttribute] Offset: FFFFFFFF
  struct ovrAvatarMeshVertex/*, public ::System::ValueType*/ {
    public:
    public:
    // public System.Single x
    // Size: 0x4
    // Offset: 0x0
    float x;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single y
    // Size: 0x4
    // Offset: 0x4
    float y;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single z
    // Size: 0x4
    // Offset: 0x8
    float z;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single nx
    // Size: 0x4
    // Offset: 0xC
    float nx;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single ny
    // Size: 0x4
    // Offset: 0x10
    float ny;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single nz
    // Size: 0x4
    // Offset: 0x14
    float nz;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single tx
    // Size: 0x4
    // Offset: 0x18
    float tx;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single ty
    // Size: 0x4
    // Offset: 0x1C
    float ty;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single tz
    // Size: 0x4
    // Offset: 0x20
    float tz;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single tw
    // Size: 0x4
    // Offset: 0x24
    float tw;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single u
    // Size: 0x4
    // Offset: 0x28
    float u;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single v
    // Size: 0x4
    // Offset: 0x2C
    float v;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Byte[] blendIndices
    // Size: 0x8
    // Offset: 0x30
    ::ArrayW<uint8_t> blendIndices;
    // Field size check
    static_assert(sizeof(::ArrayW<uint8_t>) == 0x8);
    // public System.Single[] blendWeights
    // Size: 0x8
    // Offset: 0x38
    ::ArrayW<float> blendWeights;
    // Field size check
    static_assert(sizeof(::ArrayW<float>) == 0x8);
    public:
    // Creating value type constructor for type: ovrAvatarMeshVertex
    constexpr ovrAvatarMeshVertex(float x_ = {}, float y_ = {}, float z_ = {}, float nx_ = {}, float ny_ = {}, float nz_ = {}, float tx_ = {}, float ty_ = {}, float tz_ = {}, float tw_ = {}, float u_ = {}, float v_ = {}, ::ArrayW<uint8_t> blendIndices_ = ::ArrayW<uint8_t>(static_cast<void*>(nullptr)), ::ArrayW<float> blendWeights_ = ::ArrayW<float>(static_cast<void*>(nullptr))) noexcept : x{x_}, y{y_}, z{z_}, nx{nx_}, ny{ny_}, nz{nz_}, tx{tx_}, ty{ty_}, tz{tz_}, tw{tw_}, u{u_}, v{v_}, blendIndices{blendIndices_}, blendWeights{blendWeights_} {}
    // Creating interface conversion operator: operator ::System::ValueType
    operator ::System::ValueType() noexcept {
      return *reinterpret_cast<::System::ValueType*>(this);
    }
    // Get instance field reference: public System.Single x
    [[deprecated]] float& dyn_x();
    // Get instance field reference: public System.Single y
    [[deprecated]] float& dyn_y();
    // Get instance field reference: public System.Single z
    [[deprecated]] float& dyn_z();
    // Get instance field reference: public System.Single nx
    [[deprecated]] float& dyn_nx();
    // Get instance field reference: public System.Single ny
    [[deprecated]] float& dyn_ny();
    // Get instance field reference: public System.Single nz
    [[deprecated]] float& dyn_nz();
    // Get instance field reference: public System.Single tx
    [[deprecated]] float& dyn_tx();
    // Get instance field reference: public System.Single ty
    [[deprecated]] float& dyn_ty();
    // Get instance field reference: public System.Single tz
    [[deprecated]] float& dyn_tz();
    // Get instance field reference: public System.Single tw
    [[deprecated]] float& dyn_tw();
    // Get instance field reference: public System.Single u
    [[deprecated]] float& dyn_u();
    // Get instance field reference: public System.Single v
    [[deprecated]] float& dyn_v();
    // Get instance field reference: public System.Byte[] blendIndices
    [[deprecated]] ::ArrayW<uint8_t>& dyn_blendIndices();
    // Get instance field reference: public System.Single[] blendWeights
    [[deprecated]] ::ArrayW<float>& dyn_blendWeights();
  }; // ovrAvatarMeshVertex
  #pragma pack(pop)
  static check_size<sizeof(ovrAvatarMeshVertex), 56 + sizeof(::ArrayW<float>)> __GlobalNamespace_ovrAvatarMeshVertexSizeCheck;
  static_assert(sizeof(ovrAvatarMeshVertex) == 0x40);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
