// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: ovrAvatarCapabilities
#include "GlobalNamespace/ovrAvatarCapabilities.hpp"
// Including type: ovrAvatarAssetLevelOfDetail
#include "GlobalNamespace/ovrAvatarAssetLevelOfDetail.hpp"
// Including type: UnityEngine.Vector4
#include "UnityEngine/Vector4.hpp"
// Including type: OVRLipSync
#include "GlobalNamespace/OVRLipSync.hpp"
// Including type: ovrAvatarTransform
#include "GlobalNamespace/ovrAvatarTransform.hpp"
// Including type: ovrAvatarLookAndFeelVersion
#include "GlobalNamespace/ovrAvatarLookAndFeelVersion.hpp"
// Including type: ovrAvatarVisemes
#include "GlobalNamespace/ovrAvatarVisemes.hpp"
// Including type: System.Boolean
#include "System/Boolean.hpp"
// Including type: ovrAvatarLights
#include "GlobalNamespace/ovrAvatarLights.hpp"
// Including type: ovrAvatarComponent
#include "GlobalNamespace/ovrAvatarComponent.hpp"
// Including type: OvrAvatarDriver
#include "GlobalNamespace/OvrAvatarDriver.hpp"
// Including type: ovrAvatarBodyComponent
#include "GlobalNamespace/ovrAvatarBodyComponent.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"

  // Forward declaring type: OvrAvatarTouchController
  class OvrAvatarTouchController;
  // Forward declaring type: OvrAvatarBody
  class OvrAvatarBody;
  // Forward declaring type: OvrAvatarHand
  class OvrAvatarHand;
  // Forward declaring type: OvrAvatarPacket
  class OvrAvatarPacket;
  // Forward declaring type: OvrAvatarAsset
  class OvrAvatarAsset;
  // Forward declaring type: OvrAvatarSkinnedMeshRenderComponent
  class OvrAvatarSkinnedMeshRenderComponent;
  // Forward declaring type: ovrAvatarRenderPart_SkinnedMeshRender
  struct ovrAvatarRenderPart_SkinnedMeshRender;
  // Forward declaring type: OvrAvatarSkinnedMeshRenderPBSComponent
  class OvrAvatarSkinnedMeshRenderPBSComponent;
  // Forward declaring type: ovrAvatarRenderPart_SkinnedMeshRenderPBS
  struct ovrAvatarRenderPart_SkinnedMeshRenderPBS;
  // Forward declaring type: OvrAvatarSkinnedMeshPBSV2RenderComponent
  class OvrAvatarSkinnedMeshPBSV2RenderComponent;
  // Forward declaring type: ovrAvatarRenderPart_SkinnedMeshRenderPBS_V2
  struct ovrAvatarRenderPart_SkinnedMeshRenderPBS_V2;
  // Forward declaring type: ovrAvatarHandInputState
  struct ovrAvatarHandInputState;
  // Forward declaring type: ovrAvatarGazeTarget
  struct ovrAvatarGazeTarget;
  // Forward declaring type: ovrAvatarGazeTargetType
  struct ovrAvatarGazeTargetType;
  // Forward declaring type: OvrAvatarComponent
  class OvrAvatarComponent_;
  // Skipping declaration: ovrAvatarLight because it is already included!
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Nullable`1<T>
  template<typename T>
  struct Nullable_1;
  // Forward declaring type: EventHandler`1<TEventArgs>
  template<typename TEventArgs>
  class EventHandler_1;
  // Forward declaring type: String
  class String;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Shader
  class Shader;
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: AudioSource
  class AudioSource;
  // Skipping declaration: Quaternion because it is already included!
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: HashSet`1<T>
  template<typename T>
  class HashSet_1;
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: OvrAvatar
  class OvrAvatar;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::OvrAvatar);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::OvrAvatar*, "", "OvrAvatar");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x1E5
  #pragma pack(push, 1)
  // Autogenerated type: OvrAvatar
  // [TokenAttribute] Offset: FFFFFFFF
  class OvrAvatar : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::GlobalNamespace::OvrAvatar::PacketEventArgs
    class PacketEventArgs;
    // Nested type: ::GlobalNamespace::OvrAvatar::HandType
    struct HandType;
    // Nested type: ::GlobalNamespace::OvrAvatar::HandJoint
    struct HandJoint;
    // Nested type: ::GlobalNamespace::OvrAvatar::$WaitForMouthAudioSource$d__137
    class $WaitForMouthAudioSource$d__137;
    public:
    // [HeaderAttribute] Offset: 0x7829C4
    // public System.IntPtr sdkAvatar
    // Size: 0x8
    // Offset: 0x18
    ::System::IntPtr sdkAvatar;
    // Field size check
    static_assert(sizeof(::System::IntPtr) == 0x8);
    // public System.String oculusUserID
    // Size: 0x8
    // Offset: 0x20
    ::StringW oculusUserID;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public OvrAvatarDriver Driver
    // Size: 0x8
    // Offset: 0x28
    ::GlobalNamespace::OvrAvatarDriver* Driver;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OvrAvatarDriver*) == 0x8);
    // [HeaderAttribute] Offset: 0x7829FC
    // public System.Boolean EnableBody
    // Size: 0x1
    // Offset: 0x30
    bool EnableBody;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean EnableHands
    // Size: 0x1
    // Offset: 0x31
    bool EnableHands;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean EnableBase
    // Size: 0x1
    // Offset: 0x32
    bool EnableBase;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean EnableExpressive
    // Size: 0x1
    // Offset: 0x33
    bool EnableExpressive;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [HeaderAttribute] Offset: 0x782A34
    // public System.Boolean RecordPackets
    // Size: 0x1
    // Offset: 0x34
    bool RecordPackets;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean UseSDKPackets
    // Size: 0x1
    // Offset: 0x35
    bool UseSDKPackets;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: UseSDKPackets and: PacketSettings
    char __padding8[0x2] = {};
    // public PacketRecordSettings PacketSettings
    // Size: 0x8
    // Offset: 0x38
    ::GlobalNamespace::PacketRecordSettings* PacketSettings;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::PacketRecordSettings*) == 0x8);
    // [HeaderAttribute] Offset: 0x782A6C
    // public System.Boolean StartWithControllers
    // Size: 0x1
    // Offset: 0x40
    bool StartWithControllers;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: StartWithControllers and: FirstPersonLayer
    char __padding10[0x7] = {};
    // public AvatarLayer FirstPersonLayer
    // Size: 0x8
    // Offset: 0x48
    ::GlobalNamespace::AvatarLayer* FirstPersonLayer;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::AvatarLayer*) == 0x8);
    // public AvatarLayer ThirdPersonLayer
    // Size: 0x8
    // Offset: 0x50
    ::GlobalNamespace::AvatarLayer* ThirdPersonLayer;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::AvatarLayer*) == 0x8);
    // public System.Boolean ShowFirstPerson
    // Size: 0x1
    // Offset: 0x58
    bool ShowFirstPerson;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean ShowThirdPerson
    // Size: 0x1
    // Offset: 0x59
    bool ShowThirdPerson;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: ShowThirdPerson and: Capabilities
    char __padding14[0x2] = {};
    // ovrAvatarCapabilities Capabilities
    // Size: 0x4
    // Offset: 0x5C
    ::GlobalNamespace::ovrAvatarCapabilities Capabilities;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ovrAvatarCapabilities) == 0x4);
    // [TooltipAttribute] Offset: 0x782AA4
    // [HeaderAttribute] Offset: 0x782AA4
    // ovrAvatarAssetLevelOfDetail LevelOfDetail
    // Size: 0x4
    // Offset: 0x60
    ::GlobalNamespace::ovrAvatarAssetLevelOfDetail LevelOfDetail;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ovrAvatarAssetLevelOfDetail) == 0x4);
    // [TooltipAttribute] Offset: 0x782B14
    // private System.Boolean CombineMeshes
    // Size: 0x1
    // Offset: 0x64
    bool CombineMeshes;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [TooltipAttribute] Offset: 0x782B4C
    // public System.Boolean UseTransparentRenderQueue
    // Size: 0x1
    // Offset: 0x65
    bool UseTransparentRenderQueue;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: UseTransparentRenderQueue and: Monochrome_SurfaceShader
    char __padding18[0x2] = {};
    // [HeaderAttribute] Offset: 0x782B84
    // public UnityEngine.Shader Monochrome_SurfaceShader
    // Size: 0x8
    // Offset: 0x68
    ::UnityEngine::Shader* Monochrome_SurfaceShader;
    // Field size check
    static_assert(sizeof(::UnityEngine::Shader*) == 0x8);
    // public UnityEngine.Shader Monochrome_SurfaceShader_SelfOccluding
    // Size: 0x8
    // Offset: 0x70
    ::UnityEngine::Shader* Monochrome_SurfaceShader_SelfOccluding;
    // Field size check
    static_assert(sizeof(::UnityEngine::Shader*) == 0x8);
    // public UnityEngine.Shader Monochrome_SurfaceShader_PBS
    // Size: 0x8
    // Offset: 0x78
    ::UnityEngine::Shader* Monochrome_SurfaceShader_PBS;
    // Field size check
    static_assert(sizeof(::UnityEngine::Shader*) == 0x8);
    // public UnityEngine.Shader Skinshaded_SurfaceShader_SingleComponent
    // Size: 0x8
    // Offset: 0x80
    ::UnityEngine::Shader* Skinshaded_SurfaceShader_SingleComponent;
    // Field size check
    static_assert(sizeof(::UnityEngine::Shader*) == 0x8);
    // public UnityEngine.Shader Skinshaded_VertFrag_SingleComponent
    // Size: 0x8
    // Offset: 0x88
    ::UnityEngine::Shader* Skinshaded_VertFrag_SingleComponent;
    // Field size check
    static_assert(sizeof(::UnityEngine::Shader*) == 0x8);
    // public UnityEngine.Shader Skinshaded_VertFrag_CombinedMesh
    // Size: 0x8
    // Offset: 0x90
    ::UnityEngine::Shader* Skinshaded_VertFrag_CombinedMesh;
    // Field size check
    static_assert(sizeof(::UnityEngine::Shader*) == 0x8);
    // public UnityEngine.Shader Skinshaded_Expressive_SurfaceShader_SingleComponent
    // Size: 0x8
    // Offset: 0x98
    ::UnityEngine::Shader* Skinshaded_Expressive_SurfaceShader_SingleComponent;
    // Field size check
    static_assert(sizeof(::UnityEngine::Shader*) == 0x8);
    // public UnityEngine.Shader Skinshaded_Expressive_VertFrag_SingleComponent
    // Size: 0x8
    // Offset: 0xA0
    ::UnityEngine::Shader* Skinshaded_Expressive_VertFrag_SingleComponent;
    // Field size check
    static_assert(sizeof(::UnityEngine::Shader*) == 0x8);
    // public UnityEngine.Shader Skinshaded_Expressive_VertFrag_CombinedMesh
    // Size: 0x8
    // Offset: 0xA8
    ::UnityEngine::Shader* Skinshaded_Expressive_VertFrag_CombinedMesh;
    // Field size check
    static_assert(sizeof(::UnityEngine::Shader*) == 0x8);
    // public UnityEngine.Shader Loader_VertFrag_CombinedMesh
    // Size: 0x8
    // Offset: 0xB0
    ::UnityEngine::Shader* Loader_VertFrag_CombinedMesh;
    // Field size check
    static_assert(sizeof(::UnityEngine::Shader*) == 0x8);
    // public UnityEngine.Shader EyeLens
    // Size: 0x8
    // Offset: 0xB8
    ::UnityEngine::Shader* EyeLens;
    // Field size check
    static_assert(sizeof(::UnityEngine::Shader*) == 0x8);
    // public UnityEngine.Shader ControllerShader
    // Size: 0x8
    // Offset: 0xC0
    ::UnityEngine::Shader* ControllerShader;
    // Field size check
    static_assert(sizeof(::UnityEngine::Shader*) == 0x8);
    // [HeaderAttribute] Offset: 0x782BBC
    // public System.Boolean CanOwnMicrophone
    // Size: 0x1
    // Offset: 0xC8
    bool CanOwnMicrophone;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [TooltipAttribute] Offset: 0x782BF4
    // public System.Boolean EnableLaughter
    // Size: 0x1
    // Offset: 0xC9
    bool EnableLaughter;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: EnableLaughter and: MouthAnchor
    char __padding32[0x6] = {};
    // public UnityEngine.GameObject MouthAnchor
    // Size: 0x8
    // Offset: 0xD0
    ::UnityEngine::GameObject* MouthAnchor;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.Transform LeftHandCustomPose
    // Size: 0x8
    // Offset: 0xD8
    ::UnityEngine::Transform* LeftHandCustomPose;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // public UnityEngine.Transform RightHandCustomPose
    // Size: 0x8
    // Offset: 0xE0
    ::UnityEngine::Transform* RightHandCustomPose;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private System.Collections.Generic.HashSet`1<System.UInt64> assetLoadingIds
    // Size: 0x8
    // Offset: 0xE8
    ::System::Collections::Generic::HashSet_1<uint64_t>* assetLoadingIds;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::HashSet_1<uint64_t>*) == 0x8);
    // private System.Boolean assetsFinishedLoading
    // Size: 0x1
    // Offset: 0xF0
    bool assetsFinishedLoading;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: assetsFinishedLoading and: materialManager
    char __padding37[0x7] = {};
    // private OvrAvatarMaterialManager materialManager
    // Size: 0x8
    // Offset: 0xF8
    ::GlobalNamespace::OvrAvatarMaterialManager* materialManager;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OvrAvatarMaterialManager*) == 0x8);
    // private System.Boolean waitingForCombinedMesh
    // Size: 0x1
    // Offset: 0x100
    bool waitingForCombinedMesh;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: waitingForCombinedMesh and: clothingAlphaOffset
    char __padding39[0x3] = {};
    // private UnityEngine.Vector4 clothingAlphaOffset
    // Size: 0x10
    // Offset: 0x104
    ::UnityEngine::Vector4 clothingAlphaOffset;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector4) == 0x10);
    // Padding between fields: clothingAlphaOffset and: clothingAlphaTexture
    char __padding40[0x4] = {};
    // private System.UInt64 clothingAlphaTexture
    // Size: 0x8
    // Offset: 0x118
    uint64_t clothingAlphaTexture;
    // Field size check
    static_assert(sizeof(uint64_t) == 0x8);
    // private OVRLipSyncMicInput micInput
    // Size: 0x8
    // Offset: 0x120
    ::GlobalNamespace::OVRLipSyncMicInput* micInput;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVRLipSyncMicInput*) == 0x8);
    // private OVRLipSyncContext lipsyncContext
    // Size: 0x8
    // Offset: 0x128
    ::GlobalNamespace::OVRLipSyncContext* lipsyncContext;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVRLipSyncContext*) == 0x8);
    // private OVRLipSync/Frame currentFrame
    // Size: 0x8
    // Offset: 0x130
    ::GlobalNamespace::OVRLipSync::Frame* currentFrame;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVRLipSync::Frame*) == 0x8);
    // private System.Single[] visemes
    // Size: 0x8
    // Offset: 0x138
    ::ArrayW<float> visemes;
    // Field size check
    static_assert(sizeof(::ArrayW<float>) == 0x8);
    // private UnityEngine.AudioSource audioSource
    // Size: 0x8
    // Offset: 0x140
    ::UnityEngine::AudioSource* audioSource;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioSource*) == 0x8);
    // private ONSPAudioSource spatializedSource
    // Size: 0x8
    // Offset: 0x148
    ::GlobalNamespace::ONSPAudioSource* spatializedSource;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ONSPAudioSource*) == 0x8);
    // private System.Collections.Generic.List`1<System.Single[]> voiceUpdates
    // Size: 0x8
    // Offset: 0x150
    ::System::Collections::Generic::List_1<::ArrayW<float>>* voiceUpdates;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::ArrayW<float>>*) == 0x8);
    // private UnityEngine.Transform cachedLeftHandCustomPose
    // Size: 0x8
    // Offset: 0x158
    ::UnityEngine::Transform* cachedLeftHandCustomPose;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private UnityEngine.Transform[] cachedCustomLeftHandJoints
    // Size: 0x8
    // Offset: 0x160
    ::ArrayW<::UnityEngine::Transform*> cachedCustomLeftHandJoints;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Transform*>) == 0x8);
    // private ovrAvatarTransform[] cachedLeftHandTransforms
    // Size: 0x8
    // Offset: 0x168
    ::ArrayW<::GlobalNamespace::ovrAvatarTransform> cachedLeftHandTransforms;
    // Field size check
    static_assert(sizeof(::ArrayW<::GlobalNamespace::ovrAvatarTransform>) == 0x8);
    // private UnityEngine.Transform cachedRightHandCustomPose
    // Size: 0x8
    // Offset: 0x170
    ::UnityEngine::Transform* cachedRightHandCustomPose;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private UnityEngine.Transform[] cachedCustomRightHandJoints
    // Size: 0x8
    // Offset: 0x178
    ::ArrayW<::UnityEngine::Transform*> cachedCustomRightHandJoints;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Transform*>) == 0x8);
    // private ovrAvatarTransform[] cachedRightHandTransforms
    // Size: 0x8
    // Offset: 0x180
    ::ArrayW<::GlobalNamespace::ovrAvatarTransform> cachedRightHandTransforms;
    // Field size check
    static_assert(sizeof(::ArrayW<::GlobalNamespace::ovrAvatarTransform>) == 0x8);
    // private System.Boolean showLeftController
    // Size: 0x1
    // Offset: 0x188
    bool showLeftController;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean showRightController
    // Size: 0x1
    // Offset: 0x189
    bool showRightController;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: showRightController and: oculusUserIDInternal
    char __padding56[0x6] = {};
    // System.UInt64 oculusUserIDInternal
    // Size: 0x8
    // Offset: 0x190
    uint64_t oculusUserIDInternal;
    // Field size check
    static_assert(sizeof(uint64_t) == 0x8);
    // OvrAvatarBase Base
    // Size: 0x8
    // Offset: 0x198
    ::GlobalNamespace::OvrAvatarBase* Base;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OvrAvatarBase*) == 0x8);
    // OvrAvatarTouchController ControllerLeft
    // Size: 0x8
    // Offset: 0x1A0
    ::GlobalNamespace::OvrAvatarTouchController* ControllerLeft;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OvrAvatarTouchController*) == 0x8);
    // OvrAvatarTouchController ControllerRight
    // Size: 0x8
    // Offset: 0x1A8
    ::GlobalNamespace::OvrAvatarTouchController* ControllerRight;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OvrAvatarTouchController*) == 0x8);
    // OvrAvatarBody Body
    // Size: 0x8
    // Offset: 0x1B0
    ::GlobalNamespace::OvrAvatarBody* Body;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OvrAvatarBody*) == 0x8);
    // OvrAvatarHand HandLeft
    // Size: 0x8
    // Offset: 0x1B8
    ::GlobalNamespace::OvrAvatarHand* HandLeft;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OvrAvatarHand*) == 0x8);
    // OvrAvatarHand HandRight
    // Size: 0x8
    // Offset: 0x1C0
    ::GlobalNamespace::OvrAvatarHand* HandRight;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OvrAvatarHand*) == 0x8);
    // ovrAvatarLookAndFeelVersion LookAndFeelVersion
    // Size: 0x4
    // Offset: 0x1C8
    ::GlobalNamespace::ovrAvatarLookAndFeelVersion LookAndFeelVersion;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ovrAvatarLookAndFeelVersion) == 0x4);
    // ovrAvatarLookAndFeelVersion FallbackLookAndFeelVersion
    // Size: 0x4
    // Offset: 0x1CC
    ::GlobalNamespace::ovrAvatarLookAndFeelVersion FallbackLookAndFeelVersion;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ovrAvatarLookAndFeelVersion) == 0x4);
    // private OvrAvatarPacket CurrentUnityPacket
    // Size: 0x8
    // Offset: 0x1D0
    ::GlobalNamespace::OvrAvatarPacket* CurrentUnityPacket;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OvrAvatarPacket*) == 0x8);
    // public System.EventHandler`1<OvrAvatar/PacketEventArgs> PacketRecorded
    // Size: 0x8
    // Offset: 0x1D8
    ::System::EventHandler_1<::GlobalNamespace::OvrAvatar::PacketEventArgs*>* PacketRecorded;
    // Field size check
    static_assert(sizeof(::System::EventHandler_1<::GlobalNamespace::OvrAvatar::PacketEventArgs*>*) == 0x8);
    // public System.Single VoiceAmplitude
    // Size: 0x4
    // Offset: 0x1E0
    float VoiceAmplitude;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Boolean EnableMouthVertexAnimation
    // Size: 0x1
    // Offset: 0x1E4
    bool EnableMouthVertexAnimation;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get static field: static private System.Boolean doneExpressiveGlobalInit
    static bool _get_doneExpressiveGlobalInit();
    // Set static field: static private System.Boolean doneExpressiveGlobalInit
    static void _set_doneExpressiveGlobalInit(bool value);
    // Get static field: static private ovrAvatarVisemes RuntimeVisemes
    static ::GlobalNamespace::ovrAvatarVisemes _get_RuntimeVisemes();
    // Set static field: static private ovrAvatarVisemes RuntimeVisemes
    static void _set_RuntimeVisemes(::GlobalNamespace::ovrAvatarVisemes value);
    // static field const value: static private System.Boolean USE_MOBILE_TEXTURE_FORMAT
    static constexpr const bool USE_MOBILE_TEXTURE_FORMAT = true;
