// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: OVROverlay/OverlayType
#include "GlobalNamespace/OVROverlay.hpp"
// Including type: UnityEngine.Vector4
#include "UnityEngine/Vector4.hpp"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
// Including type: OVRPlugin/InsightPassthroughColorMapType
#include "GlobalNamespace/OVRPlugin_InsightPassthroughColorMapType.hpp"
// Including type: System.Runtime.InteropServices.GCHandle
#include "System/Runtime/InteropServices/GCHandle.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: OVRCameraRig
  class OVRCameraRig;
  // Skipping declaration: ColorMapEditorType because it is already included!
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Gradient
  class Gradient;
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: Matrix4x4
  struct Matrix4x4;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: OVRPassthroughLayer
  class OVRPassthroughLayer;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::OVRPassthroughLayer);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::OVRPassthroughLayer*, "", "OVRPassthroughLayer");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0xD5
  #pragma pack(push, 1)
  // Autogenerated type: OVRPassthroughLayer
  // [TokenAttribute] Offset: FFFFFFFF
  class OVRPassthroughLayer : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::GlobalNamespace::OVRPassthroughLayer::ProjectionSurfaceType
    struct ProjectionSurfaceType;
    // Nested type: ::GlobalNamespace::OVRPassthroughLayer::ColorMapEditorType
    struct ColorMapEditorType;
    // Nested type: ::GlobalNamespace::OVRPassthroughLayer::PassthroughMeshInstance
    struct PassthroughMeshInstance;
    // Nested type: ::GlobalNamespace::OVRPassthroughLayer::DeferredPassthroughMeshAddition
    struct DeferredPassthroughMeshAddition;
    // Nested type: ::GlobalNamespace::OVRPassthroughLayer::$$c__DisplayClass9_0
    class $$c__DisplayClass9_0;
    // Nested type: ::GlobalNamespace::OVRPassthroughLayer::$$c__DisplayClass10_0
    class $$c__DisplayClass10_0;
    // Size: 0x14
    #pragma pack(push, 1)
    // Autogenerated type: OVRPassthroughLayer/ProjectionSurfaceType
    // [TokenAttribute] Offset: FFFFFFFF
    struct ProjectionSurfaceType/*, public ::System::Enum*/ {
      public:
      // Writing base type padding for base size: 0x0 to desired offset: 0x10
      char ___base_padding[0x10] = {};
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x10
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: ProjectionSurfaceType
      constexpr ProjectionSurfaceType(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public OVRPassthroughLayer/ProjectionSurfaceType Reconstructed
      static constexpr const int Reconstructed = 0;
      // Get static field: static public OVRPassthroughLayer/ProjectionSurfaceType Reconstructed
      static ::GlobalNamespace::OVRPassthroughLayer::ProjectionSurfaceType _get_Reconstructed();
      // Set static field: static public OVRPassthroughLayer/ProjectionSurfaceType Reconstructed
      static void _set_Reconstructed(::GlobalNamespace::OVRPassthroughLayer::ProjectionSurfaceType value);
      // static field const value: static public OVRPassthroughLayer/ProjectionSurfaceType UserDefined
      static constexpr const int UserDefined = 1;
      // Get static field: static public OVRPassthroughLayer/ProjectionSurfaceType UserDefined
      static ::GlobalNamespace::OVRPassthroughLayer::ProjectionSurfaceType _get_UserDefined();
      // Set static field: static public OVRPassthroughLayer/ProjectionSurfaceType UserDefined
      static void _set_UserDefined(::GlobalNamespace::OVRPassthroughLayer::ProjectionSurfaceType value);
      // Get instance field reference: public System.Int32 value__
      int& dyn_value__();
    }; // OVRPassthroughLayer/ProjectionSurfaceType
    #pragma pack(pop)
    static check_size<sizeof(OVRPassthroughLayer::ProjectionSurfaceType), 16 + sizeof(int)> __GlobalNamespace_OVRPassthroughLayer_ProjectionSurfaceTypeSizeCheck;
    static_assert(sizeof(OVRPassthroughLayer::ProjectionSurfaceType) == 0x14);
    // Size: 0x14
    #pragma pack(push, 1)
    // Autogenerated type: OVRPassthroughLayer/ColorMapEditorType
    // [TokenAttribute] Offset: FFFFFFFF
    struct ColorMapEditorType/*, public ::System::Enum*/ {
      public:
      // Writing base type padding for base size: 0x0 to desired offset: 0x10
      char ___base_padding[0x10] = {};
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x10
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: ColorMapEditorType
      constexpr ColorMapEditorType(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public OVRPassthroughLayer/ColorMapEditorType None
      static constexpr const int None = 0;
      // Get static field: static public OVRPassthroughLayer/ColorMapEditorType None
      static ::GlobalNamespace::OVRPassthroughLayer::ColorMapEditorType _get_None();
      // Set static field: static public OVRPassthroughLayer/ColorMapEditorType None
      static void _set_None(::GlobalNamespace::OVRPassthroughLayer::ColorMapEditorType value);
      // static field const value: static public OVRPassthroughLayer/ColorMapEditorType Controls
      static constexpr const int Controls = 1;
      // Get static field: static public OVRPassthroughLayer/ColorMapEditorType Controls
      static ::GlobalNamespace::OVRPassthroughLayer::ColorMapEditorType _get_Controls();
      // Set static field: static public OVRPassthroughLayer/ColorMapEditorType Controls
      static void _set_Controls(::GlobalNamespace::OVRPassthroughLayer::ColorMapEditorType value);
      // static field const value: static public OVRPassthroughLayer/ColorMapEditorType Custom
      static constexpr const int Custom = 2;
      // Get static field: static public OVRPassthroughLayer/ColorMapEditorType Custom
      static ::GlobalNamespace::OVRPassthroughLayer::ColorMapEditorType _get_Custom();
      // Set static field: static public OVRPassthroughLayer/ColorMapEditorType Custom
      static void _set_Custom(::GlobalNamespace::OVRPassthroughLayer::ColorMapEditorType value);
      // Get instance field reference: public System.Int32 value__
      int& dyn_value__();
    }; // OVRPassthroughLayer/ColorMapEditorType
    #pragma pack(pop)
    static check_size<sizeof(OVRPassthroughLayer::ColorMapEditorType), 16 + sizeof(int)> __GlobalNamespace_OVRPassthroughLayer_ColorMapEditorTypeSizeCheck;
    static_assert(sizeof(OVRPassthroughLayer::ColorMapEditorType) == 0x14);
    // Size: 0x11
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: OVRPassthroughLayer/PassthroughMeshInstance
    // [TokenAttribute] Offset: FFFFFFFF
    struct PassthroughMeshInstance/*, public ::System::ValueType*/ {
      public:
      public:
      // public System.UInt64 meshHandle
      // Size: 0x8
      // Offset: 0x0
      uint64_t meshHandle;
      // Field size check
      static_assert(sizeof(uint64_t) == 0x8);
      // public System.UInt64 instanceHandle
      // Size: 0x8
      // Offset: 0x8
      uint64_t instanceHandle;
      // Field size check
      static_assert(sizeof(uint64_t) == 0x8);
      // public System.Boolean updateTransform
      // Size: 0x1
      // Offset: 0x10
      bool updateTransform;
      // Field size check
      static_assert(sizeof(bool) == 0x1);
      public:
      // Creating value type constructor for type: PassthroughMeshInstance
      constexpr PassthroughMeshInstance(uint64_t meshHandle_ = {}, uint64_t instanceHandle_ = {}, bool updateTransform_ = {}) noexcept : meshHandle{meshHandle_}, instanceHandle{instanceHandle_}, updateTransform{updateTransform_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public System.UInt64 meshHandle
      uint64_t& dyn_meshHandle();
      // Get instance field reference: public System.UInt64 instanceHandle
      uint64_t& dyn_instanceHandle();
      // Get instance field reference: public System.Boolean updateTransform
      bool& dyn_updateTransform();
    }; // OVRPassthroughLayer/PassthroughMeshInstance
    #pragma pack(pop)
    static check_size<sizeof(OVRPassthroughLayer::PassthroughMeshInstance), 16 + sizeof(bool)> __GlobalNamespace_OVRPassthroughLayer_PassthroughMeshInstanceSizeCheck;
    static_assert(sizeof(OVRPassthroughLayer::PassthroughMeshInstance) == 0x11);
    // Size: 0x9
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: OVRPassthroughLayer/DeferredPassthroughMeshAddition
    // [TokenAttribute] Offset: FFFFFFFF
    struct DeferredPassthroughMeshAddition/*, public ::System::ValueType*/ {
      public:
      public:
      // public UnityEngine.GameObject gameObject
      // Size: 0x8
      // Offset: 0x0
      ::UnityEngine::GameObject* gameObject;
      // Field size check
      static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
      // public System.Boolean updateTransform
      // Size: 0x1
      // Offset: 0x8
      bool updateTransform;
      // Field size check
      static_assert(sizeof(bool) == 0x1);
      public:
      // Creating value type constructor for type: DeferredPassthroughMeshAddition
      constexpr DeferredPassthroughMeshAddition(::UnityEngine::GameObject* gameObject_ = {}, bool updateTransform_ = {}) noexcept : gameObject{gameObject_}, updateTransform{updateTransform_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public UnityEngine.GameObject gameObject
      ::UnityEngine::GameObject*& dyn_gameObject();
      // Get instance field reference: public System.Boolean updateTransform
      bool& dyn_updateTransform();
    }; // OVRPassthroughLayer/DeferredPassthroughMeshAddition
    #pragma pack(pop)
    static check_size<sizeof(OVRPassthroughLayer::DeferredPassthroughMeshAddition), 8 + sizeof(bool)> __GlobalNamespace_OVRPassthroughLayer_DeferredPassthroughMeshAdditionSizeCheck;
    static_assert(sizeof(OVRPassthroughLayer::DeferredPassthroughMeshAddition) == 0x9);
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // public OVRPassthroughLayer/ProjectionSurfaceType projectionSurfaceType
    // Size: 0x14
    // Offset: 0x18
    ::GlobalNamespace::OVRPassthroughLayer::ProjectionSurfaceType projectionSurfaceType;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVRPassthroughLayer::ProjectionSurfaceType) == 0x14);
    // public OVROverlay/OverlayType overlayType
    // Size: 0x14
    // Offset: 0x1C
    ::GlobalNamespace::OVROverlay::OverlayType overlayType;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVROverlay::OverlayType) == 0x14);
    // public System.Int32 compositionDepth
    // Size: 0x4
    // Offset: 0x20
    int compositionDepth;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Boolean hidden
    // Size: 0x1
    // Offset: 0x24
    bool hidden;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean overridePerLayerColorScaleAndOffset
    // Size: 0x1
    // Offset: 0x25
    bool overridePerLayerColorScaleAndOffset;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: overridePerLayerColorScaleAndOffset and: colorScale
    char __padding4[0x2] = {};
    // public UnityEngine.Vector4 colorScale
    // Size: 0x10
    // Offset: 0x28
    ::UnityEngine::Vector4 colorScale;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector4) == 0x10);
    // public UnityEngine.Vector4 colorOffset
    // Size: 0x10
    // Offset: 0x38
    ::UnityEngine::Vector4 colorOffset;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector4) == 0x10);
    // private OVRPassthroughLayer/ColorMapEditorType colorMapEditorType_
    // Size: 0x14
    // Offset: 0x48
    ::GlobalNamespace::OVRPassthroughLayer::ColorMapEditorType colorMapEditorType;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVRPassthroughLayer::ColorMapEditorType) == 0x14);
    // public UnityEngine.Gradient colorMapEditorGradient
    // Size: 0x8
    // Offset: 0x50
    ::UnityEngine::Gradient* colorMapEditorGradient;
    // Field size check
    static_assert(sizeof(::UnityEngine::Gradient*) == 0x8);
    // private UnityEngine.Gradient colorMapEditorGradientOld
    // Size: 0x8
    // Offset: 0x58
    ::UnityEngine::Gradient* colorMapEditorGradientOld;
    // Field size check
    static_assert(sizeof(::UnityEngine::Gradient*) == 0x8);
    // public System.Single colorMapEditorContrast
    // Size: 0x4
    // Offset: 0x60
    float colorMapEditorContrast;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single colorMapEditorContrast_
    // Size: 0x4
    // Offset: 0x64
    float colorMapEditorContrast;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single colorMapEditorBrightness
    // Size: 0x4
    // Offset: 0x68
    float colorMapEditorBrightness;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single colorMapEditorBrightness_
    // Size: 0x4
    // Offset: 0x6C
    float colorMapEditorBrightness;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single colorMapEditorPosterize
    // Size: 0x4
    // Offset: 0x70
    float colorMapEditorPosterize;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single colorMapEditorPosterize_
    // Size: 0x4
    // Offset: 0x74
    float colorMapEditorPosterize;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private OVRCameraRig cameraRig
    // Size: 0x8
    // Offset: 0x78
    ::GlobalNamespace::OVRCameraRig* cameraRig;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVRCameraRig*) == 0x8);
    // private System.Boolean cameraRigInitialized
    // Size: 0x1
    // Offset: 0x80
    bool cameraRigInitialized;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: cameraRigInitialized and: auxGameObject
    char __padding17[0x7] = {};
    // private UnityEngine.GameObject auxGameObject
    // Size: 0x8
    // Offset: 0x88
    ::UnityEngine::GameObject* auxGameObject;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private OVROverlay passthroughOverlay
    // Size: 0x8
    // Offset: 0x90
    ::GlobalNamespace::OVROverlay* passthroughOverlay;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVROverlay*) == 0x8);
    // private System.Collections.Generic.Dictionary`2<UnityEngine.GameObject,OVRPassthroughLayer/PassthroughMeshInstance> surfaceGameObjects
    // Size: 0x8
    // Offset: 0x98
    ::System::Collections::Generic::Dictionary_2<::UnityEngine::GameObject*, ::GlobalNamespace::OVRPassthroughLayer::PassthroughMeshInstance>* surfaceGameObjects;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::UnityEngine::GameObject*, ::GlobalNamespace::OVRPassthroughLayer::PassthroughMeshInstance>*) == 0x8);
    // private System.Collections.Generic.List`1<OVRPassthroughLayer/DeferredPassthroughMeshAddition> deferredSurfaceGameObjects
    // Size: 0x8
    // Offset: 0xA0
    ::System::Collections::Generic::List_1<::GlobalNamespace::OVRPassthroughLayer::DeferredPassthroughMeshAddition>* deferredSurfaceGameObjects;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::GlobalNamespace::OVRPassthroughLayer::DeferredPassthroughMeshAddition>*) == 0x8);
    // private System.Single textureOpacity_
    // Size: 0x4
    // Offset: 0xA8
    float textureOpacity;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean edgeRenderingEnabled_
    // Size: 0x1
    // Offset: 0xAC
    bool edgeRenderingEnabled;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: edgeRenderingEnabled and: edgeColor
    char __padding23[0x3] = {};
    // private UnityEngine.Color edgeColor_
    // Size: 0x10
    // Offset: 0xB0
    ::UnityEngine::Color edgeColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private OVRPlugin/InsightPassthroughColorMapType colorMapType
    // Size: 0x14
    // Offset: 0xC0
    ::GlobalNamespace::OVRPlugin::InsightPassthroughColorMapType colorMapType;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVRPlugin::InsightPassthroughColorMapType) == 0x14);
    // private System.Byte[] colorMapData
    // Size: 0x8
    // Offset: 0xC8
    ::ArrayW<uint8_t> colorMapData;
    // Field size check
    static_assert(sizeof(::ArrayW<uint8_t>) == 0x8);
    // private System.Runtime.InteropServices.GCHandle colorMapDataHandle
    // Size: 0x4
    // Offset: 0xD0
    ::System::Runtime::InteropServices::GCHandle colorMapDataHandle;
    // Field size check
    static_assert(sizeof(::System::Runtime::InteropServices::GCHandle) == 0x4);
    // private System.Boolean styleDirty
    // Size: 0x1
    // Offset: 0xD4
    bool styleDirty;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get static field: static private readonly UnityEngine.Gradient colorMapNeutralGradient
    static ::UnityEngine::Gradient* _get_colorMapNeutralGradient();
    // Set static field: static private readonly UnityEngine.Gradient colorMapNeutralGradient
    static void _set_colorMapNeutralGradient(::UnityEngine::Gradient* value);
    // Get instance field reference: public OVRPassthroughLayer/ProjectionSurfaceType projectionSurfaceType
    ::GlobalNamespace::OVRPassthroughLayer::ProjectionSurfaceType& dyn_projectionSurfaceType();
    // Get instance field reference: public OVROverlay/OverlayType overlayType
    ::GlobalNamespace::OVROverlay::OverlayType& dyn_overlayType();
