// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
// Including type: OvrAvatar
#include "GlobalNamespace/OvrAvatar.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: RoomManager
  class RoomManager;
  // Forward declaring type: RemotePlayer
  class RemotePlayer;
  // Forward declaring type: P2PManager
  class P2PManager;
  // Forward declaring type: VoipManager
  class VoipManager;
  // Skipping declaration: State because it is already included!
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: UIntPtr
  struct UIntPtr;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: MeshRenderer
  class MeshRenderer;
  // Forward declaring type: Material
  class Material;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Forward declaring namespace: Oculus::Platform
namespace Oculus::Platform {
  // Forward declaring type: Message`1<T>
  template<typename T>
  class Message_1;
  // Forward declaring type: Message
  class Message;
}
// Forward declaring namespace: Oculus::Platform::Models
namespace Oculus::Platform::Models {
  // Forward declaring type: PlatformInitialize
  class PlatformInitialize;
  // Forward declaring type: User
  class User;
  // Forward declaring type: UserAndRoomList
  class UserAndRoomList;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: SocialPlatformManager
  class SocialPlatformManager;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::SocialPlatformManager);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::SocialPlatformManager*, "", "SocialPlatformManager");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0xC0
  #pragma pack(push, 1)
  // Autogenerated type: SocialPlatformManager
  // [TokenAttribute] Offset: FFFFFFFF
  class SocialPlatformManager : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::GlobalNamespace::SocialPlatformManager::State
    struct State;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: SocialPlatformManager/State
    // [TokenAttribute] Offset: FFFFFFFF
    struct State/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: State
      constexpr State(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public SocialPlatformManager/State INITIALIZING
      static constexpr const int INITIALIZING = 0;
      // Get static field: static public SocialPlatformManager/State INITIALIZING
      static ::GlobalNamespace::SocialPlatformManager::State _get_INITIALIZING();
      // Set static field: static public SocialPlatformManager/State INITIALIZING
      static void _set_INITIALIZING(::GlobalNamespace::SocialPlatformManager::State value);
      // static field const value: static public SocialPlatformManager/State CHECKING_LAUNCH_STATE
      static constexpr const int CHECKING_LAUNCH_STATE = 1;
      // Get static field: static public SocialPlatformManager/State CHECKING_LAUNCH_STATE
      static ::GlobalNamespace::SocialPlatformManager::State _get_CHECKING_LAUNCH_STATE();
      // Set static field: static public SocialPlatformManager/State CHECKING_LAUNCH_STATE
      static void _set_CHECKING_LAUNCH_STATE(::GlobalNamespace::SocialPlatformManager::State value);
      // static field const value: static public SocialPlatformManager/State CREATING_A_ROOM
      static constexpr const int CREATING_A_ROOM = 2;
      // Get static field: static public SocialPlatformManager/State CREATING_A_ROOM
      static ::GlobalNamespace::SocialPlatformManager::State _get_CREATING_A_ROOM();
      // Set static field: static public SocialPlatformManager/State CREATING_A_ROOM
      static void _set_CREATING_A_ROOM(::GlobalNamespace::SocialPlatformManager::State value);
      // static field const value: static public SocialPlatformManager/State WAITING_IN_A_ROOM
      static constexpr const int WAITING_IN_A_ROOM = 3;
      // Get static field: static public SocialPlatformManager/State WAITING_IN_A_ROOM
      static ::GlobalNamespace::SocialPlatformManager::State _get_WAITING_IN_A_ROOM();
      // Set static field: static public SocialPlatformManager/State WAITING_IN_A_ROOM
      static void _set_WAITING_IN_A_ROOM(::GlobalNamespace::SocialPlatformManager::State value);
      // static field const value: static public SocialPlatformManager/State JOINING_A_ROOM
      static constexpr const int JOINING_A_ROOM = 4;
      // Get static field: static public SocialPlatformManager/State JOINING_A_ROOM
      static ::GlobalNamespace::SocialPlatformManager::State _get_JOINING_A_ROOM();
      // Set static field: static public SocialPlatformManager/State JOINING_A_ROOM
      static void _set_JOINING_A_ROOM(::GlobalNamespace::SocialPlatformManager::State value);
      // static field const value: static public SocialPlatformManager/State CONNECTED_IN_A_ROOM
      static constexpr const int CONNECTED_IN_A_ROOM = 5;
      // Get static field: static public SocialPlatformManager/State CONNECTED_IN_A_ROOM
      static ::GlobalNamespace::SocialPlatformManager::State _get_CONNECTED_IN_A_ROOM();
      // Set static field: static public SocialPlatformManager/State CONNECTED_IN_A_ROOM
      static void _set_CONNECTED_IN_A_ROOM(::GlobalNamespace::SocialPlatformManager::State value);
      // static field const value: static public SocialPlatformManager/State LEAVING_A_ROOM
      static constexpr const int LEAVING_A_ROOM = 6;
      // Get static field: static public SocialPlatformManager/State LEAVING_A_ROOM
      static ::GlobalNamespace::SocialPlatformManager::State _get_LEAVING_A_ROOM();
      // Set static field: static public SocialPlatformManager/State LEAVING_A_ROOM
      static void _set_LEAVING_A_ROOM(::GlobalNamespace::SocialPlatformManager::State value);
      // static field const value: static public SocialPlatformManager/State SHUTDOWN
      static constexpr const int SHUTDOWN = 7;
      // Get static field: static public SocialPlatformManager/State SHUTDOWN
      static ::GlobalNamespace::SocialPlatformManager::State _get_SHUTDOWN();
      // Set static field: static public SocialPlatformManager/State SHUTDOWN
      static void _set_SHUTDOWN(::GlobalNamespace::SocialPlatformManager::State value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated]] int& dyn_value__();
    }; // SocialPlatformManager/State
    #pragma pack(pop)
    static check_size<sizeof(SocialPlatformManager::State), 0 + sizeof(int)> __GlobalNamespace_SocialPlatformManager_StateSizeCheck;
    static_assert(sizeof(SocialPlatformManager::State) == 0x4);
    public:
    // private System.Single voiceCurrent
    // Size: 0x4
    // Offset: 0x18
    float voiceCurrent;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.UInt32 packetSequence
    // Size: 0x4
    // Offset: 0x1C
    uint packetSequence;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // public OvrAvatar localAvatarPrefab
    // Size: 0x8
    // Offset: 0x20
    ::GlobalNamespace::OvrAvatar* localAvatarPrefab;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OvrAvatar*) == 0x8);
    // public OvrAvatar remoteAvatarPrefab
    // Size: 0x8
    // Offset: 0x28
    ::GlobalNamespace::OvrAvatar* remoteAvatarPrefab;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OvrAvatar*) == 0x8);
    // public UnityEngine.GameObject helpPanel
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::GameObject* helpPanel;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // protected UnityEngine.MeshRenderer helpMesh
    // Size: 0x8
    // Offset: 0x38
    ::UnityEngine::MeshRenderer* helpMesh;
    // Field size check
    static_assert(sizeof(::UnityEngine::MeshRenderer*) == 0x8);
    // public UnityEngine.Material riftMaterial
    // Size: 0x8
    // Offset: 0x40
    ::UnityEngine::Material* riftMaterial;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // public UnityEngine.Material gearMaterial
    // Size: 0x8
    // Offset: 0x48
    ::UnityEngine::Material* gearMaterial;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // protected OvrAvatar localAvatar
    // Size: 0x8
    // Offset: 0x50
    ::GlobalNamespace::OvrAvatar* localAvatar;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OvrAvatar*) == 0x8);
    // protected UnityEngine.GameObject localTrackingSpace
    // Size: 0x8
    // Offset: 0x58
    ::UnityEngine::GameObject* localTrackingSpace;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // protected UnityEngine.GameObject localPlayerHead
    // Size: 0x8
    // Offset: 0x60
    ::UnityEngine::GameObject* localPlayerHead;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // protected System.Collections.Generic.Dictionary`2<System.UInt64,RemotePlayer> remoteUsers
    // Size: 0x8
    // Offset: 0x68
    ::System::Collections::Generic::Dictionary_2<uint64_t, ::GlobalNamespace::RemotePlayer*>* remoteUsers;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<uint64_t, ::GlobalNamespace::RemotePlayer*>*) == 0x8);
    // public UnityEngine.GameObject roomSphere
    // Size: 0x8
    // Offset: 0x70
    ::UnityEngine::GameObject* roomSphere;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // protected UnityEngine.MeshRenderer sphereMesh
    // Size: 0x8
    // Offset: 0x78
    ::UnityEngine::MeshRenderer* sphereMesh;
    // Field size check
    static_assert(sizeof(::UnityEngine::MeshRenderer*) == 0x8);
    // public UnityEngine.GameObject roomFloor
    // Size: 0x8
    // Offset: 0x80
    ::UnityEngine::GameObject* roomFloor;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // protected UnityEngine.MeshRenderer floorMesh
    // Size: 0x8
    // Offset: 0x88
    ::UnityEngine::MeshRenderer* floorMesh;
    // Field size check
    static_assert(sizeof(::UnityEngine::MeshRenderer*) == 0x8);
    // protected SocialPlatformManager/State currentState
    // Size: 0x4
    // Offset: 0x90
    ::GlobalNamespace::SocialPlatformManager::State currentState;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::SocialPlatformManager::State) == 0x4);
    // Padding between fields: currentState and: roomManager
    char __padding16[0x4] = {};
    // protected RoomManager roomManager
    // Size: 0x8
    // Offset: 0x98
    ::GlobalNamespace::RoomManager* roomManager;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::RoomManager*) == 0x8);
    // protected P2PManager p2pManager
    // Size: 0x8
    // Offset: 0xA0
    ::GlobalNamespace::P2PManager* p2pManager;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::P2PManager*) == 0x8);
    // protected VoipManager voipManager
    // Size: 0x8
    // Offset: 0xA8
    ::GlobalNamespace::VoipManager* voipManager;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::VoipManager*) == 0x8);
    // protected System.UInt64 myID
    // Size: 0x8
    // Offset: 0xB0
    uint64_t myID;
    // Field size check
    static_assert(sizeof(uint64_t) == 0x8);
    // protected System.String myOculusID
    // Size: 0x8
    // Offset: 0xB8
    ::StringW myOculusID;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get static field: static private readonly UnityEngine.Vector3 START_ROTATION_ONE
    static ::UnityEngine::Vector3 _get_START_ROTATION_ONE();
    // Set static field: static private readonly UnityEngine.Vector3 START_ROTATION_ONE
    static void _set_START_ROTATION_ONE(::UnityEngine::Vector3 value);
    // Get static field: static private readonly UnityEngine.Vector3 START_POSITION_ONE
    static ::UnityEngine::Vector3 _get_START_POSITION_ONE();
    // Set static field: static private readonly UnityEngine.Vector3 START_POSITION_ONE
    static void _set_START_POSITION_ONE(::UnityEngine::Vector3 value);
    // Get static field: static private readonly UnityEngine.Vector3 START_ROTATION_TWO
