// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: TMPro.TMP_Text
#include "TMPro/TMP_Text.hpp"
// Including type: UnityEngine.UI.ILayoutElement
#include "UnityEngine/UI/ILayoutElement.hpp"
// Including type: TMPro.MaskingTypes
#include "TMPro/MaskingTypes.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Renderer
  class Renderer;
  // Forward declaring type: MeshFilter
  class MeshFilter;
  // Skipping declaration: Vector4 because it is already included!
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: Mesh
  class Mesh;
  // Forward declaring type: Material
  class Material;
  // Skipping declaration: Color32 because it is already included!
  // Forward declaring type: Bounds
  struct Bounds;
}
// Forward declaring namespace: TMPro
namespace TMPro {
  // Forward declaring type: TMP_SubMesh
  class TMP_SubMesh;
  // Forward declaring type: TMP_TextInfo
  class TMP_TextInfo;
  // Forward declaring type: TextContainer
  class TextContainer;
  // Forward declaring type: TMP_VertexDataUpdateFlags
  struct TMP_VertexDataUpdateFlags;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
}
// Forward declaring namespace: UnityEngine::UI
namespace UnityEngine::UI {
  // Forward declaring type: CanvasUpdate
  struct CanvasUpdate;
}
// Completed forward declares
// Type namespace: TMPro
namespace TMPro {
  // Forward declaring type: TextMeshPro
  class TextMeshPro;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::TMPro::TextMeshPro);
DEFINE_IL2CPP_ARG_TYPE(::TMPro::TextMeshPro*, "TMPro", "TextMeshPro");
// Type namespace: TMPro
namespace TMPro {
  // WARNING Size may be invalid!
  // Autogenerated type: TMPro.TextMeshPro
  // [TokenAttribute] Offset: FFFFFFFF
  // [DisallowMultipleComponent] Offset: FFFFFFFF
  // [RequireComponent] Offset: 59DDA0
  // [AddComponentMenu] Offset: 59DDA0
  // [ExecuteAlways] Offset: FFFFFFFF
  // [HelpURLAttribute] Offset: 59DDA0
  class TextMeshPro : public ::TMPro::TMP_Text/*, public ::UnityEngine::UI::ILayoutElement*/ {
    public:
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // private System.Boolean m_hasFontAssetChanged
    // Size: 0x1
    // Offset: 0x6C0
    bool m_hasFontAssetChanged;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Single m_previousLossyScaleY
    // Size: 0x4
    // Offset: 0x6C4
    float m_previousLossyScaleY;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Renderer m_renderer
    // Size: 0x8
    // Offset: 0x6C8
    ::UnityEngine::Renderer* m_renderer;
    // Field size check
    static_assert(sizeof(::UnityEngine::Renderer*) == 0x8);
    // private UnityEngine.MeshFilter m_meshFilter
    // Size: 0x8
    // Offset: 0x6D0
    ::UnityEngine::MeshFilter* m_meshFilter;
    // Field size check
    static_assert(sizeof(::UnityEngine::MeshFilter*) == 0x8);
    // private System.Boolean m_isFirstAllocation
    // Size: 0x1
    // Offset: 0x6D8
    bool m_isFirstAllocation;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Int32 m_max_characters
    // Size: 0x4
    // Offset: 0x6DC
    int m_max_characters;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 m_max_numberOfLines
    // Size: 0x4
    // Offset: 0x6E0
    int m_max_numberOfLines;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private TMPro.TMP_SubMesh[] m_subTextObjects
    // Size: 0x8
    // Offset: 0x6E8
    ::ArrayW<::TMPro::TMP_SubMesh*> m_subTextObjects;
    // Field size check
    static_assert(sizeof(::ArrayW<::TMPro::TMP_SubMesh*>) == 0x8);
    // private TMPro.MaskingTypes m_maskType
    // Size: 0x14
    // Offset: 0x6F0
    ::TMPro::MaskingTypes m_maskType;
    // Field size check
    static_assert(sizeof(::TMPro::MaskingTypes) == 0x14);
    // private UnityEngine.Matrix4x4 m_EnvMapMatrix
    // Size: 0x40
    // Offset: 0x6F4
    ::UnityEngine::Matrix4x4 m_EnvMapMatrix;
    // Field size check
    static_assert(sizeof(::UnityEngine::Matrix4x4) == 0x40);
    // private UnityEngine.Vector3[] m_RectTransformCorners
    // Size: 0x8
    // Offset: 0x738
    ::ArrayW<::UnityEngine::Vector3> m_RectTransformCorners;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Vector3>) == 0x8);
    // private System.Boolean m_isRegisteredForEvents
    // Size: 0x1
    // Offset: 0x740
    bool m_isRegisteredForEvents;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // System.Int32 _SortingLayer
    // Size: 0x4
    // Offset: 0x744
    int SortingLayer;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Int32 _SortingLayerID
    // Size: 0x4
    // Offset: 0x748
    int SortingLayerID;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Int32 _SortingOrder
    // Size: 0x4
    // Offset: 0x74C
    int SortingOrder;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Action`1<TMPro.TMP_TextInfo> OnPreRenderText
    // Size: 0x8
    // Offset: 0x750
    ::System::Action_1<::TMPro::TMP_TextInfo*>* OnPreRenderText;
    // Field size check
    static_assert(sizeof(::System::Action_1<::TMPro::TMP_TextInfo*>*) == 0x8);
    // private System.Boolean m_currentAutoSizeMode
    // Size: 0x1
    // Offset: 0x758
    bool m_currentAutoSizeMode;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Creating interface conversion operator: operator ::UnityEngine::UI::ILayoutElement
    operator ::UnityEngine::UI::ILayoutElement() noexcept {
      return *reinterpret_cast<::UnityEngine::UI::ILayoutElement*>(this);
    }
    // Get static field: static private Unity.Profiling.ProfilerMarker k_GenerateTextMarker
    static ::Unity::Profiling::ProfilerMarker _get_k_GenerateTextMarker();
    // Set static field: static private Unity.Profiling.ProfilerMarker k_GenerateTextMarker
    static void _set_k_GenerateTextMarker(::Unity::Profiling::ProfilerMarker value);
    // Get static field: static private Unity.Profiling.ProfilerMarker k_SetArraySizesMarker
    static ::Unity::Profiling::ProfilerMarker _get_k_SetArraySizesMarker();
    // Set static field: static private Unity.Profiling.ProfilerMarker k_SetArraySizesMarker
