// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: TMPro.TMP_Text
#include "TMPro/TMP_Text.hpp"
// Including type: UnityEngine.UI.ILayoutElement
#include "UnityEngine/UI/ILayoutElement.hpp"
// Including type: UnityEngine.Rect
#include "UnityEngine/Rect.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: TMPro
namespace TMPro {
  // Forward declaring type: TMP_SubMeshUI
  class TMP_SubMeshUI;
  // Forward declaring type: TMP_TextInfo
  class TMP_TextInfo;
  // Forward declaring type: TMP_VertexDataUpdateFlags
  struct TMP_VertexDataUpdateFlags;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: CanvasRenderer
  class CanvasRenderer;
  // Forward declaring type: Canvas
  class Canvas;
  // Forward declaring type: Material
  class Material;
  // Forward declaring type: Coroutine
  class Coroutine;
  // Forward declaring type: Mesh
  class Mesh;
  // Skipping declaration: Color32 because it is already included!
  // Forward declaring type: Bounds
  struct Bounds;
  // Skipping declaration: Color because it is already included!
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Forward declaring namespace: UnityEngine::UI
namespace UnityEngine::UI {
  // Forward declaring type: CanvasUpdate
  struct CanvasUpdate;
}
// Completed forward declares
// Type namespace: TMPro
namespace TMPro {
  // Forward declaring type: TextMeshProUGUI
  class TextMeshProUGUI;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::TMPro::TextMeshProUGUI);
DEFINE_IL2CPP_ARG_TYPE(::TMPro::TextMeshProUGUI*, "TMPro", "TextMeshProUGUI");
// Type namespace: TMPro
namespace TMPro {
  // WARNING Size may be invalid!
  // Autogenerated type: TMPro.TextMeshProUGUI
  // [TokenAttribute] Offset: FFFFFFFF
  // [RequireComponent] Offset: 6B201C
  // [DisallowMultipleComponent] Offset: FFFFFFFF
  // [AddComponentMenu] Offset: 6B201C
  // [ExecuteAlways] Offset: FFFFFFFF
  // [RequireComponent] Offset: 6B201C
  // [HelpURLAttribute] Offset: 6B201C
  class TextMeshProUGUI : public ::TMPro::TMP_Text/*, public ::UnityEngine::UI::ILayoutElement*/ {
    public:
    // Nested type: ::TMPro::TextMeshProUGUI::$DelayedGraphicRebuild$d__89
    class $DelayedGraphicRebuild$d__89;
    // Nested type: ::TMPro::TextMeshProUGUI::$DelayedMaterialRebuild$d__90
    class $DelayedMaterialRebuild$d__90;
    public:
    // private System.Boolean m_hasFontAssetChanged
    // Size: 0x1
    // Offset: 0x6C0
    bool m_hasFontAssetChanged;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected TMPro.TMP_SubMeshUI[] m_subTextObjects
    // Size: 0x8
    // Offset: 0x6C8
    ::ArrayW<::TMPro::TMP_SubMeshUI*> m_subTextObjects;
    // Field size check
    static_assert(sizeof(::ArrayW<::TMPro::TMP_SubMeshUI*>) == 0x8);
    // private System.Single m_previousLossyScaleY
    // Size: 0x4
    // Offset: 0x6D0
    float m_previousLossyScaleY;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Vector3[] m_RectTransformCorners
    // Size: 0x8
    // Offset: 0x6D8
    ::ArrayW<::UnityEngine::Vector3> m_RectTransformCorners;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Vector3>) == 0x8);
    // private UnityEngine.CanvasRenderer m_canvasRenderer
    // Size: 0x8
    // Offset: 0x6E0
    ::UnityEngine::CanvasRenderer* m_canvasRenderer;
    // Field size check
    static_assert(sizeof(::UnityEngine::CanvasRenderer*) == 0x8);
    // private UnityEngine.Canvas m_canvas
    // Size: 0x8
    // Offset: 0x6E8
    ::UnityEngine::Canvas* m_canvas;
    // Field size check
    static_assert(sizeof(::UnityEngine::Canvas*) == 0x8);
    // private System.Single m_CanvasScaleFactor
    // Size: 0x4
    // Offset: 0x6F0
    float m_CanvasScaleFactor;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean m_isFirstAllocation
    // Size: 0x1
    // Offset: 0x6F4
    bool m_isFirstAllocation;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Int32 m_max_characters
    // Size: 0x4
    // Offset: 0x6F8
    int m_max_characters;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private UnityEngine.Material m_baseMaterial
    // Size: 0x8
    // Offset: 0x700
    ::UnityEngine::Material* m_baseMaterial;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // private System.Boolean m_isScrollRegionSet
    // Size: 0x1
    // Offset: 0x708
    bool m_isScrollRegionSet;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private UnityEngine.Vector4 m_maskOffset
    // Size: 0x10
    // Offset: 0x70C
    ::UnityEngine::Vector4 m_maskOffset;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector4) == 0x10);
    // private UnityEngine.Matrix4x4 m_EnvMapMatrix
    // Size: 0x40
    // Offset: 0x71C
    ::UnityEngine::Matrix4x4 m_EnvMapMatrix;
    // Field size check
    static_assert(sizeof(::UnityEngine::Matrix4x4) == 0x40);
    // private System.Boolean m_isRegisteredForEvents
    // Size: 0x1
    // Offset: 0x75C
    bool m_isRegisteredForEvents;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_isRebuildingLayout
    // Size: 0x1
    // Offset: 0x75D
    bool m_isRebuildingLayout;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private UnityEngine.Coroutine m_DelayedGraphicRebuild
    // Size: 0x8
    // Offset: 0x760
    ::UnityEngine::Coroutine* m_DelayedGraphicRebuild;
    // Field size check
    static_assert(sizeof(::UnityEngine::Coroutine*) == 0x8);
    // private UnityEngine.Coroutine m_DelayedMaterialRebuild
    // Size: 0x8
    // Offset: 0x768
    ::UnityEngine::Coroutine* m_DelayedMaterialRebuild;
    // Field size check
    static_assert(sizeof(::UnityEngine::Coroutine*) == 0x8);
    // private UnityEngine.Rect m_ClipRect
    // Size: 0x10
    // Offset: 0x770
    ::UnityEngine::Rect m_ClipRect;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rect) == 0x10);
    // private System.Boolean m_ValidRect
    // Size: 0x1
    // Offset: 0x780
    bool m_ValidRect;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Action`1<TMPro.TMP_TextInfo> OnPreRenderText
    // Size: 0x8
    // Offset: 0x788
    ::System::Action_1<::TMPro::TMP_TextInfo*>* OnPreRenderText;
    // Field size check
    static_assert(sizeof(::System::Action_1<::TMPro::TMP_TextInfo*>*) == 0x8);
    public:
    // Creating interface conversion operator: operator ::UnityEngine::UI::ILayoutElement
    operator ::UnityEngine::UI::ILayoutElement() noexcept {
      return *reinterpret_cast<::UnityEngine::UI::ILayoutElement*>(this);
    }
    // Get static field: static private Unity.Profiling.ProfilerMarker k_GenerateTextMarker
    static ::Unity::Profiling::ProfilerMarker _get_k_GenerateTextMarker();
    // Set static field: static private Unity.Profiling.ProfilerMarker k_GenerateTextMarker
    static void _set_k_GenerateTextMarker(::Unity::Profiling::ProfilerMarker value);
    // Get static field: static private Unity.Profiling.ProfilerMarker k_SetArraySizesMarker
    static ::Unity::Profiling::ProfilerMarker _get_k_SetArraySizesMarker();
