// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.UI.MaskableGraphic
#include "UnityEngine/UI/MaskableGraphic.hpp"
// Including type: TMPro.ColorMode
#include "TMPro/ColorMode.hpp"
// Including type: TMPro.VertexGradient
#include "TMPro/VertexGradient.hpp"
// Including type: TMPro.TMP_TextProcessingStack`1
#include "TMPro/TMP_TextProcessingStack_1.hpp"
// Including type: TMPro.FontWeight
#include "TMPro/FontWeight.hpp"
// Including type: TMPro.FontStyles
#include "TMPro/FontStyles.hpp"
// Including type: TMPro.TMP_FontStyleStack
#include "TMPro/TMP_FontStyleStack.hpp"
// Including type: TMPro.HorizontalAlignmentOptions
#include "TMPro/HorizontalAlignmentOptions.hpp"
// Including type: TMPro.VerticalAlignmentOptions
#include "TMPro/VerticalAlignmentOptions.hpp"
// Including type: TMPro.TextAlignmentOptions
#include "TMPro/TextAlignmentOptions.hpp"
// Including type: TMPro.TextOverflowModes
#include "TMPro/TextOverflowModes.hpp"
// Including type: TMPro.TextureMappingOptions
#include "TMPro/TextureMappingOptions.hpp"
// Including type: TMPro.TextRenderFlags
#include "TMPro/TextRenderFlags.hpp"
// Including type: TMPro.VertexSortingOrder
#include "TMPro/VertexSortingOrder.hpp"
// Including type: UnityEngine.Matrix4x4

// Including type: Unity.Profiling.ProfilerMarker
#include "Unity/Profiling/ProfilerMarker.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: TMPro
namespace TMPro {
  // Forward declaring type: TMP_TextElement
  class TMP_TextElement;
  // Forward declaring type: ITextPreprocessor
  class ITextPreprocessor;
  // Forward declaring type: TMP_FontAsset
  class TMP_FontAsset;
  // Forward declaring type: TMP_ColorGradient
  class TMP_ColorGradient;
  // Forward declaring type: TMP_SpriteAsset
  class TMP_SpriteAsset;
  // Forward declaring type: TMP_StyleSheet
  class TMP_StyleSheet;
  // Forward declaring type: TMP_Style
  class TMP_Style;
  // Forward declaring type: TMP_TextInfo
  class TMP_TextInfo;
  // Forward declaring type: TMP_SpriteAnimator
  class TMP_SpriteAnimator;
  // Forward declaring type: TMP_VertexDataUpdateFlags
  struct TMP_VertexDataUpdateFlags;
  // Skipping declaration: TextBackingContainer because it is already included!
  // Forward declaring type: TMP_Character
  class TMP_Character;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Bounds
  struct Bounds;
  // Forward declaring type: Material
  class Material;
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: RectTransform
  class RectTransform;
  // Forward declaring type: Mesh
  class Mesh;
  // Forward declaring type: Rect
  struct Rect;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Func`3<T1, T2, TResult>
  template<typename T1, typename T2, typename TResult>
  class Func_3;
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Forward declaring namespace: UnityEngine::UI
namespace UnityEngine::UI {
  // Forward declaring type: LayoutElement
  class LayoutElement;
}
// Forward declaring namespace: System::Text
namespace System::Text {
  // Forward declaring type: StringBuilder
  class StringBuilder;
}
// Completed forward declares
// Type namespace: TMPro
namespace TMPro {
  // Forward declaring type: TMP_Text
  class TMP_Text;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::TMPro::TMP_Text);
DEFINE_IL2CPP_ARG_TYPE(::TMPro::TMP_Text*, "TMPro", "TMP_Text");
// Type namespace: TMPro
namespace TMPro {
  // WARNING Size may be invalid!
  // Autogenerated type: TMPro.TMP_Text
  // [TokenAttribute] Offset: FFFFFFFF
  class TMP_Text : public ::UnityEngine::UI::MaskableGraphic {
    public:
    // Nested type: ::TMPro::TMP_Text::CharacterSubstitution
    struct CharacterSubstitution;
    // Nested type: ::TMPro::TMP_Text::TextInputSources
    struct TextInputSources;
    // Nested type: ::TMPro::TMP_Text::UnicodeChar
    struct UnicodeChar;
    // Nested type: ::TMPro::TMP_Text::SpecialCharacter
    struct SpecialCharacter;
    // Nested type: ::TMPro::TMP_Text::TextBackingContainer
    struct TextBackingContainer;
    // Nested type: ::TMPro::TMP_Text::$$c
    class $$c;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: TMPro.TMP_Text/TMPro.TextInputSources
    // [TokenAttribute] Offset: FFFFFFFF
    struct TextInputSources/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: TextInputSources
      constexpr TextInputSources(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public TMPro.TMP_Text/TMPro.TextInputSources TextInputBox
      static constexpr const int TextInputBox = 0;
      // Get static field: static public TMPro.TMP_Text/TMPro.TextInputSources TextInputBox
      static ::TMPro::TMP_Text::TextInputSources _get_TextInputBox();
      // Set static field: static public TMPro.TMP_Text/TMPro.TextInputSources TextInputBox
      static void _set_TextInputBox(::TMPro::TMP_Text::TextInputSources value);
      // static field const value: static public TMPro.TMP_Text/TMPro.TextInputSources SetText
      static constexpr const int SetText = 1;
      // Get static field: static public TMPro.TMP_Text/TMPro.TextInputSources SetText
      static ::TMPro::TMP_Text::TextInputSources _get_SetText();
      // Set static field: static public TMPro.TMP_Text/TMPro.TextInputSources SetText
      static void _set_SetText(::TMPro::TMP_Text::TextInputSources value);
      // static field const value: static public TMPro.TMP_Text/TMPro.TextInputSources SetTextArray
      static constexpr const int SetTextArray = 2;
      // Get static field: static public TMPro.TMP_Text/TMPro.TextInputSources SetTextArray
      static ::TMPro::TMP_Text::TextInputSources _get_SetTextArray();
      // Set static field: static public TMPro.TMP_Text/TMPro.TextInputSources SetTextArray
      static void _set_SetTextArray(::TMPro::TMP_Text::TextInputSources value);
      // static field const value: static public TMPro.TMP_Text/TMPro.TextInputSources TextString
      static constexpr const int TextString = 3;
      // Get static field: static public TMPro.TMP_Text/TMPro.TextInputSources TextString
      static ::TMPro::TMP_Text::TextInputSources _get_TextString();
      // Set static field: static public TMPro.TMP_Text/TMPro.TextInputSources TextString
      static void _set_TextString(::TMPro::TMP_Text::TextInputSources value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated]] int& dyn_value__();
    }; // TMPro.TMP_Text/TMPro.TextInputSources
    #pragma pack(pop)
    static check_size<sizeof(TMP_Text::TextInputSources), 0 + sizeof(int)> __TMPro_TMP_Text_TextInputSourcesSizeCheck;
    static_assert(sizeof(TMP_Text::TextInputSources) == 0x4);
    // Size: 0xC
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: TMPro.TMP_Text/TMPro.UnicodeChar
    // [TokenAttribute] Offset: FFFFFFFF
    // [DebuggerDisplayAttribute] Offset: 6B1E8C
    struct UnicodeChar/*, public ::System::ValueType*/ {
      public:
      public:
      // public System.Int32 unicode
      // Size: 0x4
      // Offset: 0x0
      int unicode;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // public System.Int32 stringIndex
      // Size: 0x4
      // Offset: 0x4
      int stringIndex;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // public System.Int32 length
      // Size: 0x4
      // Offset: 0x8
      int length;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: UnicodeChar
      constexpr UnicodeChar(int unicode_ = {}, int stringIndex_ = {}, int length_ = {}) noexcept : unicode{unicode_}, stringIndex{stringIndex_}, length{length_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public System.Int32 unicode
      [[deprecated]] int& dyn_unicode();
      // Get instance field reference: public System.Int32 stringIndex
      [[deprecated]] int& dyn_stringIndex();
      // Get instance field reference: public System.Int32 length
      [[deprecated]] int& dyn_length();
    }; // TMPro.TMP_Text/TMPro.UnicodeChar
    #pragma pack(pop)
    static check_size<sizeof(TMP_Text::UnicodeChar), 8 + sizeof(int)> __TMPro_TMP_Text_UnicodeCharSizeCheck;
    static_assert(sizeof(TMP_Text::UnicodeChar) == 0xC);
    // Size: 0x1C
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: TMPro.TMP_Text/TMPro.SpecialCharacter
    // [TokenAttribute] Offset: FFFFFFFF
    struct SpecialCharacter/*, public ::System::ValueType*/ {
      public:
      public:
      // public TMPro.TMP_Character character
      // Size: 0x8
      // Offset: 0x0
      ::TMPro::TMP_Character* character;
      // Field size check
      static_assert(sizeof(::TMPro::TMP_Character*) == 0x8);
      // public TMPro.TMP_FontAsset fontAsset
      // Size: 0x8
      // Offset: 0x8
      ::TMPro::TMP_FontAsset* fontAsset;
      // Field size check
      static_assert(sizeof(::TMPro::TMP_FontAsset*) == 0x8);
      // public UnityEngine.Material material
      // Size: 0x8
      // Offset: 0x10
      ::UnityEngine::Material* material;
      // Field size check
      static_assert(sizeof(::UnityEngine::Material*) == 0x8);
      // public System.Int32 materialIndex
      // Size: 0x4
      // Offset: 0x18
      int materialIndex;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: SpecialCharacter
      constexpr SpecialCharacter(::TMPro::TMP_Character* character_ = {}, ::TMPro::TMP_FontAsset* fontAsset_ = {}, ::UnityEngine::Material* material_ = {}, int materialIndex_ = {}) noexcept : character{character_}, fontAsset{fontAsset_}, material{material_}, materialIndex{materialIndex_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public TMPro.TMP_Character character
      [[deprecated]] ::TMPro::TMP_Character*& dyn_character();
      // Get instance field reference: public TMPro.TMP_FontAsset fontAsset
      [[deprecated]] ::TMPro::TMP_FontAsset*& dyn_fontAsset();
      // Get instance field reference: public UnityEngine.Material material
      [[deprecated]] ::UnityEngine::Material*& dyn_material();
      // Get instance field reference: public System.Int32 materialIndex
      [[deprecated]] int& dyn_materialIndex();
      // public System.Void .ctor(TMPro.TMP_Character character, System.Int32 materialIndex)
      // Offset: 0x1821C6C
      SpecialCharacter(::TMPro::TMP_Character* character, int materialIndex);
    }; // TMPro.TMP_Text/TMPro.SpecialCharacter
    #pragma pack(pop)
    static check_size<sizeof(TMP_Text::SpecialCharacter), 24 + sizeof(int)> __TMPro_TMP_Text_SpecialCharacterSizeCheck;
    static_assert(sizeof(TMP_Text::SpecialCharacter) == 0x1C);
    // Size: 0xC
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: TMPro.TMP_Text/TMPro.TextBackingContainer
    // [TokenAttribute] Offset: FFFFFFFF
    // [DefaultMemberAttribute] Offset: 6B1EC4
    struct TextBackingContainer/*, public ::System::ValueType*/ {
      public:
      public:
      // private System.UInt32[] m_Array
      // Size: 0x8
      // Offset: 0x0
      ::ArrayW<uint> m_Array;
      // Field size check
      static_assert(sizeof(::ArrayW<uint>) == 0x8);
      // private System.Int32 m_Count
      // Size: 0x4
      // Offset: 0x8
      int m_Count;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: TextBackingContainer
      constexpr TextBackingContainer(::ArrayW<uint> m_Array_ = ::ArrayW<uint>(static_cast<void*>(nullptr)), int m_Count_ = {}) noexcept : m_Array{m_Array_}, m_Count{m_Count_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: private System.UInt32[] m_Array
      [[deprecated]] ::ArrayW<uint>& dyn_m_Array();
      // Get instance field reference: private System.Int32 m_Count
      [[deprecated]] int& dyn_m_Count();
      // public System.Int32 get_Capacity()
      // Offset: 0x1821D64
      int get_Capacity();
      // public System.Int32 get_Count()
      // Offset: 0x1821D80
      int get_Count();
      // public System.Void set_Count(System.Int32 value)
      // Offset: 0x1821D88
      void set_Count(int value);
      // public System.UInt32 get_Item(System.Int32 index)
      // Offset: 0x1821D90
      uint get_Item(int index);
      // public System.Void set_Item(System.Int32 index, System.UInt32 value)
      // Offset: 0x1821DCC
      void set_Item(int index, uint value);
      // public System.Void .ctor(System.Int32 size)
      // Offset: 0x1821EA8
      TextBackingContainer(int size);
      // public System.Void Resize(System.Int32 size)
      // Offset: 0x1821E40
      void Resize(int size);
    }; // TMPro.TMP_Text/TMPro.TextBackingContainer
    #pragma pack(pop)
    static check_size<sizeof(TMP_Text::TextBackingContainer), 8 + sizeof(int)> __TMPro_TMP_Text_TextBackingContainerSizeCheck;
    static_assert(sizeof(TMP_Text::TextBackingContainer) == 0xC);
    public:
    // [TextAreaAttribute] Offset: 0x6B2E18
    // protected System.String m_text
    // Size: 0x8
    // Offset: 0xD0
    ::StringW m_text;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Boolean m_IsTextBackingStringDirty
    // Size: 0x1
    // Offset: 0xD8
    bool m_IsTextBackingStringDirty;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected TMPro.ITextPreprocessor m_TextPreprocessor
    // Size: 0x8
    // Offset: 0xE0
    ::TMPro::ITextPreprocessor* m_TextPreprocessor;
    // Field size check
    static_assert(sizeof(::TMPro::ITextPreprocessor*) == 0x8);
    // protected System.Boolean m_isRightToLeft
    // Size: 0x1
    // Offset: 0xE8
    bool m_isRightToLeft;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected TMPro.TMP_FontAsset m_fontAsset
    // Size: 0x8
    // Offset: 0xF0
    ::TMPro::TMP_FontAsset* m_fontAsset;
    // Field size check
    static_assert(sizeof(::TMPro::TMP_FontAsset*) == 0x8);
    // protected TMPro.TMP_FontAsset m_currentFontAsset
    // Size: 0x8
    // Offset: 0xF8
    ::TMPro::TMP_FontAsset* m_currentFontAsset;
    // Field size check
    static_assert(sizeof(::TMPro::TMP_FontAsset*) == 0x8);
    // protected System.Boolean m_isSDFShader
    // Size: 0x1
    // Offset: 0x100
    bool m_isSDFShader;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected UnityEngine.Material m_sharedMaterial
    // Size: 0x8
    // Offset: 0x108
    ::UnityEngine::Material* m_sharedMaterial;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // protected UnityEngine.Material m_currentMaterial
    // Size: 0x8
    // Offset: 0x110
    ::UnityEngine::Material* m_currentMaterial;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // protected System.Int32 m_currentMaterialIndex
    // Size: 0x4
    // Offset: 0x118
    int m_currentMaterialIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // protected UnityEngine.Material[] m_fontSharedMaterials
    // Size: 0x8
    // Offset: 0x120
    ::ArrayW<::UnityEngine::Material*> m_fontSharedMaterials;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Material*>) == 0x8);
    // protected UnityEngine.Material m_fontMaterial
    // Size: 0x8
    // Offset: 0x128
    ::UnityEngine::Material* m_fontMaterial;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // protected UnityEngine.Material[] m_fontMaterials
    // Size: 0x8
    // Offset: 0x130
    ::ArrayW<::UnityEngine::Material*> m_fontMaterials;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Material*>) == 0x8);
    // protected System.Boolean m_isMaterialDirty
    // Size: 0x1
    // Offset: 0x138
    bool m_isMaterialDirty;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected UnityEngine.Color32 m_fontColor32
    // Size: 0x4
    // Offset: 0x13C
    ::UnityEngine::Color32 m_fontColor32;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color32) == 0x4);
    // protected UnityEngine.Color m_fontColor
    // Size: 0x10
    // Offset: 0x140
    ::UnityEngine::Color m_fontColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // protected UnityEngine.Color32 m_underlineColor
    // Size: 0x4
    // Offset: 0x150
    ::UnityEngine::Color32 m_underlineColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color32) == 0x4);
    // protected UnityEngine.Color32 m_strikethroughColor
    // Size: 0x4
    // Offset: 0x154
    ::UnityEngine::Color32 m_strikethroughColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color32) == 0x4);
    // protected System.Boolean m_enableVertexGradient
    // Size: 0x1
    // Offset: 0x158
    bool m_enableVertexGradient;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected TMPro.ColorMode m_colorMode
    // Size: 0x4
    // Offset: 0x15C
    ::TMPro::ColorMode m_colorMode;
    // Field size check
    static_assert(sizeof(::TMPro::ColorMode) == 0x4);
    // protected TMPro.VertexGradient m_fontColorGradient
    // Size: 0x40
    // Offset: 0x160
    ::TMPro::VertexGradient m_fontColorGradient;
    // Field size check
    static_assert(sizeof(::TMPro::VertexGradient) == 0x40);
    // protected TMPro.TMP_ColorGradient m_fontColorGradientPreset
    // Size: 0x8
    // Offset: 0x1A0
    ::TMPro::TMP_ColorGradient* m_fontColorGradientPreset;
    // Field size check
    static_assert(sizeof(::TMPro::TMP_ColorGradient*) == 0x8);
    // protected TMPro.TMP_SpriteAsset m_spriteAsset
    // Size: 0x8
    // Offset: 0x1A8
    ::TMPro::TMP_SpriteAsset* m_spriteAsset;
    // Field size check
    static_assert(sizeof(::TMPro::TMP_SpriteAsset*) == 0x8);
    // protected System.Boolean m_tintAllSprites
    // Size: 0x1
    // Offset: 0x1B0
    bool m_tintAllSprites;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected System.Boolean m_tintSprite
    // Size: 0x1
    // Offset: 0x1B1
    bool m_tintSprite;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected UnityEngine.Color32 m_spriteColor
    // Size: 0x4
    // Offset: 0x1B4
    ::UnityEngine::Color32 m_spriteColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color32) == 0x4);
    // protected TMPro.TMP_StyleSheet m_StyleSheet
    // Size: 0x8
    // Offset: 0x1B8
    ::TMPro::TMP_StyleSheet* m_StyleSheet;
    // Field size check
    static_assert(sizeof(::TMPro::TMP_StyleSheet*) == 0x8);
    // TMPro.TMP_Style m_TextStyle
    // Size: 0x8
    // Offset: 0x1C0
    ::TMPro::TMP_Style* m_TextStyle;
    // Field size check
    static_assert(sizeof(::TMPro::TMP_Style*) == 0x8);
    // protected System.Int32 m_TextStyleHashCode
    // Size: 0x4
    // Offset: 0x1C8
    int m_TextStyleHashCode;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // protected System.Boolean m_overrideHtmlColors
    // Size: 0x1
    // Offset: 0x1CC
    bool m_overrideHtmlColors;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected UnityEngine.Color32 m_faceColor
    // Size: 0x4
    // Offset: 0x1D0
    ::UnityEngine::Color32 m_faceColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color32) == 0x4);
    // protected UnityEngine.Color32 m_outlineColor
    // Size: 0x4
    // Offset: 0x1D4
    ::UnityEngine::Color32 m_outlineColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color32) == 0x4);
    // protected System.Single m_outlineWidth
    // Size: 0x4
    // Offset: 0x1D8
    float m_outlineWidth;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // protected System.Single m_fontSize
    // Size: 0x4
    // Offset: 0x1DC
    float m_fontSize;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // protected System.Single m_currentFontSize
    // Size: 0x4
    // Offset: 0x1E0
    float m_currentFontSize;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // protected System.Single m_fontSizeBase
    // Size: 0x4
    // Offset: 0x1E4
    float m_fontSizeBase;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // protected TMPro.TMP_TextProcessingStack`1<System.Single> m_sizeStack
    // Size: 0xFFFFFFFF
    // Offset: 0x1E8
    ::TMPro::TMP_TextProcessingStack_1<float> m_sizeStack;
    // protected TMPro.FontWeight m_fontWeight
    // Size: 0x4
    // Offset: 0x208
    ::TMPro::FontWeight m_fontWeight;
    // Field size check
    static_assert(sizeof(::TMPro::FontWeight) == 0x4);
    // protected TMPro.FontWeight m_FontWeightInternal
    // Size: 0x4
    // Offset: 0x20C
    ::TMPro::FontWeight m_FontWeightInternal;
    // Field size check
    static_assert(sizeof(::TMPro::FontWeight) == 0x4);
    // protected TMPro.TMP_TextProcessingStack`1<TMPro.FontWeight> m_FontWeightStack
    // Size: 0xFFFFFFFF
    // Offset: 0x210
    ::TMPro::TMP_TextProcessingStack_1<::TMPro::FontWeight> m_FontWeightStack;
    // protected System.Boolean m_enableAutoSizing
    // Size: 0x1
    // Offset: 0x230
    bool m_enableAutoSizing;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected System.Single m_maxFontSize
    // Size: 0x4
    // Offset: 0x234
    float m_maxFontSize;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // protected System.Single m_minFontSize
    // Size: 0x4
    // Offset: 0x238
    float m_minFontSize;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // protected System.Int32 m_AutoSizeIterationCount
    // Size: 0x4
    // Offset: 0x23C
    int m_AutoSizeIterationCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // protected System.Int32 m_AutoSizeMaxIterationCount
    // Size: 0x4
    // Offset: 0x240
    int m_AutoSizeMaxIterationCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // protected System.Boolean m_IsAutoSizePointSizeSet
    // Size: 0x1
    // Offset: 0x244
    bool m_IsAutoSizePointSizeSet;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected System.Single m_fontSizeMin
    // Size: 0x4
    // Offset: 0x248
    float m_fontSizeMin;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // protected System.Single m_fontSizeMax
    // Size: 0x4
    // Offset: 0x24C
    float m_fontSizeMax;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // protected TMPro.FontStyles m_fontStyle
    // Size: 0x4
    // Offset: 0x250
    ::TMPro::FontStyles m_fontStyle;
    // Field size check
    static_assert(sizeof(::TMPro::FontStyles) == 0x4);
    // protected TMPro.FontStyles m_FontStyleInternal
    // Size: 0x4
    // Offset: 0x254
    ::TMPro::FontStyles m_FontStyleInternal;
    // Field size check
    static_assert(sizeof(::TMPro::FontStyles) == 0x4);
    // protected TMPro.TMP_FontStyleStack m_fontStyleStack
    // Size: 0xA
    // Offset: 0x258
    ::TMPro::TMP_FontStyleStack m_fontStyleStack;
    // Field size check
    static_assert(sizeof(::TMPro::TMP_FontStyleStack) == 0xA);
    // protected System.Boolean m_isUsingBold
    // Size: 0x1
    // Offset: 0x262
    bool m_isUsingBold;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected TMPro.HorizontalAlignmentOptions m_HorizontalAlignment
    // Size: 0x4
    // Offset: 0x264
    ::TMPro::HorizontalAlignmentOptions m_HorizontalAlignment;
    // Field size check
    static_assert(sizeof(::TMPro::HorizontalAlignmentOptions) == 0x4);
    // protected TMPro.VerticalAlignmentOptions m_VerticalAlignment
    // Size: 0x4
    // Offset: 0x268
    ::TMPro::VerticalAlignmentOptions m_VerticalAlignment;
    // Field size check
    static_assert(sizeof(::TMPro::VerticalAlignmentOptions) == 0x4);
    // [FormerlySerializedAsAttribute] Offset: 0x6B3018
    // protected TMPro.TextAlignmentOptions m_textAlignment
    // Size: 0x4
    // Offset: 0x26C
    ::TMPro::TextAlignmentOptions m_textAlignment;
    // Field size check
    static_assert(sizeof(::TMPro::TextAlignmentOptions) == 0x4);
    // protected TMPro.HorizontalAlignmentOptions m_lineJustification
    // Size: 0x4
    // Offset: 0x270
    ::TMPro::HorizontalAlignmentOptions m_lineJustification;
    // Field size check
    static_assert(sizeof(::TMPro::HorizontalAlignmentOptions) == 0x4);
    // protected TMPro.TMP_TextProcessingStack`1<TMPro.HorizontalAlignmentOptions> m_lineJustificationStack
    // Size: 0xFFFFFFFF
    // Offset: 0x278
    ::TMPro::TMP_TextProcessingStack_1<::TMPro::HorizontalAlignmentOptions> m_lineJustificationStack;
    // protected UnityEngine.Vector3[] m_textContainerLocalCorners
    // Size: 0x8
    // Offset: 0x298
    ::ArrayW<::UnityEngine::Vector3> m_textContainerLocalCorners;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Vector3>) == 0x8);
    // protected System.Single m_characterSpacing
    // Size: 0x4
    // Offset: 0x2A0
    float m_characterSpacing;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // protected System.Single m_cSpacing
    // Size: 0x4
    // Offset: 0x2A4
    float m_cSpacing;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // protected System.Single m_monoSpacing
    // Size: 0x4
    // Offset: 0x2A8
    float m_monoSpacing;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // protected System.Single m_wordSpacing
    // Size: 0x4
    // Offset: 0x2AC
    float m_wordSpacing;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // protected System.Single m_lineSpacing
    // Size: 0x4
    // Offset: 0x2B0
    float m_lineSpacing;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // protected System.Single m_lineSpacingDelta
    // Size: 0x4
    // Offset: 0x2B4
    float m_lineSpacingDelta;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // protected System.Single m_lineHeight
    // Size: 0x4
    // Offset: 0x2B8
    float m_lineHeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // protected System.Boolean m_IsDrivenLineSpacing
    // Size: 0x1
    // Offset: 0x2BC
    bool m_IsDrivenLineSpacing;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected System.Single m_lineSpacingMax
    // Size: 0x4
    // Offset: 0x2C0
    float m_lineSpacingMax;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // protected System.Single m_paragraphSpacing
    // Size: 0x4
    // Offset: 0x2C4
    float m_paragraphSpacing;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // protected System.Single m_charWidthMaxAdj
    // Size: 0x4
    // Offset: 0x2C8
    float m_charWidthMaxAdj;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // protected System.Single m_charWidthAdjDelta
    // Size: 0x4
    // Offset: 0x2CC
    float m_charWidthAdjDelta;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // protected System.Boolean m_enableWordWrapping
    // Size: 0x1
    // Offset: 0x2D0
    bool m_enableWordWrapping;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected System.Boolean m_isCharacterWrappingEnabled
    // Size: 0x1
    // Offset: 0x2D1
    bool m_isCharacterWrappingEnabled;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected System.Boolean m_isNonBreakingSpace
    // Size: 0x1
    // Offset: 0x2D2
    bool m_isNonBreakingSpace;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected System.Boolean m_isIgnoringAlignment
    // Size: 0x1
    // Offset: 0x2D3
    bool m_isIgnoringAlignment;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected System.Single m_wordWrappingRatios
    // Size: 0x4
    // Offset: 0x2D4
    float m_wordWrappingRatios;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // protected TMPro.TextOverflowModes m_overflowMode
    // Size: 0x4
    // Offset: 0x2D8
    ::TMPro::TextOverflowModes m_overflowMode;
    // Field size check
    static_assert(sizeof(::TMPro::TextOverflowModes) == 0x4);
    // protected System.Int32 m_firstOverflowCharacterIndex
    // Size: 0x4
    // Offset: 0x2DC
    int m_firstOverflowCharacterIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // protected TMPro.TMP_Text m_linkedTextComponent
    // Size: 0x8
    // Offset: 0x2E0
    ::TMPro::TMP_Text* m_linkedTextComponent;
    // Field size check
    static_assert(sizeof(::TMPro::TMP_Text*) == 0x8);
    // TMPro.TMP_Text parentLinkedComponent
    // Size: 0x8
    // Offset: 0x2E8
    ::TMPro::TMP_Text* parentLinkedComponent;
    // Field size check
    static_assert(sizeof(::TMPro::TMP_Text*) == 0x8);
    // protected System.Boolean m_isTextTruncated
    // Size: 0x1
    // Offset: 0x2F0
    bool m_isTextTruncated;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected System.Boolean m_enableKerning
    // Size: 0x1
    // Offset: 0x2F1
    bool m_enableKerning;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected System.Single m_GlyphHorizontalAdvanceAdjustment
    // Size: 0x4
    // Offset: 0x2F4
    float m_GlyphHorizontalAdvanceAdjustment;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // protected System.Boolean m_enableExtraPadding
    // Size: 0x1
    // Offset: 0x2F8
    bool m_enableExtraPadding;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected System.Boolean checkPaddingRequired
    // Size: 0x1
    // Offset: 0x2F9
    bool checkPaddingRequired;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected System.Boolean m_isRichText
    // Size: 0x1
    // Offset: 0x2FA
    bool m_isRichText;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected System.Boolean m_parseCtrlCharacters
    // Size: 0x1
    // Offset: 0x2FB
    bool m_parseCtrlCharacters;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected System.Boolean m_isOverlay
    // Size: 0x1
    // Offset: 0x2FC
    bool m_isOverlay;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected System.Boolean m_isOrthographic
    // Size: 0x1
    // Offset: 0x2FD
    bool m_isOrthographic;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected System.Boolean m_isCullingEnabled
    // Size: 0x1
    // Offset: 0x2FE
    bool m_isCullingEnabled;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected System.Boolean m_isMaskingEnabled
    // Size: 0x1
    // Offset: 0x2FF
    bool m_isMaskingEnabled;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected System.Boolean isMaskUpdateRequired
    // Size: 0x1
    // Offset: 0x300
    bool isMaskUpdateRequired;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected System.Boolean m_ignoreCulling
    // Size: 0x1
    // Offset: 0x301
    bool m_ignoreCulling;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected TMPro.TextureMappingOptions m_horizontalMapping
    // Size: 0x4
    // Offset: 0x304
    ::TMPro::TextureMappingOptions m_horizontalMapping;
    // Field size check
    static_assert(sizeof(::TMPro::TextureMappingOptions) == 0x4);
    // protected TMPro.TextureMappingOptions m_verticalMapping
    // Size: 0x4
    // Offset: 0x308
    ::TMPro::TextureMappingOptions m_verticalMapping;
    // Field size check
    static_assert(sizeof(::TMPro::TextureMappingOptions) == 0x4);
    // protected System.Single m_uvLineOffset
    // Size: 0x4
    // Offset: 0x30C
    float m_uvLineOffset;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // protected TMPro.TextRenderFlags m_renderMode
    // Size: 0x4
    // Offset: 0x310
    ::TMPro::TextRenderFlags m_renderMode;
    // Field size check
    static_assert(sizeof(::TMPro::TextRenderFlags) == 0x4);
    // protected TMPro.VertexSortingOrder m_geometrySortingOrder
    // Size: 0x4
    // Offset: 0x314
    ::TMPro::VertexSortingOrder m_geometrySortingOrder;
    // Field size check
    static_assert(sizeof(::TMPro::VertexSortingOrder) == 0x4);
    // protected System.Boolean m_IsTextObjectScaleStatic
    // Size: 0x1
    // Offset: 0x318
    bool m_IsTextObjectScaleStatic;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected System.Boolean m_VertexBufferAutoSizeReduction
    // Size: 0x1
    // Offset: 0x319
    bool m_VertexBufferAutoSizeReduction;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected System.Int32 m_firstVisibleCharacter
    // Size: 0x4
    // Offset: 0x31C
    int m_firstVisibleCharacter;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // protected System.Int32 m_maxVisibleCharacters
    // Size: 0x4
    // Offset: 0x320
    int m_maxVisibleCharacters;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // protected System.Int32 m_maxVisibleWords
    // Size: 0x4
    // Offset: 0x324
    int m_maxVisibleWords;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // protected System.Int32 m_maxVisibleLines
    // Size: 0x4
    // Offset: 0x328
    int m_maxVisibleLines;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // protected System.Boolean m_useMaxVisibleDescender
    // Size: 0x1
    // Offset: 0x32C
    bool m_useMaxVisibleDescender;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected System.Int32 m_pageToDisplay
    // Size: 0x4
    // Offset: 0x330
    int m_pageToDisplay;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // protected System.Boolean m_isNewPage
    // Size: 0x1
    // Offset: 0x334
    bool m_isNewPage;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected UnityEngine.Vector4 m_margin
    // Size: 0x10
    // Offset: 0x338
    ::UnityEngine::Vector4 m_margin;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector4) == 0x10);
    // protected System.Single m_marginLeft
    // Size: 0x4
    // Offset: 0x348
    float m_marginLeft;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // protected System.Single m_marginRight
    // Size: 0x4
    // Offset: 0x34C
    float m_marginRight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // protected System.Single m_marginWidth
    // Size: 0x4
    // Offset: 0x350
    float m_marginWidth;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // protected System.Single m_marginHeight
    // Size: 0x4
    // Offset: 0x354
    float m_marginHeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // protected System.Single m_width
    // Size: 0x4
    // Offset: 0x358
    float m_width;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // protected TMPro.TMP_TextInfo m_textInfo
    // Size: 0x8
    // Offset: 0x360
    ::TMPro::TMP_TextInfo* m_textInfo;
    // Field size check
    static_assert(sizeof(::TMPro::TMP_TextInfo*) == 0x8);
    // protected System.Boolean m_havePropertiesChanged
    // Size: 0x1
    // Offset: 0x368
    bool m_havePropertiesChanged;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected System.Boolean m_isUsingLegacyAnimationComponent
    // Size: 0x1
    // Offset: 0x369
    bool m_isUsingLegacyAnimationComponent;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected UnityEngine.Transform m_transform
    // Size: 0x8
    // Offset: 0x370
    ::UnityEngine::Transform* m_transform;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // protected UnityEngine.RectTransform m_rectTransform
    // Size: 0x8
    // Offset: 0x378
    ::UnityEngine::RectTransform* m_rectTransform;
    // Field size check
    static_assert(sizeof(::UnityEngine::RectTransform*) == 0x8);
    // protected UnityEngine.Vector2 m_PreviousRectTransformSize
    // Size: 0x8
    // Offset: 0x380
    ::UnityEngine::Vector2 m_PreviousRectTransformSize;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // protected UnityEngine.Vector2 m_PreviousPivotPosition
    // Size: 0x8
    // Offset: 0x388
    ::UnityEngine::Vector2 m_PreviousPivotPosition;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // private System.Boolean <autoSizeTextContainer>k__BackingField
    // Size: 0x1
    // Offset: 0x390
    bool autoSizeTextContainer;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected System.Boolean m_autoSizeTextContainer
    // Size: 0x1
    // Offset: 0x391
    bool m_autoSizeTextContainer;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected UnityEngine.Mesh m_mesh
    // Size: 0x8
    // Offset: 0x398
    ::UnityEngine::Mesh* m_mesh;
    // Field size check
    static_assert(sizeof(::UnityEngine::Mesh*) == 0x8);
    // protected System.Boolean m_isVolumetricText
    // Size: 0x1
    // Offset: 0x3A0
    bool m_isVolumetricText;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Action`1<TMPro.TMP_TextInfo> OnPreRenderText
    // Size: 0x8
    // Offset: 0x3A8
    ::System::Action_1<::TMPro::TMP_TextInfo*>* OnPreRenderText;
    // Field size check
    static_assert(sizeof(::System::Action_1<::TMPro::TMP_TextInfo*>*) == 0x8);
    // protected TMPro.TMP_SpriteAnimator m_spriteAnimator
    // Size: 0x8
    // Offset: 0x3B0
    ::TMPro::TMP_SpriteAnimator* m_spriteAnimator;
    // Field size check
    static_assert(sizeof(::TMPro::TMP_SpriteAnimator*) == 0x8);
    // protected System.Single m_flexibleHeight
    // Size: 0x4
    // Offset: 0x3B8
    float m_flexibleHeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // protected System.Single m_flexibleWidth
    // Size: 0x4
    // Offset: 0x3BC
    float m_flexibleWidth;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // protected System.Single m_minWidth
    // Size: 0x4
    // Offset: 0x3C0
    float m_minWidth;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // protected System.Single m_minHeight
    // Size: 0x4
    // Offset: 0x3C4
    float m_minHeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // protected System.Single m_maxWidth
    // Size: 0x4
    // Offset: 0x3C8
    float m_maxWidth;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // protected System.Single m_maxHeight
    // Size: 0x4
    // Offset: 0x3CC
    float m_maxHeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // protected UnityEngine.UI.LayoutElement m_LayoutElement
    // Size: 0x8
    // Offset: 0x3D0
    ::UnityEngine::UI::LayoutElement* m_LayoutElement;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::LayoutElement*) == 0x8);
    // protected System.Single m_preferredWidth
    // Size: 0x4
    // Offset: 0x3D8
    float m_preferredWidth;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // protected System.Single m_renderedWidth
    // Size: 0x4
    // Offset: 0x3DC
    float m_renderedWidth;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // protected System.Boolean m_isPreferredWidthDirty
    // Size: 0x1
    // Offset: 0x3E0
    bool m_isPreferredWidthDirty;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected System.Single m_preferredHeight
    // Size: 0x4
    // Offset: 0x3E4
    float m_preferredHeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // protected System.Single m_renderedHeight
    // Size: 0x4
    // Offset: 0x3E8
    float m_renderedHeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // protected System.Boolean m_isPreferredHeightDirty
    // Size: 0x1
    // Offset: 0x3EC
    bool m_isPreferredHeightDirty;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected System.Boolean m_isCalculatingPreferredValues
    // Size: 0x1
    // Offset: 0x3ED
    bool m_isCalculatingPreferredValues;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected System.Int32 m_layoutPriority
    // Size: 0x4
    // Offset: 0x3F0
    int m_layoutPriority;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // protected System.Boolean m_isLayoutDirty
    // Size: 0x1
    // Offset: 0x3F4
    bool m_isLayoutDirty;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected System.Boolean m_isAwake
    // Size: 0x1
    // Offset: 0x3F5
    bool m_isAwake;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // System.Boolean m_isWaitingOnResourceLoad
    // Size: 0x1
    // Offset: 0x3F6
    bool m_isWaitingOnResourceLoad;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // TMPro.TMP_Text/TMPro.TextInputSources m_inputSource
    // Size: 0x4
    // Offset: 0x3F8
    ::TMPro::TMP_Text::TextInputSources m_inputSource;
    // Field size check
    static_assert(sizeof(::TMPro::TMP_Text::TextInputSources) == 0x4);
    // protected System.Single m_fontScaleMultiplier
    // Size: 0x4
    // Offset: 0x3FC
    float m_fontScaleMultiplier;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // protected System.Single tag_LineIndent
    // Size: 0x4
    // Offset: 0x400
    float tag_LineIndent;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // protected System.Single tag_Indent
    // Size: 0x4
    // Offset: 0x404
    float tag_Indent;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // protected TMPro.TMP_TextProcessingStack`1<System.Single> m_indentStack
    // Size: 0xFFFFFFFF
    // Offset: 0x408
    ::TMPro::TMP_TextProcessingStack_1<float> m_indentStack;
    // protected System.Boolean tag_NoParsing
    // Size: 0x1
    // Offset: 0x428
    bool tag_NoParsing;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected System.Boolean m_isParsingText
    // Size: 0x1
    // Offset: 0x429
    bool m_isParsingText;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected UnityEngine.Matrix4x4 m_FXMatrix
    // Size: 0x40
    // Offset: 0x42C
    ::UnityEngine::Matrix4x4 m_FXMatrix;
    // Field size check
    static_assert(sizeof(::UnityEngine::Matrix4x4) == 0x40);
    // protected System.Boolean m_isFXMatrixSet
    // Size: 0x1
    // Offset: 0x46C
    bool m_isFXMatrixSet;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // TMPro.TMP_Text/TMPro.UnicodeChar[] m_TextProcessingArray
    // Size: 0x8
    // Offset: 0x470
    ::ArrayW<::TMPro::TMP_Text::UnicodeChar> m_TextProcessingArray;
    // Field size check
    static_assert(sizeof(::ArrayW<::TMPro::TMP_Text::UnicodeChar>) == 0x8);
    // System.Int32 m_InternalTextProcessingArraySize
    // Size: 0x4
    // Offset: 0x478
    int m_InternalTextProcessingArraySize;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private TMPro.TMP_CharacterInfo[] m_internalCharacterInfo
    // Size: 0x8
    // Offset: 0x480
    ::ArrayW<::TMPro::TMP_CharacterInfo> m_internalCharacterInfo;
    // Field size check
    static_assert(sizeof(::ArrayW<::TMPro::TMP_CharacterInfo>) == 0x8);
    // protected System.Int32 m_totalCharacterCount
    // Size: 0x4
    // Offset: 0x488
    int m_totalCharacterCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // protected System.Int32 m_characterCount
    // Size: 0x4
    // Offset: 0x48C
    int m_characterCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // protected System.Int32 m_firstCharacterOfLine
    // Size: 0x4
    // Offset: 0x490
    int m_firstCharacterOfLine;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // protected System.Int32 m_firstVisibleCharacterOfLine
    // Size: 0x4
    // Offset: 0x494
    int m_firstVisibleCharacterOfLine;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // protected System.Int32 m_lastCharacterOfLine
    // Size: 0x4
    // Offset: 0x498
    int m_lastCharacterOfLine;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // protected System.Int32 m_lastVisibleCharacterOfLine
    // Size: 0x4
    // Offset: 0x49C
    int m_lastVisibleCharacterOfLine;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // protected System.Int32 m_lineNumber
    // Size: 0x4
    // Offset: 0x4A0
    int m_lineNumber;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // protected System.Int32 m_lineVisibleCharacterCount
    // Size: 0x4
    // Offset: 0x4A4
    int m_lineVisibleCharacterCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // protected System.Int32 m_pageNumber
    // Size: 0x4
    // Offset: 0x4A8
    int m_pageNumber;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // protected System.Single m_PageAscender
    // Size: 0x4
    // Offset: 0x4AC
    float m_PageAscender;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // protected System.Single m_maxTextAscender
    // Size: 0x4
    // Offset: 0x4B0
    float m_maxTextAscender;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // protected System.Single m_maxCapHeight
    // Size: 0x4
    // Offset: 0x4B4
    float m_maxCapHeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // protected System.Single m_ElementAscender
    // Size: 0x4
    // Offset: 0x4B8
    float m_ElementAscender;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // protected System.Single m_ElementDescender
    // Size: 0x4
    // Offset: 0x4BC
    float m_ElementDescender;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // protected System.Single m_maxLineAscender
    // Size: 0x4
    // Offset: 0x4C0
    float m_maxLineAscender;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // protected System.Single m_maxLineDescender
    // Size: 0x4
    // Offset: 0x4C4
    float m_maxLineDescender;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // protected System.Single m_startOfLineAscender
    // Size: 0x4
    // Offset: 0x4C8
    float m_startOfLineAscender;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // protected System.Single m_startOfLineDescender
    // Size: 0x4
    // Offset: 0x4CC
    float m_startOfLineDescender;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // protected System.Single m_lineOffset
    // Size: 0x4
    // Offset: 0x4D0
    float m_lineOffset;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // protected TMPro.Extents m_meshExtents
    // Size: 0x10
    // Offset: 0x4D4
    ::TMPro::Extents m_meshExtents;
    // Field size check
    static_assert(sizeof(::TMPro::Extents) == 0x10);
    // protected UnityEngine.Color32 m_htmlColor
    // Size: 0x4
    // Offset: 0x4E4
    ::UnityEngine::Color32 m_htmlColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color32) == 0x4);
    // protected TMPro.TMP_TextProcessingStack`1<UnityEngine.Color32> m_colorStack
    // Size: 0xFFFFFFFF
    // Offset: 0x4E8
    ::TMPro::TMP_TextProcessingStack_1<::UnityEngine::Color32> m_colorStack;
    // protected TMPro.TMP_TextProcessingStack`1<UnityEngine.Color32> m_underlineColorStack
    // Size: 0xFFFFFFFF
    // Offset: 0x508
    ::TMPro::TMP_TextProcessingStack_1<::UnityEngine::Color32> m_underlineColorStack;
    // protected TMPro.TMP_TextProcessingStack`1<UnityEngine.Color32> m_strikethroughColorStack
    // Size: 0xFFFFFFFF
    // Offset: 0x528
    ::TMPro::TMP_TextProcessingStack_1<::UnityEngine::Color32> m_strikethroughColorStack;
    // protected TMPro.TMP_TextProcessingStack`1<TMPro.HighlightState> m_HighlightStateStack
    // Size: 0xFFFFFFFF
    // Offset: 0x548
    ::TMPro::TMP_TextProcessingStack_1<::TMPro::HighlightState> m_HighlightStateStack;
    // protected TMPro.TMP_ColorGradient m_colorGradientPreset
    // Size: 0x8
    // Offset: 0x578
    ::TMPro::TMP_ColorGradient* m_colorGradientPreset;
    // Field size check
    static_assert(sizeof(::TMPro::TMP_ColorGradient*) == 0x8);
    // protected TMPro.TMP_TextProcessingStack`1<TMPro.TMP_ColorGradient> m_colorGradientStack
    // Size: 0xFFFFFFFF
    // Offset: 0x580
    ::TMPro::TMP_TextProcessingStack_1<::TMPro::TMP_ColorGradient*> m_colorGradientStack;
    // protected System.Boolean m_colorGradientPresetIsTinted
    // Size: 0x1
    // Offset: 0x5A8
    bool m_colorGradientPresetIsTinted;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected System.Single m_tabSpacing
    // Size: 0x4
    // Offset: 0x5AC
    float m_tabSpacing;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // protected System.Single m_spacing
    // Size: 0x4
    // Offset: 0x5B0
    float m_spacing;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // protected TMPro.TMP_TextProcessingStack`1<System.Int32>[] m_TextStyleStacks
    // Size: 0x8
    // Offset: 0x5B8
    ::ArrayW<::TMPro::TMP_TextProcessingStack_1<int>> m_TextStyleStacks;
    // Field size check
    static_assert(sizeof(::ArrayW<::TMPro::TMP_TextProcessingStack_1<int>>) == 0x8);
    // protected System.Int32 m_TextStyleStackDepth
    // Size: 0x4
    // Offset: 0x5C0
    int m_TextStyleStackDepth;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // protected TMPro.TMP_TextProcessingStack`1<System.Int32> m_ItalicAngleStack
    // Size: 0xFFFFFFFF
    // Offset: 0x5C8
    ::TMPro::TMP_TextProcessingStack_1<int> m_ItalicAngleStack;
    // protected System.Int32 m_ItalicAngle
    // Size: 0x4
    // Offset: 0x5E8
    int m_ItalicAngle;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // protected TMPro.TMP_TextProcessingStack`1<System.Int32> m_actionStack
    // Size: 0xFFFFFFFF
    // Offset: 0x5F0
    ::TMPro::TMP_TextProcessingStack_1<int> m_actionStack;
    // protected System.Single m_padding
    // Size: 0x4
    // Offset: 0x610
    float m_padding;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // protected System.Single m_baselineOffset
    // Size: 0x4
    // Offset: 0x614
    float m_baselineOffset;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // protected TMPro.TMP_TextProcessingStack`1<System.Single> m_baselineOffsetStack
    // Size: 0xFFFFFFFF
    // Offset: 0x618
    ::TMPro::TMP_TextProcessingStack_1<float> m_baselineOffsetStack;
    // protected System.Single m_xAdvance
    // Size: 0x4
    // Offset: 0x638
    float m_xAdvance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // protected TMPro.TMP_TextElementType m_textElementType
    // Size: 0x4
    // Offset: 0x63C
    ::TMPro::TMP_TextElementType m_textElementType;
    // Field size check
    static_assert(sizeof(::TMPro::TMP_TextElementType) == 0x4);
    // protected TMPro.TMP_TextElement m_cached_TextElement
    // Size: 0x8
    // Offset: 0x640
    ::TMPro::TMP_TextElement* m_cached_TextElement;
    // Field size check
    static_assert(sizeof(::TMPro::TMP_TextElement*) == 0x8);
    // protected TMPro.TMP_Text/TMPro.SpecialCharacter m_Ellipsis
    // Size: 0x1C
    // Offset: 0x648
    ::TMPro::TMP_Text::SpecialCharacter m_Ellipsis;
    // Field size check
    static_assert(sizeof(::TMPro::TMP_Text::SpecialCharacter) == 0x1C);
    // protected TMPro.TMP_Text/TMPro.SpecialCharacter m_Underline
    // Size: 0x1C
    // Offset: 0x668
    ::TMPro::TMP_Text::SpecialCharacter m_Underline;
    // Field size check
    static_assert(sizeof(::TMPro::TMP_Text::SpecialCharacter) == 0x1C);
    // protected TMPro.TMP_SpriteAsset m_defaultSpriteAsset
    // Size: 0x8
    // Offset: 0x688
    ::TMPro::TMP_SpriteAsset* m_defaultSpriteAsset;
    // Field size check
    static_assert(sizeof(::TMPro::TMP_SpriteAsset*) == 0x8);
    // protected TMPro.TMP_SpriteAsset m_currentSpriteAsset
    // Size: 0x8
    // Offset: 0x690
    ::TMPro::TMP_SpriteAsset* m_currentSpriteAsset;
    // Field size check
    static_assert(sizeof(::TMPro::TMP_SpriteAsset*) == 0x8);
    // protected System.Int32 m_spriteCount
    // Size: 0x4
    // Offset: 0x698
    int m_spriteCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // protected System.Int32 m_spriteIndex
    // Size: 0x4
    // Offset: 0x69C
    int m_spriteIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // protected System.Int32 m_spriteAnimationID
    // Size: 0x4
    // Offset: 0x6A0
    int m_spriteAnimationID;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // protected System.Boolean m_ignoreActiveState
    // Size: 0x1
    // Offset: 0x6A4
    bool m_ignoreActiveState;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private TMPro.TMP_Text/TMPro.TextBackingContainer m_TextBackingArray
    // Size: 0xC
    // Offset: 0x6A8
    ::TMPro::TMP_Text::TextBackingContainer m_TextBackingArray;
    // Field size check
    static_assert(sizeof(::TMPro::TMP_Text::TextBackingContainer) == 0xC);
    // private readonly System.Decimal[] k_Power
    // Size: 0x8
    // Offset: 0x6B8
    ::ArrayW<::System::Decimal> k_Power;
    // Field size check
    static_assert(sizeof(::ArrayW<::System::Decimal>) == 0x8);
    public:
    // Get static field: static protected TMPro.MaterialReference[] m_materialReferences
    static ::ArrayW<::TMPro::MaterialReference> _get_m_materialReferences();
    // Set static field: static protected TMPro.MaterialReference[] m_materialReferences
    static void _set_m_materialReferences(::ArrayW<::TMPro::MaterialReference> value);
    // Get static field: static protected System.Collections.Generic.Dictionary`2<System.Int32,System.Int32> m_materialReferenceIndexLookup
    static ::System::Collections::Generic::Dictionary_2<int, int>* _get_m_materialReferenceIndexLookup();
    // Set static field: static protected System.Collections.Generic.Dictionary`2<System.Int32,System.Int32> m_materialReferenceIndexLookup
