// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: TMPro.TMP_Asset
#include "TMPro/TMP_Asset.hpp"
// Including type: UnityEngine.TextCore.FaceInfo
#include "UnityEngine/TextCore/FaceInfo.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: TMPro
namespace TMPro {
  // Forward declaring type: TMP_SpriteCharacter
  class TMP_SpriteCharacter;
  // Forward declaring type: TMP_SpriteGlyph
  class TMP_SpriteGlyph;
  // Forward declaring type: TMP_Sprite
  class TMP_Sprite;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: HashSet`1<T>
  template<typename T>
  class HashSet_1;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Texture
  class Texture;
  // Forward declaring type: Material
  class Material;
}
// Completed forward declares
// Type namespace: TMPro
namespace TMPro {
  // Forward declaring type: TMP_SpriteAsset
  class TMP_SpriteAsset;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::TMPro::TMP_SpriteAsset);
DEFINE_IL2CPP_ARG_TYPE(::TMPro::TMP_SpriteAsset*, "TMPro", "TMP_SpriteAsset");
// Type namespace: TMPro
namespace TMPro {
  // Size: 0xE1
  #pragma pack(push, 1)
  // Autogenerated type: TMPro.TMP_SpriteAsset
  // [TokenAttribute] Offset: FFFFFFFF
  // [ExcludeFromPresetAttribute] Offset: FFFFFFFF
  class TMP_SpriteAsset : public ::TMPro::TMP_Asset {
    public:
    // Writing base type padding for base size: 0x2C to desired offset: 0x30
    char ___base_padding[0x4] = {};
    // Nested type: ::TMPro::TMP_SpriteAsset::$$c
    class $$c;
    public:
    // System.Collections.Generic.Dictionary`2<System.Int32,System.Int32> m_NameLookup
    // Size: 0x8
    // Offset: 0x30
    ::System::Collections::Generic::Dictionary_2<int, int>* m_NameLookup;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<int, int>*) == 0x8);
    // System.Collections.Generic.Dictionary`2<System.UInt32,System.Int32> m_GlyphIndexLookup
    // Size: 0x8
    // Offset: 0x38
    ::System::Collections::Generic::Dictionary_2<uint, int>* m_GlyphIndexLookup;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<uint, int>*) == 0x8);
    // private System.String m_Version
    // Size: 0x8
    // Offset: 0x40
    ::StringW m_Version;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // UnityEngine.TextCore.FaceInfo m_FaceInfo
    // Size: 0x5C
    // Offset: 0x48
    ::UnityEngine::TextCore::FaceInfo m_FaceInfo;
    // Field size check
    static_assert(sizeof(::UnityEngine::TextCore::FaceInfo) == 0x5C);
    // Padding between fields: m_FaceInfo and: spriteSheet
    char __padding3[0x4] = {};
    // public UnityEngine.Texture spriteSheet
    // Size: 0x8
    // Offset: 0xA8
    ::UnityEngine::Texture* spriteSheet;
    // Field size check
    static_assert(sizeof(::UnityEngine::Texture*) == 0x8);
    // private System.Collections.Generic.List`1<TMPro.TMP_SpriteCharacter> m_SpriteCharacterTable
    // Size: 0x8
    // Offset: 0xB0
    ::System::Collections::Generic::List_1<::TMPro::TMP_SpriteCharacter*>* m_SpriteCharacterTable;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::TMPro::TMP_SpriteCharacter*>*) == 0x8);
    // System.Collections.Generic.Dictionary`2<System.UInt32,TMPro.TMP_SpriteCharacter> m_SpriteCharacterLookup
    // Size: 0x8
    // Offset: 0xB8
    ::System::Collections::Generic::Dictionary_2<uint, ::TMPro::TMP_SpriteCharacter*>* m_SpriteCharacterLookup;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<uint, ::TMPro::TMP_SpriteCharacter*>*) == 0x8);
    // private System.Collections.Generic.List`1<TMPro.TMP_SpriteGlyph> m_SpriteGlyphTable
    // Size: 0x8
    // Offset: 0xC0
    ::System::Collections::Generic::List_1<::TMPro::TMP_SpriteGlyph*>* m_SpriteGlyphTable;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::TMPro::TMP_SpriteGlyph*>*) == 0x8);
    // System.Collections.Generic.Dictionary`2<System.UInt32,TMPro.TMP_SpriteGlyph> m_SpriteGlyphLookup
    // Size: 0x8
    // Offset: 0xC8
    ::System::Collections::Generic::Dictionary_2<uint, ::TMPro::TMP_SpriteGlyph*>* m_SpriteGlyphLookup;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<uint, ::TMPro::TMP_SpriteGlyph*>*) == 0x8);
    // public System.Collections.Generic.List`1<TMPro.TMP_Sprite> spriteInfoList
    // Size: 0x8
    // Offset: 0xD0
    ::System::Collections::Generic::List_1<::TMPro::TMP_Sprite*>* spriteInfoList;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::TMPro::TMP_Sprite*>*) == 0x8);
    // public System.Collections.Generic.List`1<TMPro.TMP_SpriteAsset> fallbackSpriteAssets
    // Size: 0x8
    // Offset: 0xD8
    ::System::Collections::Generic::List_1<::TMPro::TMP_SpriteAsset*>* fallbackSpriteAssets;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::TMPro::TMP_SpriteAsset*>*) == 0x8);
    // System.Boolean m_IsSpriteAssetLookupTablesDirty
    // Size: 0x1
    // Offset: 0xE0
    bool m_IsSpriteAssetLookupTablesDirty;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Get static field: static private System.Collections.Generic.HashSet`1<System.Int32> k_searchedSpriteAssets
    static ::System::Collections::Generic::HashSet_1<int>* _get_k_searchedSpriteAssets();
    // Set static field: static private System.Collections.Generic.HashSet`1<System.Int32> k_searchedSpriteAssets
    static void _set_k_searchedSpriteAssets(::System::Collections::Generic::HashSet_1<int>* value);
    // Get instance field reference: System.Collections.Generic.Dictionary`2<System.Int32,System.Int32> m_NameLookup
    [[deprecated]] ::System::Collections::Generic::Dictionary_2<int, int>*& dyn_m_NameLookup();
    // Get instance field reference: System.Collections.Generic.Dictionary`2<System.UInt32,System.Int32> m_GlyphIndexLookup
    [[deprecated]] ::System::Collections::Generic::Dictionary_2<uint, int>*& dyn_m_GlyphIndexLookup();
