// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: TMPro.TMP_Asset
#include "TMPro/TMP_Asset.hpp"
// Including type: TMPro.AtlasPopulationMode
#include "TMPro/AtlasPopulationMode.hpp"
// Including type: UnityEngine.TextCore.FaceInfo
#include "UnityEngine/TextCore/FaceInfo.hpp"
// Including type: UnityEngine.TextCore.GlyphRect
#include "UnityEngine/TextCore/GlyphRect.hpp"
// Including type: UnityEngine.TextCore.LowLevel.GlyphRenderMode
#include "UnityEngine/TextCore/LowLevel/GlyphRenderMode.hpp"
// Including type: TMPro.FontAssetCreationSettings
#include "TMPro/FontAssetCreationSettings.hpp"
// Including type: TMPro.TMP_FontWeightPair
#include "TMPro/TMP_FontWeightPair.hpp"
// Including type: Unity.Profiling.ProfilerMarker
#include "Unity/Profiling/ProfilerMarker.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: TMPro
namespace TMPro {
  // Forward declaring type: TMP_Character
  class TMP_Character;
  // Forward declaring type: FaceInfo_Legacy
  class FaceInfo_Legacy;
  // Forward declaring type: TMP_Glyph
  class TMP_Glyph;
  // Forward declaring type: KerningTable
  class KerningTable;
  // Forward declaring type: TMP_FontFeatureTable
  class TMP_FontFeatureTable;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Font
  class Font;
  // Forward declaring type: Texture2D
  class Texture2D;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
  // Forward declaring type: HashSet`1<T>
  template<typename T>
  class HashSet_1;
}
// Forward declaring namespace: UnityEngine::TextCore
namespace UnityEngine::TextCore {
  // Forward declaring type: Glyph
  class Glyph;
}
// Completed forward declares
// Type namespace: TMPro
namespace TMPro {
  // Forward declaring type: TMP_FontAsset
  class TMP_FontAsset;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::TMPro::TMP_FontAsset);
DEFINE_IL2CPP_ARG_TYPE(::TMPro::TMP_FontAsset*, "TMPro", "TMP_FontAsset");
// Type namespace: TMPro
namespace TMPro {
  // Size: 0x218
  #pragma pack(push, 1)
  // Autogenerated type: TMPro.TMP_FontAsset
  // [TokenAttribute] Offset: FFFFFFFF
  // [ExcludeFromPresetAttribute] Offset: FFFFFFFF
  class TMP_FontAsset : public ::TMPro::TMP_Asset {
    public:
    // Writing base type padding for base size: 0x2C to desired offset: 0x30
    char ___base_padding[0x4] = {};
    // Nested type: ::TMPro::TMP_FontAsset::$$c
    class $$c;
    public:
    // private System.String m_Version
    // Size: 0x8
    // Offset: 0x30
    ::StringW m_Version;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // System.String m_SourceFontFileGUID
    // Size: 0x8
    // Offset: 0x38
    ::StringW m_SourceFontFileGUID;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private UnityEngine.Font m_SourceFontFile
    // Size: 0x8
    // Offset: 0x40
    ::UnityEngine::Font* m_SourceFontFile;
    // Field size check
    static_assert(sizeof(::UnityEngine::Font*) == 0x8);
    // private TMPro.AtlasPopulationMode m_AtlasPopulationMode
    // Size: 0x4
    // Offset: 0x48
    ::TMPro::AtlasPopulationMode m_AtlasPopulationMode;
    // Field size check
    static_assert(sizeof(::TMPro::AtlasPopulationMode) == 0x4);
    // Padding between fields: m_AtlasPopulationMode and: m_FaceInfo
    char __padding3[0x4] = {};
    // UnityEngine.TextCore.FaceInfo m_FaceInfo
    // Size: 0x5C
    // Offset: 0x50
    ::UnityEngine::TextCore::FaceInfo m_FaceInfo;
    // Field size check
    static_assert(sizeof(::UnityEngine::TextCore::FaceInfo) == 0x5C);
    // Padding between fields: m_FaceInfo and: m_GlyphTable
    char __padding4[0x4] = {};
    // System.Collections.Generic.List`1<UnityEngine.TextCore.Glyph> m_GlyphTable
    // Size: 0x8
    // Offset: 0xB0
    ::System::Collections::Generic::List_1<::UnityEngine::TextCore::Glyph*>* m_GlyphTable;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::TextCore::Glyph*>*) == 0x8);
    // System.Collections.Generic.Dictionary`2<System.UInt32,UnityEngine.TextCore.Glyph> m_GlyphLookupDictionary
    // Size: 0x8
    // Offset: 0xB8
    ::System::Collections::Generic::Dictionary_2<uint, ::UnityEngine::TextCore::Glyph*>* m_GlyphLookupDictionary;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<uint, ::UnityEngine::TextCore::Glyph*>*) == 0x8);
    // System.Collections.Generic.List`1<TMPro.TMP_Character> m_CharacterTable
    // Size: 0x8
    // Offset: 0xC0
    ::System::Collections::Generic::List_1<::TMPro::TMP_Character*>* m_CharacterTable;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::TMPro::TMP_Character*>*) == 0x8);
    // System.Collections.Generic.Dictionary`2<System.UInt32,TMPro.TMP_Character> m_CharacterLookupDictionary
    // Size: 0x8
    // Offset: 0xC8
    ::System::Collections::Generic::Dictionary_2<uint, ::TMPro::TMP_Character*>* m_CharacterLookupDictionary;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<uint, ::TMPro::TMP_Character*>*) == 0x8);
    // UnityEngine.Texture2D m_AtlasTexture
    // Size: 0x8
    // Offset: 0xD0
    ::UnityEngine::Texture2D* m_AtlasTexture;
    // Field size check
    static_assert(sizeof(::UnityEngine::Texture2D*) == 0x8);
    // UnityEngine.Texture2D[] m_AtlasTextures
    // Size: 0x8
    // Offset: 0xD8
    ::ArrayW<::UnityEngine::Texture2D*> m_AtlasTextures;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Texture2D*>) == 0x8);
    // System.Int32 m_AtlasTextureIndex
    // Size: 0x4
    // Offset: 0xE0
    int m_AtlasTextureIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean m_IsMultiAtlasTexturesEnabled
    // Size: 0x1
    // Offset: 0xE4
    bool m_IsMultiAtlasTexturesEnabled;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_ClearDynamicDataOnBuild
    // Size: 0x1
    // Offset: 0xE5
    bool m_ClearDynamicDataOnBuild;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_ClearDynamicDataOnBuild and: m_UsedGlyphRects
    char __padding13[0x2] = {};
    // private System.Collections.Generic.List`1<UnityEngine.TextCore.GlyphRect> m_UsedGlyphRects
    // Size: 0x8
    // Offset: 0xE8
    ::System::Collections::Generic::List_1<::UnityEngine::TextCore::GlyphRect>* m_UsedGlyphRects;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::TextCore::GlyphRect>*) == 0x8);
    // private System.Collections.Generic.List`1<UnityEngine.TextCore.GlyphRect> m_FreeGlyphRects
    // Size: 0x8
    // Offset: 0xF0
    ::System::Collections::Generic::List_1<::UnityEngine::TextCore::GlyphRect>* m_FreeGlyphRects;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::TextCore::GlyphRect>*) == 0x8);
    // private TMPro.FaceInfo_Legacy m_fontInfo
    // Size: 0x8
    // Offset: 0xF8
    ::TMPro::FaceInfo_Legacy* m_fontInfo;
    // Field size check
    static_assert(sizeof(::TMPro::FaceInfo_Legacy*) == 0x8);
    // public UnityEngine.Texture2D atlas
    // Size: 0x8
    // Offset: 0x100
    ::UnityEngine::Texture2D* atlas;
    // Field size check
    static_assert(sizeof(::UnityEngine::Texture2D*) == 0x8);
    // System.Int32 m_AtlasWidth
    // Size: 0x4
    // Offset: 0x108
    int m_AtlasWidth;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Int32 m_AtlasHeight
    // Size: 0x4
    // Offset: 0x10C
    int m_AtlasHeight;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Int32 m_AtlasPadding
    // Size: 0x4
    // Offset: 0x110
    int m_AtlasPadding;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // UnityEngine.TextCore.LowLevel.GlyphRenderMode m_AtlasRenderMode
    // Size: 0x4
    // Offset: 0x114
    ::UnityEngine::TextCore::LowLevel::GlyphRenderMode m_AtlasRenderMode;
    // Field size check
    static_assert(sizeof(::UnityEngine::TextCore::LowLevel::GlyphRenderMode) == 0x4);
    // System.Collections.Generic.List`1<TMPro.TMP_Glyph> m_glyphInfoList
    // Size: 0x8
    // Offset: 0x118
    ::System::Collections::Generic::List_1<::TMPro::TMP_Glyph*>* m_glyphInfoList;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::TMPro::TMP_Glyph*>*) == 0x8);
    // [FormerlySerializedAsAttribute] Offset: 0x6B249C
    // TMPro.KerningTable m_KerningTable
    // Size: 0x8
    // Offset: 0x120
    ::TMPro::KerningTable* m_KerningTable;
    // Field size check
    static_assert(sizeof(::TMPro::KerningTable*) == 0x8);
    // TMPro.TMP_FontFeatureTable m_FontFeatureTable
    // Size: 0x8
    // Offset: 0x128
    ::TMPro::TMP_FontFeatureTable* m_FontFeatureTable;
    // Field size check
    static_assert(sizeof(::TMPro::TMP_FontFeatureTable*) == 0x8);
    // private System.Collections.Generic.List`1<TMPro.TMP_FontAsset> fallbackFontAssets
    // Size: 0x8
    // Offset: 0x130
    ::System::Collections::Generic::List_1<::TMPro::TMP_FontAsset*>* fallbackFontAssets;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::TMPro::TMP_FontAsset*>*) == 0x8);
    // System.Collections.Generic.List`1<TMPro.TMP_FontAsset> m_FallbackFontAssetTable
    // Size: 0x8
    // Offset: 0x138
    ::System::Collections::Generic::List_1<::TMPro::TMP_FontAsset*>* m_FallbackFontAssetTable;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::TMPro::TMP_FontAsset*>*) == 0x8);
    // TMPro.FontAssetCreationSettings m_CreationSettings
    // Size: 0x55
    // Offset: 0x140
    ::TMPro::FontAssetCreationSettings m_CreationSettings;
    // Field size check
    static_assert(sizeof(::TMPro::FontAssetCreationSettings) == 0x55);
    // Padding between fields: m_CreationSettings and: m_FontWeightTable
    char __padding27[0x3] = {};
    // private TMPro.TMP_FontWeightPair[] m_FontWeightTable
    // Size: 0x8
    // Offset: 0x198
    ::ArrayW<::TMPro::TMP_FontWeightPair> m_FontWeightTable;
    // Field size check
    static_assert(sizeof(::ArrayW<::TMPro::TMP_FontWeightPair>) == 0x8);
    // private TMPro.TMP_FontWeightPair[] fontWeights
    // Size: 0x8
    // Offset: 0x1A0
    ::ArrayW<::TMPro::TMP_FontWeightPair> fontWeights;
    // Field size check
    static_assert(sizeof(::ArrayW<::TMPro::TMP_FontWeightPair>) == 0x8);
    // public System.Single normalStyle
    // Size: 0x4
    // Offset: 0x1A8
    float normalStyle;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single normalSpacingOffset
    // Size: 0x4
    // Offset: 0x1AC
    float normalSpacingOffset;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single boldStyle
    // Size: 0x4
    // Offset: 0x1B0
    float boldStyle;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single boldSpacing
    // Size: 0x4
    // Offset: 0x1B4
    float boldSpacing;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Byte italicStyle
    // Size: 0x1
    // Offset: 0x1B8
    uint8_t italicStyle;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte tabSize
    // Size: 0x1
    // Offset: 0x1B9
    uint8_t tabSize;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // System.Boolean IsFontAssetLookupTablesDirty
    // Size: 0x1
    // Offset: 0x1BA
    bool IsFontAssetLookupTablesDirty;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: IsFontAssetLookupTablesDirty and: FallbackSearchQueryLookup
    char __padding36[0x5] = {};
    // System.Collections.Generic.HashSet`1<System.Int32> FallbackSearchQueryLookup
    // Size: 0x8
    // Offset: 0x1C0
    ::System::Collections::Generic::HashSet_1<int>* FallbackSearchQueryLookup;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::HashSet_1<int>*) == 0x8);
    // private System.Collections.Generic.List`1<UnityEngine.TextCore.Glyph> m_GlyphsToRender
    // Size: 0x8
    // Offset: 0x1C8
    ::System::Collections::Generic::List_1<::UnityEngine::TextCore::Glyph*>* m_GlyphsToRender;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::TextCore::Glyph*>*) == 0x8);
    // private System.Collections.Generic.List`1<UnityEngine.TextCore.Glyph> m_GlyphsRendered
    // Size: 0x8
    // Offset: 0x1D0
    ::System::Collections::Generic::List_1<::UnityEngine::TextCore::Glyph*>* m_GlyphsRendered;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::TextCore::Glyph*>*) == 0x8);
    // private System.Collections.Generic.List`1<System.UInt32> m_GlyphIndexList
    // Size: 0x8
    // Offset: 0x1D8
    ::System::Collections::Generic::List_1<uint>* m_GlyphIndexList;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<uint>*) == 0x8);
    // private System.Collections.Generic.List`1<System.UInt32> m_GlyphIndexListNewlyAdded
    // Size: 0x8
    // Offset: 0x1E0
    ::System::Collections::Generic::List_1<uint>* m_GlyphIndexListNewlyAdded;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<uint>*) == 0x8);
    // System.Collections.Generic.List`1<System.UInt32> m_GlyphsToAdd
    // Size: 0x8
    // Offset: 0x1E8
    ::System::Collections::Generic::List_1<uint>* m_GlyphsToAdd;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<uint>*) == 0x8);
    // System.Collections.Generic.HashSet`1<System.UInt32> m_GlyphsToAddLookup
    // Size: 0x8
    // Offset: 0x1F0
    ::System::Collections::Generic::HashSet_1<uint>* m_GlyphsToAddLookup;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::HashSet_1<uint>*) == 0x8);
    // System.Collections.Generic.List`1<TMPro.TMP_Character> m_CharactersToAdd
    // Size: 0x8
    // Offset: 0x1F8
    ::System::Collections::Generic::List_1<::TMPro::TMP_Character*>* m_CharactersToAdd;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::TMPro::TMP_Character*>*) == 0x8);
    // System.Collections.Generic.HashSet`1<System.UInt32> m_CharactersToAddLookup
    // Size: 0x8
    // Offset: 0x200
    ::System::Collections::Generic::HashSet_1<uint>* m_CharactersToAddLookup;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::HashSet_1<uint>*) == 0x8);
    // System.Collections.Generic.List`1<System.UInt32> s_MissingCharacterList
    // Size: 0x8
    // Offset: 0x208
    ::System::Collections::Generic::List_1<uint>* s_MissingCharacterList;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<uint>*) == 0x8);
    // System.Collections.Generic.HashSet`1<System.UInt32> m_MissingUnicodesFromFontFile
    // Size: 0x8
    // Offset: 0x210
    ::System::Collections::Generic::HashSet_1<uint>* m_MissingUnicodesFromFontFile;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::HashSet_1<uint>*) == 0x8);
    public:
    // Get static field: static private Unity.Profiling.ProfilerMarker k_ReadFontAssetDefinitionMarker
    static ::Unity::Profiling::ProfilerMarker _get_k_ReadFontAssetDefinitionMarker();
    // Set static field: static private Unity.Profiling.ProfilerMarker k_ReadFontAssetDefinitionMarker
    static void _set_k_ReadFontAssetDefinitionMarker(::Unity::Profiling::ProfilerMarker value);
    // Get static field: static private Unity.Profiling.ProfilerMarker k_AddSynthesizedCharactersMarker
    static ::Unity::Profiling::ProfilerMarker _get_k_AddSynthesizedCharactersMarker();
    // Set static field: static private Unity.Profiling.ProfilerMarker k_AddSynthesizedCharactersMarker
