// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.RenderTextureDescriptor
#include "UnityEngine/RenderTextureDescriptor.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: BeautifyEffect.BEAUTIFY_PRESET
#include "BeautifyEffect/BEAUTIFY_PRESET.hpp"
// Including type: BeautifyEffect.BEAUTIFY_QUALITY
#include "BeautifyEffect/BEAUTIFY_QUALITY.hpp"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
// Including type: UnityEngine.LayerMask
#include "UnityEngine/LayerMask.hpp"
// Including type: UnityEngine.Vector2
#include "UnityEngine/Vector2.hpp"
// Including type: UnityEngine.FilterMode
#include "UnityEngine/FilterMode.hpp"
// Including type: BeautifyEffect.BEAUTIFY_TMO
#include "BeautifyEffect/BEAUTIFY_TMO.hpp"
// Including type: UnityEngine.RenderTextureFormat
#include "UnityEngine/RenderTextureFormat.hpp"
// Including type: UnityEngine.Vector4
#include "UnityEngine/Vector4.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: BeautifyEffect
namespace BeautifyEffect {
  // Forward declaring type: BeautifyProfile
  class BeautifyProfile;
  // Forward declaring type: OnBeforeFocusEvent
  class OnBeforeFocusEvent;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Texture2D
  class Texture2D;
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: Material
  class Material;
  // Forward declaring type: Camera
  class Camera;
  // Forward declaring type: RenderTexture
  class RenderTexture;
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: Shader
  class Shader;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: String
  class String;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Completed forward declares
// Type namespace: BeautifyEffect
namespace BeautifyEffect {
  // Forward declaring type: Beautify
  class Beautify;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::BeautifyEffect::Beautify);
DEFINE_IL2CPP_ARG_TYPE(::BeautifyEffect::Beautify*, "BeautifyEffect", "Beautify");
// Type namespace: BeautifyEffect
namespace BeautifyEffect {
  // Size: 0x440
  #pragma pack(push, 1)
  // Autogenerated type: BeautifyEffect.Beautify
  // [TokenAttribute] Offset: FFFFFFFF
  // [AddComponentMenu] Offset: 66BE34
  // [HelpURLAttribute] Offset: 66BE34
  // [ImageEffectAllowedInSceneView] Offset: FFFFFFFF
  // [RequireComponent] Offset: 66BE34
  // [ExecuteInEditMode] Offset: FFFFFFFF
  class Beautify : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::BeautifyEffect::Beautify::$DoBlink$d__712
    class $DoBlink$d__712;
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // private BeautifyEffect.BEAUTIFY_PRESET _preset
    // Size: 0x4
    // Offset: 0x18
    ::BeautifyEffect::BEAUTIFY_PRESET preset;
    // Field size check
    static_assert(sizeof(::BeautifyEffect::BEAUTIFY_PRESET) == 0x4);
    // private BeautifyEffect.BEAUTIFY_QUALITY _quality
    // Size: 0x4
    // Offset: 0x1C
    ::BeautifyEffect::BEAUTIFY_QUALITY quality;
    // Field size check
    static_assert(sizeof(::BeautifyEffect::BEAUTIFY_QUALITY) == 0x4);
    // private BeautifyEffect.BeautifyProfile _profile
    // Size: 0x8
    // Offset: 0x20
    ::BeautifyEffect::BeautifyProfile* profile;
    // Field size check
    static_assert(sizeof(::BeautifyEffect::BeautifyProfile*) == 0x8);
    // private System.Boolean _compareMode
    // Size: 0x1
    // Offset: 0x28
    bool compareMode;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: compareMode and: compareLineAngle
    char __padding3[0x3] = {};
    // [RangeAttribute] Offset: 0x678700
    // private System.Single _compareLineAngle
    // Size: 0x4
    // Offset: 0x2C
    float compareLineAngle;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x678748
    // private System.Single _compareLineWidth
    // Size: 0x4
    // Offset: 0x30
    float compareLineWidth;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x678790
    // private System.Single _dither
    // Size: 0x4
    // Offset: 0x34
    float dither;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x6787D4
    // private System.Single _ditherDepth
    // Size: 0x4
    // Offset: 0x38
    float ditherDepth;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x678814
    // private System.Single _sharpenMinDepth
    // Size: 0x4
    // Offset: 0x3C
    float sharpenMinDepth;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x678854
    // private System.Single _sharpenMaxDepth
    // Size: 0x4
    // Offset: 0x40
    float sharpenMaxDepth;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x678898
    // private System.Single _sharpen
    // Size: 0x4
    // Offset: 0x44
    float sharpen;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x6788D8
    // private System.Single _sharpenDepthThreshold
    // Size: 0x4
    // Offset: 0x48
    float sharpenDepthThreshold;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Color _tintColor
    // Size: 0x10
    // Offset: 0x4C
    ::UnityEngine::Color tintColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // [RangeAttribute] Offset: 0x67892C
    // private System.Single _sharpenRelaxation
    // Size: 0x4
    // Offset: 0x5C
    float sharpenRelaxation;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x678970
    // private System.Single _sharpenClamp
    // Size: 0x4
    // Offset: 0x60
    float sharpenClamp;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x6789B0
    // private System.Single _sharpenMotionSensibility
    // Size: 0x4
    // Offset: 0x64
    float sharpenMotionSensibility;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x6789F0
    // private System.Single _saturate
    // Size: 0x4
    // Offset: 0x68
    float saturate;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x678A30
    // private System.Single _contrast
    // Size: 0x4
    // Offset: 0x6C
    float contrast;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _brightness
    // Size: 0x4
    // Offset: 0x70
    float brightness;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x678A80
    // private System.Single _daltonize
    // Size: 0x4
    // Offset: 0x74
    float daltonize;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean _vignetting
    // Size: 0x1
    // Offset: 0x78
    bool vignetting;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: vignetting and: vignettingColor
    char __padding20[0x3] = {};
    // private UnityEngine.Color _vignettingColor
    // Size: 0x10
    // Offset: 0x7C
    ::UnityEngine::Color vignettingColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // [RangeAttribute] Offset: 0x678AE0
    // private System.Single _vignettingFade
    // Size: 0x4
    // Offset: 0x8C
    float vignettingFade;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean _vignettingCircularShape
    // Size: 0x1
    // Offset: 0x90
    bool vignettingCircularShape;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: vignettingCircularShape and: vignettingAspectRatio
    char __padding23[0x3] = {};
    // private System.Single _vignettingAspectRatio
    // Size: 0x4
    // Offset: 0x94
    float vignettingAspectRatio;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x678B40
    // private System.Single _vignettingBlink
    // Size: 0x4
    // Offset: 0x98
    float vignettingBlink;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: vignettingBlink and: vignettingMask
    char __padding25[0x4] = {};
    // private UnityEngine.Texture2D _vignettingMask
    // Size: 0x8
    // Offset: 0xA0
    ::UnityEngine::Texture2D* vignettingMask;
    // Field size check
    static_assert(sizeof(::UnityEngine::Texture2D*) == 0x8);
    // private System.Boolean _frame
    // Size: 0x1
    // Offset: 0xA8
    bool frame;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: frame and: frameColor
    char __padding27[0x3] = {};
    // private UnityEngine.Color _frameColor
    // Size: 0x10
    // Offset: 0xAC
    ::UnityEngine::Color frameColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // Padding between fields: frameColor and: frameMask
    char __padding28[0x4] = {};
    // private UnityEngine.Texture2D _frameMask
    // Size: 0x8
    // Offset: 0xC0
    ::UnityEngine::Texture2D* frameMask;
    // Field size check
    static_assert(sizeof(::UnityEngine::Texture2D*) == 0x8);
    // private System.Boolean _lut
    // Size: 0x1
    // Offset: 0xC8
    bool lut;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: lut and: lutIntensity
    char __padding30[0x3] = {};
    // [RangeAttribute] Offset: 0x678BD0
    // private System.Single _lutIntensity
    // Size: 0x4
    // Offset: 0xCC
    float lutIntensity;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Texture2D _lutTexture
    // Size: 0x8
    // Offset: 0xD0
    ::UnityEngine::Texture2D* lutTexture;
    // Field size check
    static_assert(sizeof(::UnityEngine::Texture2D*) == 0x8);
    // private System.Boolean _nightVision
    // Size: 0x1
    // Offset: 0xD8
    bool nightVision;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: nightVision and: nightVisionColor
    char __padding33[0x3] = {};
    // private UnityEngine.Color _nightVisionColor
    // Size: 0x10
    // Offset: 0xDC
    ::UnityEngine::Color nightVisionColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private System.Boolean _outline
    // Size: 0x1
    // Offset: 0xEC
    bool outline;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: outline and: outlineColor
    char __padding35[0x3] = {};
    // private UnityEngine.Color _outlineColor
    // Size: 0x10
    // Offset: 0xF0
    ::UnityEngine::Color outlineColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private System.Boolean _thermalVision
    // Size: 0x1
    // Offset: 0x100
    bool thermalVision;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _lensDirt
    // Size: 0x1
    // Offset: 0x101
    bool lensDirt;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: lensDirt and: lensDirtThreshold
    char __padding38[0x2] = {};
    // [RangeAttribute] Offset: 0x678C80
    // private System.Single _lensDirtThreshold
    // Size: 0x4
    // Offset: 0x104
    float lensDirtThreshold;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x678CC0
    // private System.Single _lensDirtIntensity
    // Size: 0x4
    // Offset: 0x108
    float lensDirtIntensity;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: lensDirtIntensity and: lensDirtTexture
    char __padding40[0x4] = {};
    // private UnityEngine.Texture2D _lensDirtTexture
    // Size: 0x8
    // Offset: 0x110
    ::UnityEngine::Texture2D* lensDirtTexture;
    // Field size check
    static_assert(sizeof(::UnityEngine::Texture2D*) == 0x8);
    // private System.Boolean _bloom
    // Size: 0x1
    // Offset: 0x118
    bool bloom;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: bloom and: bloomCullingMask
    char __padding42[0x3] = {};
    // private UnityEngine.LayerMask _bloomCullingMask
    // Size: 0x4
    // Offset: 0x11C
    ::UnityEngine::LayerMask bloomCullingMask;
    // Field size check
    static_assert(sizeof(::UnityEngine::LayerMask) == 0x4);
    // [RangeAttribute] Offset: 0x678D30
    // private System.Single _bloomLayerMaskDownsampling
    // Size: 0x4
    // Offset: 0x120
    float bloomLayerMaskDownsampling;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x678D70
    // private System.Single _bloomIntensity
    // Size: 0x4
    // Offset: 0x124
    float bloomIntensity;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _bloomMaxBrightness
    // Size: 0x4
    // Offset: 0x128
    float bloomMaxBrightness;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x678DC0
    // private System.Single _bloomBoost0
    // Size: 0x4
    // Offset: 0x12C
    float bloomBoost0;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x678E00
    // private System.Single _bloomBoost1
    // Size: 0x4
    // Offset: 0x130
    float bloomBoost1;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x678E40
    // private System.Single _bloomBoost2
    // Size: 0x4
    // Offset: 0x134
    float bloomBoost2;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x678E80
    // private System.Single _bloomBoost3
    // Size: 0x4
    // Offset: 0x138
    float bloomBoost3;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x678EC0
    // private System.Single _bloomBoost4
    // Size: 0x4
    // Offset: 0x13C
    float bloomBoost4;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x678F00
    // private System.Single _bloomBoost5
    // Size: 0x4
    // Offset: 0x140
    float bloomBoost5;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean _bloomAntiflicker
    // Size: 0x1
    // Offset: 0x144
    bool bloomAntiflicker;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _bloomUltra
    // Size: 0x1
    // Offset: 0x145
    bool bloomUltra;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: bloomUltra and: bloomThreshold
    char __padding54[0x2] = {};
    // [RangeAttribute] Offset: 0x678F60
    // private System.Single _bloomThreshold
    // Size: 0x4
    // Offset: 0x148
    float bloomThreshold;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean _bloomCustomize
    // Size: 0x1
    // Offset: 0x14C
    bool bloomCustomize;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _bloomDebug
    // Size: 0x1
    // Offset: 0x14D
    bool bloomDebug;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: bloomDebug and: bloomWeight0
    char __padding57[0x2] = {};
    // [RangeAttribute] Offset: 0x678FC0
    // private System.Single _bloomWeight0
    // Size: 0x4
    // Offset: 0x150
    float bloomWeight0;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x679000
    // private System.Single _bloomWeight1
    // Size: 0x4
    // Offset: 0x154
    float bloomWeight1;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x679040
    // private System.Single _bloomWeight2
    // Size: 0x4
    // Offset: 0x158
    float bloomWeight2;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x679080
    // private System.Single _bloomWeight3
    // Size: 0x4
    // Offset: 0x15C
    float bloomWeight3;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x6790C0
    // private System.Single _bloomWeight4
    // Size: 0x4
    // Offset: 0x160
    float bloomWeight4;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x679100
    // private System.Single _bloomWeight5
    // Size: 0x4
    // Offset: 0x164
    float bloomWeight5;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean _bloomBlur
    // Size: 0x1
    // Offset: 0x168
    bool bloomBlur;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: bloomBlur and: bloomDepthAtten
    char __padding64[0x3] = {};
    // [RangeAttribute] Offset: 0x679150
    // private System.Single _bloomDepthAtten
    // Size: 0x4
    // Offset: 0x16C
    float bloomDepthAtten;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x679190
    // private System.Single _bloomLayerZBias
    // Size: 0x4
    // Offset: 0x170
    float bloomLayerZBias;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean _anamorphicFlares
    // Size: 0x1
    // Offset: 0x174
    bool anamorphicFlares;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: anamorphicFlares and: anamorphicFlaresIntensity
    char __padding67[0x3] = {};
    // [RangeAttribute] Offset: 0x6791E0
    // private System.Single _anamorphicFlaresIntensity
    // Size: 0x4
    // Offset: 0x178
    float anamorphicFlaresIntensity;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean _anamorphicFlaresAntiflicker
    // Size: 0x1
    // Offset: 0x17C
    bool anamorphicFlaresAntiflicker;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _anamorphicFlaresUltra
    // Size: 0x1
    // Offset: 0x17D
    bool anamorphicFlaresUltra;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: anamorphicFlaresUltra and: anamorphicFlaresThreshold
    char __padding70[0x2] = {};
    // [RangeAttribute] Offset: 0x679240
    // private System.Single _anamorphicFlaresThreshold
    // Size: 0x4
    // Offset: 0x180
    float anamorphicFlaresThreshold;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x679280
    // private System.Single _anamorphicFlaresSpread
    // Size: 0x4
    // Offset: 0x184
    float anamorphicFlaresSpread;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean _anamorphicFlaresVertical
    // Size: 0x1
    // Offset: 0x188
    bool anamorphicFlaresVertical;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: anamorphicFlaresVertical and: anamorphicFlaresTint
    char __padding73[0x3] = {};
    // private UnityEngine.Color _anamorphicFlaresTint
    // Size: 0x10
    // Offset: 0x18C
    ::UnityEngine::Color anamorphicFlaresTint;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private System.Boolean _anamorphicFlaresBlur
    // Size: 0x1
    // Offset: 0x19C
    bool anamorphicFlaresBlur;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _depthOfField
    // Size: 0x1
    // Offset: 0x19D
    bool depthOfField;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _depthOfFieldTransparencySupport
    // Size: 0x1
    // Offset: 0x19E
    bool depthOfFieldTransparencySupport;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: depthOfFieldTransparencySupport and: depthOfFieldTransparencyLayerMask
    char __padding77[0x1] = {};
    // private UnityEngine.LayerMask _depthOfFieldTransparencyLayerMask
    // Size: 0x4
    // Offset: 0x1A0
    ::UnityEngine::LayerMask depthOfFieldTransparencyLayerMask;
    // Field size check
    static_assert(sizeof(::UnityEngine::LayerMask) == 0x4);
    // Padding between fields: depthOfFieldTransparencyLayerMask and: depthOfFieldTargetFocus
    char __padding78[0x4] = {};
    // private UnityEngine.Transform _depthOfFieldTargetFocus
    // Size: 0x8
    // Offset: 0x1A8
    ::UnityEngine::Transform* depthOfFieldTargetFocus;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private System.Boolean _depthOfFieldDebug
    // Size: 0x1
    // Offset: 0x1B0
    bool depthOfFieldDebug;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _depthOfFieldAutofocus
    // Size: 0x1
    // Offset: 0x1B1
    bool depthOfFieldAutofocus;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: depthOfFieldAutofocus and: depthofFieldAutofocusViewportPoint
    char __padding81[0x2] = {};
    // private UnityEngine.Vector2 _depthofFieldAutofocusViewportPoint
    // Size: 0x8
    // Offset: 0x1B4
    ::UnityEngine::Vector2 depthofFieldAutofocusViewportPoint;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // private System.Single _depthOfFieldAutofocusMinDistance
    // Size: 0x4
    // Offset: 0x1BC
    float depthOfFieldAutofocusMinDistance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _depthOfFieldAutofocusMaxDistance
    // Size: 0x4
    // Offset: 0x1C0
    float depthOfFieldAutofocusMaxDistance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.LayerMask _depthOfFieldAutofocusLayerMask
    // Size: 0x4
    // Offset: 0x1C4
    ::UnityEngine::LayerMask depthOfFieldAutofocusLayerMask;
    // Field size check
    static_assert(sizeof(::UnityEngine::LayerMask) == 0x4);
    // private UnityEngine.LayerMask _depthOfFieldExclusionLayerMask
    // Size: 0x4
    // Offset: 0x1C8
    ::UnityEngine::LayerMask depthOfFieldExclusionLayerMask;
    // Field size check
    static_assert(sizeof(::UnityEngine::LayerMask) == 0x4);
    // [RangeAttribute] Offset: 0x6793A4
    // private System.Single _depthOfFieldExclusionLayerMaskDownsampling
    // Size: 0x4
    // Offset: 0x1CC
    float depthOfFieldExclusionLayerMaskDownsampling;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x6793E4
    // private System.Single _depthOfFieldTransparencySupportDownsampling
    // Size: 0x4
    // Offset: 0x1D0
    float depthOfFieldTransparencySupportDownsampling;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x679424
    // private System.Single _depthOfFieldExclusionBias
    // Size: 0x4
    // Offset: 0x1D4
    float depthOfFieldExclusionBias;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x679468
    // private System.Single _depthOfFieldDistance
    // Size: 0x4
    // Offset: 0x1D8
    float depthOfFieldDistance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x6794AC
    // private System.Single _depthOfFieldFocusSpeed
    // Size: 0x4
    // Offset: 0x1DC
    float depthOfFieldFocusSpeed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x6794F0
    // private System.Int32 _depthOfFieldDownsampling
    // Size: 0x4
    // Offset: 0x1E0
    int depthOfFieldDownsampling;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [RangeAttribute] Offset: 0x679530
    // private System.Int32 _depthOfFieldMaxSamples
    // Size: 0x4
    // Offset: 0x1E4
    int depthOfFieldMaxSamples;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [RangeAttribute] Offset: 0x679570
    // private System.Single _depthOfFieldFocalLength
    // Size: 0x4
    // Offset: 0x1E8
    float depthOfFieldFocalLength;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _depthOfFieldAperture
    // Size: 0x4
    // Offset: 0x1EC
    float depthOfFieldAperture;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean _depthOfFieldForegroundBlur
    // Size: 0x1
    // Offset: 0x1F0
    bool depthOfFieldForegroundBlur;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _depthOfFieldForegroundBlurHQ
    // Size: 0x1
    // Offset: 0x1F1
    bool depthOfFieldForegroundBlurHQ;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: depthOfFieldForegroundBlurHQ and: depthOfFieldForegroundDistance
    char __padding97[0x2] = {};
    // private System.Single _depthOfFieldForegroundDistance
    // Size: 0x4
    // Offset: 0x1F4
    float depthOfFieldForegroundDistance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean _depthOfFieldBokeh
    // Size: 0x1
    // Offset: 0x1F8
    bool depthOfFieldBokeh;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: depthOfFieldBokeh and: depthOfFieldBokehThreshold
    char __padding99[0x3] = {};
    // [RangeAttribute] Offset: 0x679604
    // private System.Single _depthOfFieldBokehThreshold
    // Size: 0x4
    // Offset: 0x1FC
    float depthOfFieldBokehThreshold;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x679644
    // private System.Single _depthOfFieldBokehIntensity
    // Size: 0x4
    // Offset: 0x200
    float depthOfFieldBokehIntensity;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _depthOfFieldMaxBrightness
    // Size: 0x4
    // Offset: 0x204
    float depthOfFieldMaxBrightness;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x679694
    // private System.Single _depthOfFieldMaxDistance
    // Size: 0x4
    // Offset: 0x208
    float depthOfFieldMaxDistance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.FilterMode _depthOfFieldFilterMode
    // Size: 0x4
    // Offset: 0x20C
    ::UnityEngine::FilterMode depthOfFieldFilterMode;
    // Field size check
    static_assert(sizeof(::UnityEngine::FilterMode) == 0x4);
    // public BeautifyEffect.OnBeforeFocusEvent OnBeforeFocus
    // Size: 0x8
    // Offset: 0x210
    ::BeautifyEffect::OnBeforeFocusEvent* OnBeforeFocus;
    // Field size check
    static_assert(sizeof(::BeautifyEffect::OnBeforeFocusEvent*) == 0x8);
    // private System.Boolean _eyeAdaptation
    // Size: 0x1
    // Offset: 0x218
    bool eyeAdaptation;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: eyeAdaptation and: eyeAdaptationMinExposure
    char __padding106[0x3] = {};
    // [RangeAttribute] Offset: 0x6796F4
    // private System.Single _eyeAdaptationMinExposure
    // Size: 0x4
    // Offset: 0x21C
    float eyeAdaptationMinExposure;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x679734
    // private System.Single _eyeAdaptationMaxExposure
    // Size: 0x4
    // Offset: 0x220
    float eyeAdaptationMaxExposure;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x679778
    // private System.Single _eyeAdaptationSpeedToLight
    // Size: 0x4
    // Offset: 0x224
    float eyeAdaptationSpeedToLight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x6797B8
    // private System.Single _eyeAdaptationSpeedToDark
    // Size: 0x4
    // Offset: 0x228
    float eyeAdaptationSpeedToDark;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean _purkinje
    // Size: 0x1
    // Offset: 0x22C
    bool purkinje;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: purkinje and: purkinjeAmount
    char __padding111[0x3] = {};
    // [RangeAttribute] Offset: 0x679808
    // private System.Single _purkinjeAmount
    // Size: 0x4
    // Offset: 0x230
    float purkinjeAmount;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x679848
    // private System.Single _purkinjeLuminanceThreshold
    // Size: 0x4
    // Offset: 0x234
    float purkinjeLuminanceThreshold;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private BeautifyEffect.BEAUTIFY_TMO _tonemap
    // Size: 0x4
    // Offset: 0x238
    ::BeautifyEffect::BEAUTIFY_TMO tonemap;
    // Field size check
    static_assert(sizeof(::BeautifyEffect::BEAUTIFY_TMO) == 0x4);
    // private System.Boolean _sunFlares
    // Size: 0x1
    // Offset: 0x23C
    bool sunFlares;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: sunFlares and: sun
    char __padding115[0x3] = {};
    // private UnityEngine.Transform _sun
    // Size: 0x8
    // Offset: 0x240
    ::UnityEngine::Transform* sun;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private UnityEngine.LayerMask _sunFlaresLayerMask
    // Size: 0x4
    // Offset: 0x248
    ::UnityEngine::LayerMask sunFlaresLayerMask;
    // Field size check
    static_assert(sizeof(::UnityEngine::LayerMask) == 0x4);
    // [RangeAttribute] Offset: 0x6798C8
    // private System.Single _sunFlaresIntensity
    // Size: 0x4
    // Offset: 0x24C
    float sunFlaresIntensity;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x679908
    // private System.Single _sunFlaresSolarWindSpeed
    // Size: 0x4
    // Offset: 0x250
    float sunFlaresSolarWindSpeed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Color _sunFlaresTint
    // Size: 0x10
    // Offset: 0x254
    ::UnityEngine::Color sunFlaresTint;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // [RangeAttribute] Offset: 0x679958
    // private System.Int32 _sunFlaresDownsampling
    // Size: 0x4
    // Offset: 0x264
    int sunFlaresDownsampling;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [RangeAttribute] Offset: 0x679998
    // private System.Single _sunFlaresSunIntensity
    // Size: 0x4
    // Offset: 0x268
    float sunFlaresSunIntensity;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x6799D8
    // private System.Single _sunFlaresSunDiskSize
    // Size: 0x4
    // Offset: 0x26C
    float sunFlaresSunDiskSize;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x679A18
    // private System.Single _sunFlaresSunRayDiffractionIntensity
    // Size: 0x4
    // Offset: 0x270
    float sunFlaresSunRayDiffractionIntensity;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x679A58
    // private System.Single _sunFlaresSunRayDiffractionThreshold
    // Size: 0x4
    // Offset: 0x274
    float sunFlaresSunRayDiffractionThreshold;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x679A98
    // private System.Single _sunFlaresCoronaRays1Length
    // Size: 0x4
    // Offset: 0x278
    float sunFlaresCoronaRays1Length;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x679ADC
    // private System.Int32 _sunFlaresCoronaRays1Streaks
    // Size: 0x4
    // Offset: 0x27C
    int sunFlaresCoronaRays1Streaks;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [RangeAttribute] Offset: 0x679B1C
    // private System.Single _sunFlaresCoronaRays1Spread
    // Size: 0x4
    // Offset: 0x280
    float sunFlaresCoronaRays1Spread;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x679B60
    // private System.Single _sunFlaresCoronaRays1AngleOffset
    // Size: 0x4
    // Offset: 0x284
    float sunFlaresCoronaRays1AngleOffset;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x679BA4
    // private System.Single _sunFlaresCoronaRays2Length
    // Size: 0x4
    // Offset: 0x288
    float sunFlaresCoronaRays2Length;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x679BE8
    // private System.Int32 _sunFlaresCoronaRays2Streaks
    // Size: 0x4
    // Offset: 0x28C
    int sunFlaresCoronaRays2Streaks;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [RangeAttribute] Offset: 0x679C28
    // private System.Single _sunFlaresCoronaRays2Spread
    // Size: 0x4
    // Offset: 0x290
    float sunFlaresCoronaRays2Spread;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x679C6C
    // private System.Single _sunFlaresCoronaRays2AngleOffset
    // Size: 0x4
    // Offset: 0x294
    float sunFlaresCoronaRays2AngleOffset;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x679CB0
    // private System.Single _sunFlaresGhosts1Size
    // Size: 0x4
    // Offset: 0x298
    float sunFlaresGhosts1Size;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x679CF0
    // private System.Single _sunFlaresGhosts1Offset
    // Size: 0x4
    // Offset: 0x29C
    float sunFlaresGhosts1Offset;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x679D30
    // private System.Single _sunFlaresGhosts1Brightness
    // Size: 0x4
    // Offset: 0x2A0
    float sunFlaresGhosts1Brightness;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x679D70
    // private System.Single _sunFlaresGhosts2Size
    // Size: 0x4
    // Offset: 0x2A4
    float sunFlaresGhosts2Size;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x679DB0
    // private System.Single _sunFlaresGhosts2Offset
    // Size: 0x4
    // Offset: 0x2A8
    float sunFlaresGhosts2Offset;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x679DF0
    // private System.Single _sunFlaresGhosts2Brightness
    // Size: 0x4
    // Offset: 0x2AC
    float sunFlaresGhosts2Brightness;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x679E30
    // private System.Single _sunFlaresGhosts3Size
    // Size: 0x4
    // Offset: 0x2B0
    float sunFlaresGhosts3Size;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x679E70
    // private System.Single _sunFlaresGhosts3Brightness
    // Size: 0x4
    // Offset: 0x2B4
    float sunFlaresGhosts3Brightness;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x679EB0
    // private System.Single _sunFlaresGhosts3Offset
    // Size: 0x4
    // Offset: 0x2B8
    float sunFlaresGhosts3Offset;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x679EF0
    // private System.Single _sunFlaresGhosts4Size
    // Size: 0x4
    // Offset: 0x2BC
    float sunFlaresGhosts4Size;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x679F30
    // private System.Single _sunFlaresGhosts4Offset
    // Size: 0x4
    // Offset: 0x2C0
    float sunFlaresGhosts4Offset;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x679F70
    // private System.Single _sunFlaresGhosts4Brightness
    // Size: 0x4
    // Offset: 0x2C4
    float sunFlaresGhosts4Brightness;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x679FB0
    // private System.Single _sunFlaresHaloOffset
    // Size: 0x4
    // Offset: 0x2C8
    float sunFlaresHaloOffset;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x679FF0
    // private System.Single _sunFlaresHaloAmplitude
    // Size: 0x4
    // Offset: 0x2CC
    float sunFlaresHaloAmplitude;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x67A034
    // private System.Single _sunFlaresHaloIntensity
    // Size: 0x4
    // Offset: 0x2D0
    float sunFlaresHaloIntensity;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean _sunFlaresRotationDeadZone
    // Size: 0x1
    // Offset: 0x2D4
    bool sunFlaresRotationDeadZone;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _blur
    // Size: 0x1
    // Offset: 0x2D5
    bool blur;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: blur and: blurIntensity
    char __padding150[0x2] = {};
    // [RangeAttribute] Offset: 0x67A094
    // private System.Single _blurIntensity
    // Size: 0x4
    // Offset: 0x2D8
    float blurIntensity;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x67A0D4
    // private System.Int32 _pixelateAmount
    // Size: 0x4
    // Offset: 0x2DC
    int pixelateAmount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean _pixelateDownscale
    // Size: 0x1
    // Offset: 0x2E0
    bool pixelateDownscale;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: pixelateDownscale and: antialiasStrength
    char __padding153[0x3] = {};
    // [RangeAttribute] Offset: 0x67A128
    // private System.Single _antialiasStrength
    // Size: 0x4
    // Offset: 0x2E4
    float antialiasStrength;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x67A168
    // private System.Single _antialiasDepthThreshold
    // Size: 0x4
    // Offset: 0x2E8
    float antialiasDepthThreshold;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Boolean isDirty
    // Size: 0x1
    // Offset: 0x2EC
    bool isDirty;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isDirty and: bMatDesktop
    char __padding156[0x3] = {};
    // private UnityEngine.Material bMatDesktop
    // Size: 0x8
    // Offset: 0x2F0
    ::UnityEngine::Material* bMatDesktop;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // private UnityEngine.Material bMatMobile
    // Size: 0x8
    // Offset: 0x2F8
    ::UnityEngine::Material* bMatMobile;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // private UnityEngine.Material bMatBasic
    // Size: 0x8
    // Offset: 0x300
    ::UnityEngine::Material* bMatBasic;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // private UnityEngine.Material bMat
    // Size: 0x8
    // Offset: 0x308
    ::UnityEngine::Material* bMat;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // private UnityEngine.Camera currentCamera
    // Size: 0x8
    // Offset: 0x310
    ::UnityEngine::Camera* currentCamera;
    // Field size check
    static_assert(sizeof(::UnityEngine::Camera*) == 0x8);
    // private UnityEngine.Vector3 camPrevForward
    // Size: 0xC
    // Offset: 0x318
    ::UnityEngine::Vector3 camPrevForward;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 camPrevPos
    // Size: 0xC
    // Offset: 0x324
    ::UnityEngine::Vector3 camPrevPos;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private System.Single currSens
    // Size: 0x4
    // Offset: 0x330
    float currSens;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Int32 renderPass
    // Size: 0x4
    // Offset: 0x334
    int renderPass;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private UnityEngine.RenderTextureFormat rtFormat
    // Size: 0x4
    // Offset: 0x338
    ::UnityEngine::RenderTextureFormat rtFormat;
    // Field size check
    static_assert(sizeof(::UnityEngine::RenderTextureFormat) == 0x4);
    // Padding between fields: rtFormat and: rt
    char __padding166[0x4] = {};
    // private UnityEngine.RenderTexture[] rt
    // Size: 0x8
    // Offset: 0x340
    ::ArrayW<::UnityEngine::RenderTexture*> rt;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::RenderTexture*>) == 0x8);
    // private UnityEngine.RenderTexture[] rtAF
    // Size: 0x8
    // Offset: 0x348
    ::ArrayW<::UnityEngine::RenderTexture*> rtAF;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::RenderTexture*>) == 0x8);
    // private UnityEngine.RenderTexture[] rtEA
    // Size: 0x8
    // Offset: 0x350
    ::ArrayW<::UnityEngine::RenderTexture*> rtEA;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::RenderTexture*>) == 0x8);
    // private UnityEngine.RenderTexture rtEAacum
    // Size: 0x8
    // Offset: 0x358
    ::UnityEngine::RenderTexture* rtEAacum;
    // Field size check
    static_assert(sizeof(::UnityEngine::RenderTexture*) == 0x8);
    // private UnityEngine.RenderTexture rtEAHist
    // Size: 0x8
    // Offset: 0x360
    ::UnityEngine::RenderTexture* rtEAHist;
    // Field size check
    static_assert(sizeof(::UnityEngine::RenderTexture*) == 0x8);
    // private System.Single dofPrevDistance
    // Size: 0x4
    // Offset: 0x368
    float dofPrevDistance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single dofLastAutofocusDistance
    // Size: 0x4
    // Offset: 0x36C
    float dofLastAutofocusDistance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Vector4 dofLastBokehData
    // Size: 0x10
    // Offset: 0x370
    ::UnityEngine::Vector4 dofLastBokehData;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector4) == 0x10);
    // private UnityEngine.Camera sceneCamera
    // Size: 0x8
    // Offset: 0x380
    ::UnityEngine::Camera* sceneCamera;
    // Field size check
    static_assert(sizeof(::UnityEngine::Camera*) == 0x8);
    // private UnityEngine.Camera depthCam
    // Size: 0x8
    // Offset: 0x388
    ::UnityEngine::Camera* depthCam;
    // Field size check
    static_assert(sizeof(::UnityEngine::Camera*) == 0x8);
    // private UnityEngine.GameObject depthCamObj
    // Size: 0x8
    // Offset: 0x390
    ::UnityEngine::GameObject* depthCamObj;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private System.Collections.Generic.List`1<System.String> shaderKeywords
    // Size: 0x8
    // Offset: 0x398
    ::System::Collections::Generic::List_1<::StringW>* shaderKeywords;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::StringW>*) == 0x8);
    // private UnityEngine.Shader depthShader
    // Size: 0x8
    // Offset: 0x3A0
    ::UnityEngine::Shader* depthShader;
    // Field size check
    static_assert(sizeof(::UnityEngine::Shader*) == 0x8);
    // private UnityEngine.Shader dofExclusionShader
    // Size: 0x8
    // Offset: 0x3A8
    ::UnityEngine::Shader* dofExclusionShader;
    // Field size check
    static_assert(sizeof(::UnityEngine::Shader*) == 0x8);
    // private System.Boolean shouldUpdateMaterialProperties
    // Size: 0x1
    // Offset: 0x3B0
    bool shouldUpdateMaterialProperties;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: shouldUpdateMaterialProperties and: sunFlareCurrentIntensity
    char __padding181[0x3] = {};
    // private System.Single sunFlareCurrentIntensity
    // Size: 0x4
    // Offset: 0x3B4
    float sunFlareCurrentIntensity;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Vector4 sunLastScrPos
    // Size: 0x10
    // Offset: 0x3B8
    ::UnityEngine::Vector4 sunLastScrPos;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector4) == 0x10);
    // private System.Single sunLastRot
    // Size: 0x4
    // Offset: 0x3C8
    float sunLastRot;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: sunLastRot and: flareNoise
    char __padding184[0x4] = {};
    // private UnityEngine.Texture2D flareNoise
    // Size: 0x8
    // Offset: 0x3D0
    ::UnityEngine::Texture2D* flareNoise;
    // Field size check
    static_assert(sizeof(::UnityEngine::Texture2D*) == 0x8);
    // private UnityEngine.RenderTexture dofDepthTexture
    // Size: 0x8
    // Offset: 0x3D8
    ::UnityEngine::RenderTexture* dofDepthTexture;
    // Field size check
    static_assert(sizeof(::UnityEngine::RenderTexture*) == 0x8);
    // private UnityEngine.RenderTexture dofExclusionTexture
    // Size: 0x8
    // Offset: 0x3E0
    ::UnityEngine::RenderTexture* dofExclusionTexture;
    // Field size check
    static_assert(sizeof(::UnityEngine::RenderTexture*) == 0x8);
    // private UnityEngine.RenderTexture bloomSourceTexture
    // Size: 0x8
    // Offset: 0x3E8
    ::UnityEngine::RenderTexture* bloomSourceTexture;
    // Field size check
    static_assert(sizeof(::UnityEngine::RenderTexture*) == 0x8);
    // private UnityEngine.RenderTexture bloomSourceDepthTexture
    // Size: 0x8
    // Offset: 0x3F0
    ::UnityEngine::RenderTexture* bloomSourceDepthTexture;
    // Field size check
    static_assert(sizeof(::UnityEngine::RenderTexture*) == 0x8);
    // private UnityEngine.RenderTexture pixelateTexture
    // Size: 0x8
    // Offset: 0x3F8
    ::UnityEngine::RenderTexture* pixelateTexture;
    // Field size check
    static_assert(sizeof(::UnityEngine::RenderTexture*) == 0x8);
    // private UnityEngine.RenderTextureDescriptor rtDescBase
    // Size: 0x34
    // Offset: 0x400
    ::UnityEngine::RenderTextureDescriptor rtDescBase;
    // Field size check
    static_assert(sizeof(::UnityEngine::RenderTextureDescriptor) == 0x34);
    // private System.Single sunFlareTime
    // Size: 0x4
    // Offset: 0x434
    float sunFlareTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Int32 dofCurrentLayerMaskValue
    // Size: 0x4
    // Offset: 0x438
    int dofCurrentLayerMaskValue;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 bloomCurrentLayerMaskValue
    // Size: 0x4
    // Offset: 0x43C
    int bloomCurrentLayerMaskValue;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get static field: static private BeautifyEffect.Beautify _beautify
    static ::BeautifyEffect::Beautify* _get__beautify();
    // Set static field: static private BeautifyEffect.Beautify _beautify
    static void _set__beautify(::BeautifyEffect::Beautify* value);
    // static field const value: static public System.String SKW_BLOOM
    static constexpr const char* SKW_BLOOM = "BEAUTIFY_BLOOM";
    // Get static field: static public System.String SKW_BLOOM
    static ::StringW _get_SKW_BLOOM();
    // Set static field: static public System.String SKW_BLOOM
    static void _set_SKW_BLOOM(::StringW value);
    // static field const value: static public System.String SKW_LUT
