// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.ScriptableObject
#include "UnityEngine/ScriptableObject.hpp"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
// Including type: UnityEngine.LayerMask
#include "UnityEngine/LayerMask.hpp"
// Including type: UnityEngine.Vector2
#include "UnityEngine/Vector2.hpp"
// Including type: UnityEngine.FilterMode
#include "UnityEngine/FilterMode.hpp"
// Including type: BeautifyEffect.BEAUTIFY_TMO
#include "BeautifyEffect/BEAUTIFY_TMO.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Texture2D
  class Texture2D;
  // Forward declaring type: Transform
  class Transform;
}
// Forward declaring namespace: BeautifyEffect
namespace BeautifyEffect {
  // Forward declaring type: Beautify
  class Beautify;
}
// Completed forward declares
// Type namespace: BeautifyEffect
namespace BeautifyEffect {
  // Forward declaring type: BeautifyProfile
  class BeautifyProfile;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::BeautifyEffect::BeautifyProfile);
DEFINE_IL2CPP_ARG_TYPE(::BeautifyEffect::BeautifyProfile*, "BeautifyEffect", "BeautifyProfile");
// Type namespace: BeautifyEffect
namespace BeautifyEffect {
  // Size: 0x2B1
  #pragma pack(push, 1)
  // Autogenerated type: BeautifyEffect.BeautifyProfile
  // [TokenAttribute] Offset: FFFFFFFF
  // [CreateAssetMenuAttribute] Offset: 66BF0C
  class BeautifyProfile : public ::UnityEngine::ScriptableObject {
    public:
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // [RangeAttribute] Offset: 0x67A1BC
    // public System.Single dither
    // Size: 0x4
    // Offset: 0x18
    float dither;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x67A1D8
    // public System.Single ditherDepth
    // Size: 0x4
    // Offset: 0x1C
    float ditherDepth;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x67A1F0
    // public System.Single sharpenMinDepth
    // Size: 0x4
    // Offset: 0x20
    float sharpenMinDepth;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x67A208
    // public System.Single sharpenMaxDepth
    // Size: 0x4
    // Offset: 0x24
    float sharpenMaxDepth;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x67A224
    // public System.Single sharpen
    // Size: 0x4
    // Offset: 0x28
    float sharpen;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x67A23C
    // public System.Single sharpenDepthThreshold
    // Size: 0x4
    // Offset: 0x2C
    float sharpenDepthThreshold;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public UnityEngine.Color tintColor
    // Size: 0x10
    // Offset: 0x30
    ::UnityEngine::Color tintColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // [RangeAttribute] Offset: 0x67A258
    // public System.Single sharpenRelaxation
    // Size: 0x4
    // Offset: 0x40
    float sharpenRelaxation;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x67A274
    // public System.Single sharpenClamp
    // Size: 0x4
    // Offset: 0x44
    float sharpenClamp;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x67A28C
    // public System.Single sharpenMotionSensibility
    // Size: 0x4
    // Offset: 0x48
    float sharpenMotionSensibility;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x67A2A4
    // public System.Single antialiasStrength
    // Size: 0x4
    // Offset: 0x4C
    float antialiasStrength;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x67A2BC
    // public System.Single antialiasDepthThreshold
    // Size: 0x4
    // Offset: 0x50
    float antialiasDepthThreshold;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x67A2D8
    // public System.Single saturate
    // Size: 0x4
    // Offset: 0x54
    float saturate;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x67A2F0
    // public System.Single contrast
    // Size: 0x4
    // Offset: 0x58
    float contrast;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x67A308
    // public System.Single brightness
    // Size: 0x4
    // Offset: 0x5C
    float brightness;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x67A320
    // public System.Single daltonize
    // Size: 0x4
    // Offset: 0x60
    float daltonize;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Boolean vignetting
    // Size: 0x1
    // Offset: 0x64
    bool vignetting;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: vignetting and: vignettingColor
    char __padding16[0x3] = {};
    // public UnityEngine.Color vignettingColor
    // Size: 0x10
    // Offset: 0x68
    ::UnityEngine::Color vignettingColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // public System.Single vignettingFade
    // Size: 0x4
    // Offset: 0x78
    float vignettingFade;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Boolean vignettingCircularShape
    // Size: 0x1
    // Offset: 0x7C
    bool vignettingCircularShape;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: vignettingCircularShape and: vignettingAspectRatio
    char __padding19[0x3] = {};
    // public System.Single vignettingAspectRatio
    // Size: 0x4
    // Offset: 0x80
    float vignettingAspectRatio;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x67A338
    // public System.Single vignettingBlink
    // Size: 0x4
    // Offset: 0x84
    float vignettingBlink;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public UnityEngine.Texture2D vignettingMask
    // Size: 0x8
    // Offset: 0x88
    ::UnityEngine::Texture2D* vignettingMask;
    // Field size check
    static_assert(sizeof(::UnityEngine::Texture2D*) == 0x8);
    // public System.Boolean frame
    // Size: 0x1
    // Offset: 0x90
    bool frame;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: frame and: frameColor
    char __padding23[0x3] = {};
    // public UnityEngine.Color frameColor
    // Size: 0x10
    // Offset: 0x94
    ::UnityEngine::Color frameColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // Padding between fields: frameColor and: frameMask
    char __padding24[0x4] = {};
    // public UnityEngine.Texture2D frameMask
    // Size: 0x8
    // Offset: 0xA8
    ::UnityEngine::Texture2D* frameMask;
    // Field size check
    static_assert(sizeof(::UnityEngine::Texture2D*) == 0x8);
    // public System.Boolean lut
    // Size: 0x1
    // Offset: 0xB0
    bool lut;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: lut and: lutIntensity
    char __padding26[0x3] = {};
    // [RangeAttribute] Offset: 0x67A350
    // public System.Single lutIntensity
    // Size: 0x4
    // Offset: 0xB4
    float lutIntensity;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public UnityEngine.Texture2D lutTexture
    // Size: 0x8
    // Offset: 0xB8
    ::UnityEngine::Texture2D* lutTexture;
    // Field size check
    static_assert(sizeof(::UnityEngine::Texture2D*) == 0x8);
    // public System.Boolean nightVision
    // Size: 0x1
    // Offset: 0xC0
    bool nightVision;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: nightVision and: nightVisionColor
    char __padding29[0x3] = {};
    // public UnityEngine.Color nightVisionColor
    // Size: 0x10
    // Offset: 0xC4
    ::UnityEngine::Color nightVisionColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // public System.Boolean outline
    // Size: 0x1
    // Offset: 0xD4
    bool outline;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: outline and: outlineColor
    char __padding31[0x3] = {};
    // public UnityEngine.Color outlineColor
    // Size: 0x10
    // Offset: 0xD8
    ::UnityEngine::Color outlineColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // public System.Boolean thermalVision
    // Size: 0x1
    // Offset: 0xE8
    bool thermalVision;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean lensDirt
    // Size: 0x1
    // Offset: 0xE9
    bool lensDirt;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: lensDirt and: lensDirtThreshold
    char __padding34[0x2] = {};
    // [RangeAttribute] Offset: 0x67A368
    // public System.Single lensDirtThreshold
    // Size: 0x4
    // Offset: 0xEC
    float lensDirtThreshold;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x67A380
    // public System.Single lensDirtIntensity
    // Size: 0x4
    // Offset: 0xF0
    float lensDirtIntensity;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: lensDirtIntensity and: lensDirtTexture
    char __padding36[0x4] = {};
    // public UnityEngine.Texture2D lensDirtTexture
    // Size: 0x8
    // Offset: 0xF8
    ::UnityEngine::Texture2D* lensDirtTexture;
    // Field size check
    static_assert(sizeof(::UnityEngine::Texture2D*) == 0x8);
    // public System.Boolean bloom
    // Size: 0x1
    // Offset: 0x100
    bool bloom;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: bloom and: bloomCullingMask
    char __padding38[0x3] = {};
    // public UnityEngine.LayerMask bloomCullingMask
    // Size: 0x4
    // Offset: 0x104
    ::UnityEngine::LayerMask bloomCullingMask;
    // Field size check
    static_assert(sizeof(::UnityEngine::LayerMask) == 0x4);
    // [RangeAttribute] Offset: 0x67A398
    // public System.Single bloomLayerMaskDownsampling
    // Size: 0x4
    // Offset: 0x108
    float bloomLayerMaskDownsampling;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x67A3B0
    // public System.Single bloomIntensity
    // Size: 0x4
    // Offset: 0x10C
    float bloomIntensity;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single bloomMaxBrightness
    // Size: 0x4
    // Offset: 0x110
    float bloomMaxBrightness;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x67A3C8
    // public System.Single bloomBoost0
    // Size: 0x4
    // Offset: 0x114
    float bloomBoost0;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x67A3E0
    // public System.Single bloomBoost1
    // Size: 0x4
    // Offset: 0x118
    float bloomBoost1;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x67A3F8
    // public System.Single bloomBoost2
    // Size: 0x4
    // Offset: 0x11C
    float bloomBoost2;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x67A410
    // public System.Single bloomBoost3
    // Size: 0x4
    // Offset: 0x120
    float bloomBoost3;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x67A428
    // public System.Single bloomBoost4
    // Size: 0x4
    // Offset: 0x124
    float bloomBoost4;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x67A440
    // public System.Single bloomBoost5
    // Size: 0x4
    // Offset: 0x128
    float bloomBoost5;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Boolean bloomAntiflicker
    // Size: 0x1
    // Offset: 0x12C
    bool bloomAntiflicker;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean bloomUltra
    // Size: 0x1
    // Offset: 0x12D
    bool bloomUltra;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: bloomUltra and: bloomThreshold
    char __padding50[0x2] = {};
    // [RangeAttribute] Offset: 0x67A458
    // public System.Single bloomThreshold
    // Size: 0x4
    // Offset: 0x130
    float bloomThreshold;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Boolean bloomCustomize
    // Size: 0x1
    // Offset: 0x134
    bool bloomCustomize;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: bloomCustomize and: bloomWeight0
    char __padding52[0x3] = {};
    // [RangeAttribute] Offset: 0x67A470
    // public System.Single bloomWeight0
    // Size: 0x4
    // Offset: 0x138
    float bloomWeight0;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x67A488
    // public System.Single bloomWeight1
    // Size: 0x4
    // Offset: 0x13C
    float bloomWeight1;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x67A4A0
    // public System.Single bloomWeight2
    // Size: 0x4
    // Offset: 0x140
    float bloomWeight2;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x67A4B8
    // public System.Single bloomWeight3
    // Size: 0x4
    // Offset: 0x144
    float bloomWeight3;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x67A4D0
    // public System.Single bloomWeight4
    // Size: 0x4
    // Offset: 0x148
    float bloomWeight4;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x67A4E8
    // public System.Single bloomWeight5
    // Size: 0x4
    // Offset: 0x14C
    float bloomWeight5;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Boolean bloomBlur
    // Size: 0x1
    // Offset: 0x150
    bool bloomBlur;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: bloomBlur and: bloomDepthAtten
    char __padding59[0x3] = {};
    // [RangeAttribute] Offset: 0x67A500
    // public System.Single bloomDepthAtten
    // Size: 0x4
    // Offset: 0x154
    float bloomDepthAtten;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x67A518
    // public System.Single bloomLayerZBias
    // Size: 0x4
    // Offset: 0x158
    float bloomLayerZBias;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Boolean anamorphicFlares
    // Size: 0x1
    // Offset: 0x15C
    bool anamorphicFlares;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: anamorphicFlares and: anamorphicFlaresIntensity
    char __padding62[0x3] = {};
    // [RangeAttribute] Offset: 0x67A530
    // public System.Single anamorphicFlaresIntensity
    // Size: 0x4
    // Offset: 0x160
    float anamorphicFlaresIntensity;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Boolean anamorphicFlaresAntiflicker
    // Size: 0x1
    // Offset: 0x164
    bool anamorphicFlaresAntiflicker;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean anamorphicFlaresUltra
    // Size: 0x1
    // Offset: 0x165
    bool anamorphicFlaresUltra;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: anamorphicFlaresUltra and: anamorphicFlaresThreshold
    char __padding65[0x2] = {};
    // [RangeAttribute] Offset: 0x67A548
    // public System.Single anamorphicFlaresThreshold
    // Size: 0x4
    // Offset: 0x168
    float anamorphicFlaresThreshold;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x67A560
    // public System.Single anamorphicFlaresSpread
    // Size: 0x4
    // Offset: 0x16C
    float anamorphicFlaresSpread;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Boolean anamorphicFlaresVertical
    // Size: 0x1
    // Offset: 0x170
    bool anamorphicFlaresVertical;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: anamorphicFlaresVertical and: anamorphicFlaresTint
    char __padding68[0x3] = {};
    // public UnityEngine.Color anamorphicFlaresTint
    // Size: 0x10
    // Offset: 0x174
    ::UnityEngine::Color anamorphicFlaresTint;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // public System.Boolean anamorphicFlaresBlur
    // Size: 0x1
    // Offset: 0x184
    bool anamorphicFlaresBlur;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean depthOfField
    // Size: 0x1
    // Offset: 0x185
    bool depthOfField;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean depthOfFieldTransparencySupport
    // Size: 0x1
    // Offset: 0x186
    bool depthOfFieldTransparencySupport;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: depthOfFieldTransparencySupport and: depthOfFieldTargetFocus
    char __padding72[0x1] = {};
    // public UnityEngine.Transform depthOfFieldTargetFocus
    // Size: 0x8
    // Offset: 0x188
    ::UnityEngine::Transform* depthOfFieldTargetFocus;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // public System.Boolean depthOfFieldAutofocus
    // Size: 0x1
    // Offset: 0x190
    bool depthOfFieldAutofocus;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: depthOfFieldAutofocus and: depthofFieldAutofocusViewportPoint
    char __padding74[0x3] = {};
    // public UnityEngine.Vector2 depthofFieldAutofocusViewportPoint
    // Size: 0x8
    // Offset: 0x194
    ::UnityEngine::Vector2 depthofFieldAutofocusViewportPoint;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // public UnityEngine.LayerMask depthOfFieldAutofocusLayerMask
    // Size: 0x4
    // Offset: 0x19C
    ::UnityEngine::LayerMask depthOfFieldAutofocusLayerMask;
    // Field size check
    static_assert(sizeof(::UnityEngine::LayerMask) == 0x4);
    // public System.Single depthOfFieldAutofocusMinDistance
    // Size: 0x4
    // Offset: 0x1A0
    float depthOfFieldAutofocusMinDistance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single depthOfFieldAutofocusMaxDistance
    // Size: 0x4
    // Offset: 0x1A4
    float depthOfFieldAutofocusMaxDistance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public UnityEngine.LayerMask depthOfFieldExclusionLayerMask
    // Size: 0x4
    // Offset: 0x1A8
    ::UnityEngine::LayerMask depthOfFieldExclusionLayerMask;
    // Field size check
    static_assert(sizeof(::UnityEngine::LayerMask) == 0x4);
    // [RangeAttribute] Offset: 0x67A57C
    // public System.Single depthOfFieldExclusionLayerMaskDownsampling
    // Size: 0x4
    // Offset: 0x1AC
    float depthOfFieldExclusionLayerMaskDownsampling;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x67A594
    // public System.Single depthOfFieldTransparencySupportDownsampling
    // Size: 0x4
    // Offset: 0x1B0
    float depthOfFieldTransparencySupportDownsampling;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x67A5AC
    // public System.Single depthOfFieldExclusionBias
    // Size: 0x4
    // Offset: 0x1B4
    float depthOfFieldExclusionBias;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x67A5C8
    // public System.Single depthOfFieldDistance
    // Size: 0x4
    // Offset: 0x1B8
    float depthOfFieldDistance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x67A5E4
    // public System.Single depthOfFieldFocusSpeed
    // Size: 0x4
    // Offset: 0x1BC
    float depthOfFieldFocusSpeed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x67A600
    // public System.Int32 depthOfFieldDownsampling
    // Size: 0x4
    // Offset: 0x1C0
    int depthOfFieldDownsampling;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [RangeAttribute] Offset: 0x67A618
    // public System.Int32 depthOfFieldMaxSamples
    // Size: 0x4
    // Offset: 0x1C4
    int depthOfFieldMaxSamples;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [RangeAttribute] Offset: 0x67A630
    // public System.Single depthOfFieldFocalLength
    // Size: 0x4
    // Offset: 0x1C8
    float depthOfFieldFocalLength;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single depthOfFieldAperture
    // Size: 0x4
    // Offset: 0x1CC
    float depthOfFieldAperture;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Boolean depthOfFieldForegroundBlur
    // Size: 0x1
    // Offset: 0x1D0
    bool depthOfFieldForegroundBlur;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean depthOfFieldForegroundBlurHQ
    // Size: 0x1
    // Offset: 0x1D1
    bool depthOfFieldForegroundBlurHQ;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: depthOfFieldForegroundBlurHQ and: depthOfFieldForegroundDistance
    char __padding90[0x2] = {};
    // public System.Single depthOfFieldForegroundDistance
    // Size: 0x4
    // Offset: 0x1D4
    float depthOfFieldForegroundDistance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Boolean depthOfFieldBokeh
    // Size: 0x1
    // Offset: 0x1D8
    bool depthOfFieldBokeh;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: depthOfFieldBokeh and: depthOfFieldBokehThreshold
    char __padding92[0x3] = {};
    // [RangeAttribute] Offset: 0x67A64C
    // public System.Single depthOfFieldBokehThreshold
    // Size: 0x4
    // Offset: 0x1DC
    float depthOfFieldBokehThreshold;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x67A664
    // public System.Single depthOfFieldBokehIntensity
    // Size: 0x4
    // Offset: 0x1E0
    float depthOfFieldBokehIntensity;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single depthOfFieldMaxBrightness
    // Size: 0x4
    // Offset: 0x1E4
    float depthOfFieldMaxBrightness;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single depthOfFieldMaxDistance
    // Size: 0x4
    // Offset: 0x1E8
    float depthOfFieldMaxDistance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public UnityEngine.FilterMode depthOfFieldFilterMode
    // Size: 0x14
    // Offset: 0x1EC
    ::UnityEngine::FilterMode depthOfFieldFilterMode;
    // Field size check
    static_assert(sizeof(::UnityEngine::FilterMode) == 0x14);
    // public UnityEngine.LayerMask depthOfFieldTransparencyLayerMask
    // Size: 0x4
    // Offset: 0x1F0
    ::UnityEngine::LayerMask depthOfFieldTransparencyLayerMask;
    // Field size check
    static_assert(sizeof(::UnityEngine::LayerMask) == 0x4);
    // public System.Boolean eyeAdaptation
    // Size: 0x1
    // Offset: 0x1F4
    bool eyeAdaptation;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: eyeAdaptation and: eyeAdaptationMinExposure
    char __padding99[0x3] = {};
    // [RangeAttribute] Offset: 0x67A67C
    // public System.Single eyeAdaptationMinExposure
    // Size: 0x4
    // Offset: 0x1F8
    float eyeAdaptationMinExposure;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x67A694
    // public System.Single eyeAdaptationMaxExposure
    // Size: 0x4
    // Offset: 0x1FC
    float eyeAdaptationMaxExposure;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x67A6B0
    // public System.Single eyeAdaptationSpeedToLight
    // Size: 0x4
    // Offset: 0x200
    float eyeAdaptationSpeedToLight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x67A6C8
    // public System.Single eyeAdaptationSpeedToDark
    // Size: 0x4
    // Offset: 0x204
    float eyeAdaptationSpeedToDark;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Boolean purkinje
    // Size: 0x1
    // Offset: 0x208
    bool purkinje;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: purkinje and: purkinjeAmount
    char __padding104[0x3] = {};
    // [RangeAttribute] Offset: 0x67A6E0
    // public System.Single purkinjeAmount
    // Size: 0x4
    // Offset: 0x20C
    float purkinjeAmount;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x67A6F8
    // public System.Single purkinjeLuminanceThreshold
    // Size: 0x4
    // Offset: 0x210
    float purkinjeLuminanceThreshold;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public BeautifyEffect.BEAUTIFY_TMO tonemap
    // Size: 0x14
    // Offset: 0x214
    ::BeautifyEffect::BEAUTIFY_TMO tonemap;
    // Field size check
    static_assert(sizeof(::BeautifyEffect::BEAUTIFY_TMO) == 0x14);
    // public System.Boolean sunFlares
    // Size: 0x1
    // Offset: 0x218
    bool sunFlares;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: sunFlares and: sunFlaresIntensity
    char __padding108[0x3] = {};
    // [RangeAttribute] Offset: 0x67A710
    // public System.Single sunFlaresIntensity
    // Size: 0x4
    // Offset: 0x21C
    float sunFlaresIntensity;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x67A728
    // public System.Single sunFlaresSolarWindSpeed
    // Size: 0x4
    // Offset: 0x220
    float sunFlaresSolarWindSpeed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public UnityEngine.Color sunFlaresTint
    // Size: 0x10
    // Offset: 0x224
    ::UnityEngine::Color sunFlaresTint;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // [RangeAttribute] Offset: 0x67A740
    // public System.Int32 sunFlaresDownsampling
    // Size: 0x4
    // Offset: 0x234
    int sunFlaresDownsampling;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [RangeAttribute] Offset: 0x67A758
    // public System.Single sunFlaresSunIntensity
    // Size: 0x4
    // Offset: 0x238
    float sunFlaresSunIntensity;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x67A770
    // public System.Single sunFlaresSunDiskSize
    // Size: 0x4
    // Offset: 0x23C
    float sunFlaresSunDiskSize;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x67A788
    // public System.Single sunFlaresSunRayDiffractionIntensity
    // Size: 0x4
    // Offset: 0x240
    float sunFlaresSunRayDiffractionIntensity;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x67A7A0
    // public System.Single sunFlaresSunRayDiffractionThreshold
    // Size: 0x4
    // Offset: 0x244
    float sunFlaresSunRayDiffractionThreshold;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x67A7B8
    // public System.Single sunFlaresCoronaRays1Length
    // Size: 0x4
    // Offset: 0x248
    float sunFlaresCoronaRays1Length;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x67A7D4
    // public System.Int32 sunFlaresCoronaRays1Streaks
    // Size: 0x4
    // Offset: 0x24C
    int sunFlaresCoronaRays1Streaks;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [RangeAttribute] Offset: 0x67A7EC
    // public System.Single sunFlaresCoronaRays1Spread
    // Size: 0x4
    // Offset: 0x250
    float sunFlaresCoronaRays1Spread;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x67A808
    // public System.Single sunFlaresCoronaRays1AngleOffset
    // Size: 0x4
    // Offset: 0x254
    float sunFlaresCoronaRays1AngleOffset;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x67A824
    // public System.Single sunFlaresCoronaRays2Length
    // Size: 0x4
    // Offset: 0x258
    float sunFlaresCoronaRays2Length;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x67A840
    // public System.Int32 sunFlaresCoronaRays2Streaks
    // Size: 0x4
    // Offset: 0x25C
    int sunFlaresCoronaRays2Streaks;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [RangeAttribute] Offset: 0x67A858
    // public System.Single sunFlaresCoronaRays2Spread
    // Size: 0x4
    // Offset: 0x260
    float sunFlaresCoronaRays2Spread;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x67A874
    // public System.Single sunFlaresCoronaRays2AngleOffset
    // Size: 0x4
    // Offset: 0x264
    float sunFlaresCoronaRays2AngleOffset;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x67A890
    // public System.Single sunFlaresGhosts1Size
    // Size: 0x4
    // Offset: 0x268
    float sunFlaresGhosts1Size;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x67A8A8
    // public System.Single sunFlaresGhosts1Offset
    // Size: 0x4
    // Offset: 0x26C
    float sunFlaresGhosts1Offset;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x67A8C0
    // public System.Single sunFlaresGhosts1Brightness
    // Size: 0x4
    // Offset: 0x270
    float sunFlaresGhosts1Brightness;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x67A8D8
    // public System.Single sunFlaresGhosts2Size
    // Size: 0x4
    // Offset: 0x274
    float sunFlaresGhosts2Size;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x67A8F0
    // public System.Single sunFlaresGhosts2Offset
    // Size: 0x4
    // Offset: 0x278
    float sunFlaresGhosts2Offset;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x67A908
    // public System.Single sunFlaresGhosts2Brightness
    // Size: 0x4
    // Offset: 0x27C
    float sunFlaresGhosts2Brightness;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x67A920
    // public System.Single sunFlaresGhosts3Size
    // Size: 0x4
    // Offset: 0x280
    float sunFlaresGhosts3Size;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x67A938
    // public System.Single sunFlaresGhosts3Brightness
    // Size: 0x4
    // Offset: 0x284
    float sunFlaresGhosts3Brightness;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x67A950
    // public System.Single sunFlaresGhosts3Offset
    // Size: 0x4
    // Offset: 0x288
    float sunFlaresGhosts3Offset;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x67A968
    // public System.Single sunFlaresGhosts4Size
    // Size: 0x4
    // Offset: 0x28C
    float sunFlaresGhosts4Size;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x67A980
    // public System.Single sunFlaresGhosts4Offset
    // Size: 0x4
    // Offset: 0x290
    float sunFlaresGhosts4Offset;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x67A998
    // public System.Single sunFlaresGhosts4Brightness
    // Size: 0x4
    // Offset: 0x294
    float sunFlaresGhosts4Brightness;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x67A9B0
    // public System.Single sunFlaresHaloOffset
    // Size: 0x4
    // Offset: 0x298
    float sunFlaresHaloOffset;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x67A9C8
    // public System.Single sunFlaresHaloAmplitude
    // Size: 0x4
    // Offset: 0x29C
    float sunFlaresHaloAmplitude;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0x67A9E4
    // public System.Single sunFlaresHaloIntensity
    // Size: 0x4
    // Offset: 0x2A0
    float sunFlaresHaloIntensity;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Boolean sunFlaresRotationDeadZone
    // Size: 0x1
    // Offset: 0x2A4
    bool sunFlaresRotationDeadZone;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean blur
    // Size: 0x1
    // Offset: 0x2A5
    bool blur;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: blur and: blurIntensity
    char __padding141[0x2] = {};
    // [RangeAttribute] Offset: 0x67A9FC
    // public System.Single blurIntensity
    // Size: 0x4
    // Offset: 0x2A8
    float blurIntensity;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Int32 pixelateAmount
    // Size: 0x4
    // Offset: 0x2AC
    int pixelateAmount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Boolean pixelateDownscale
    // Size: 0x1
    // Offset: 0x2B0
    bool pixelateDownscale;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: public System.Single dither
    float& dyn_dither();
    // Get instance field reference: public System.Single ditherDepth
    float& dyn_ditherDepth();
    // Get instance field reference: public System.Single sharpenMinDepth
    float& dyn_sharpenMinDepth();
    // Get instance field reference: public System.Single sharpenMaxDepth
    float& dyn_sharpenMaxDepth();
    // Get instance field reference: public System.Single sharpen
    float& dyn_sharpen();
    // Get instance field reference: public System.Single sharpenDepthThreshold
    float& dyn_sharpenDepthThreshold();
    // Get instance field reference: public UnityEngine.Color tintColor
    ::UnityEngine::Color& dyn_tintColor();
