// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.Single
#include "System/Single.hpp"
// Including type: System.Int32
#include "System/Int32.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: OggVorbisEncoder::Lookups
namespace OggVorbisEncoder::Lookups {
}
// Forward declaring namespace: OggVorbisEncoder::Setup
namespace OggVorbisEncoder::Setup {
  // Forward declaring type: PsyInfo
  class PsyInfo;
  // Forward declaring type: PsyGlobal
  class PsyGlobal;
  // Forward declaring type: Mapping
  class Mapping;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: IList`1<T>
  template<typename T>
  class IList_1;
}
// Completed forward declares
// Type namespace: OggVorbisEncoder.Lookups
namespace OggVorbisEncoder::Lookups {
  // Forward declaring type: PsyLookup
  class PsyLookup;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::OggVorbisEncoder::Lookups::PsyLookup);
DEFINE_IL2CPP_ARG_TYPE(::OggVorbisEncoder::Lookups::PsyLookup*, "OggVorbisEncoder.Lookups", "PsyLookup");
// Type namespace: OggVorbisEncoder.Lookups
namespace OggVorbisEncoder::Lookups {
  // Size: 0x5C
  #pragma pack(push, 1)
  // Autogenerated type: OggVorbisEncoder.Lookups.PsyLookup
  // [TokenAttribute] Offset: FFFFFFFF
  class PsyLookup : public ::Il2CppObject {
    public:
    // Nested type: ::OggVorbisEncoder::Lookups::PsyLookup::ApComparer
    class ApComparer;
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // private readonly System.Single[] _ath
    // Size: 0x8
    // Offset: 0x10
    ::ArrayW<float> ath;
    // Field size check
    static_assert(sizeof(::ArrayW<float>) == 0x8);
    // private readonly System.Int32[] _bark
    // Size: 0x8
    // Offset: 0x18
    ::ArrayW<int> bark;
    // Field size check
    static_assert(sizeof(::ArrayW<int>) == 0x8);
    // private readonly System.Int32 _eighthOctaveLines
    // Size: 0x4
    // Offset: 0x20
    int eighthOctaveLines;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private readonly System.Int32 _firstOctave
    // Size: 0x4
    // Offset: 0x24
    int firstOctave;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private readonly System.Single _mVal
    // Size: 0x4
    // Offset: 0x28
    float mVal;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private readonly System.Int32 _n
    // Size: 0x4
    // Offset: 0x2C
    int n;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private readonly System.Single[][] _noiseOffset
    // Size: 0x8
    // Offset: 0x30
    ::ArrayW<::ArrayW<float>> noiseOffset;
    // Field size check
    static_assert(sizeof(::ArrayW<::ArrayW<float>>) == 0x8);
    // private readonly System.Int32[] _octave
    // Size: 0x8
    // Offset: 0x38
    ::ArrayW<int> octave;
    // Field size check
    static_assert(sizeof(::ArrayW<int>) == 0x8);
    // private readonly OggVorbisEncoder.Setup.PsyInfo _psyInfo
    // Size: 0x8
    // Offset: 0x40
    ::OggVorbisEncoder::Setup::PsyInfo* psyInfo;
    // Field size check
    static_assert(sizeof(::OggVorbisEncoder::Setup::PsyInfo*) == 0x8);
    // private readonly System.Int32 _shiftOctave
    // Size: 0x4
    // Offset: 0x48
    int shiftOctave;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: shiftOctave and: toneCurves
    char __padding9[0x4] = {};
    // private readonly System.Single[][][] _toneCurves
    // Size: 0x8
    // Offset: 0x50
    ::ArrayW<::ArrayW<::ArrayW<float>>> toneCurves;
    // Field size check
    static_assert(sizeof(::ArrayW<::ArrayW<::ArrayW<float>>>) == 0x8);
    // private readonly System.Int32 _totalOctaveLines
    // Size: 0x4
    // Offset: 0x58
    int totalOctaveLines;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    public:
    // Get static field: static private readonly System.Single[] StereoThresholdsLimit
    static ::ArrayW<float> _get_StereoThresholdsLimit();
    // Set static field: static private readonly System.Single[] StereoThresholdsLimit
    static void _set_StereoThresholdsLimit(::ArrayW<float> value);
    // Get static field: static private readonly System.Single[] StereoThresholds
    static ::ArrayW<float> _get_StereoThresholds();
    // Set static field: static private readonly System.Single[] StereoThresholds
    static void _set_StereoThresholds(::ArrayW<float> value);
    // Get static field: static private readonly System.Single[] DecibelLookup
    static ::ArrayW<float> _get_DecibelLookup();
    // Set static field: static private readonly System.Single[] DecibelLookup
    static void _set_DecibelLookup(::ArrayW<float> value);
