// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include <stdint.h>
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Type namespace: Unity.RemoteConfig
namespace Unity::RemoteConfig {
  // Forward declaring type: Common
  struct Common;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::Unity::RemoteConfig::Common, "Unity.RemoteConfig", "Common");
// Type namespace: Unity.RemoteConfig
namespace Unity::RemoteConfig {
  // Size: 0x48
  #pragma pack(push, 1)
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: Unity.RemoteConfig.Common
  // [TokenAttribute] Offset: FFFFFFFF
  struct Common/*, public ::System::ValueType*/ {
    public:
    public:
    // public System.String appid
    // Size: 0x8
    // Offset: 0x0
    ::StringW appid;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String userid
    // Size: 0x8
    // Offset: 0x8
    ::StringW userid;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.Int64 sessionid
    // Size: 0x8
    // Offset: 0x10
    int64_t sessionid;
    // Field size check
    static_assert(sizeof(int64_t) == 0x8);
    // public System.Int64 session_count
    // Size: 0x8
    // Offset: 0x18
    int64_t session_count;
    // Field size check
    static_assert(sizeof(int64_t) == 0x8);
    // public System.String platform
    // Size: 0x8
    // Offset: 0x20
    ::StringW platform;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.Int32 platform_id
    // Size: 0x4
    // Offset: 0x28
    int platform_id;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: platform_id and: sdk_ver
    char __padding5[0x4] = {};
    // public System.String sdk_ver
    // Size: 0x8
    // Offset: 0x30
    ::StringW sdk_ver;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.Boolean debug_device
    // Size: 0x1
    // Offset: 0x38
    bool debug_device;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: debug_device and: device_id
    char __padding7[0x7] = {};
    // public System.String device_id
    // Size: 0x8
    // Offset: 0x40
    ::StringW device_id;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    public:
    // Creating value type constructor for type: Common
    constexpr Common(::StringW appid_ = {}, ::StringW userid_ = {}, int64_t sessionid_ = {}, int64_t session_count_ = {}, ::StringW platform_ = {}, int platform_id_ = {}, ::StringW sdk_ver_ = {}, bool debug_device_ = {}, ::StringW device_id_ = {}) noexcept : appid{appid_}, userid{userid_}, sessionid{sessionid_}, session_count{session_count_}, platform{platform_}, platform_id{platform_id_}, sdk_ver{sdk_ver_}, debug_device{debug_device_}, device_id{device_id_} {}
    // Creating interface conversion operator: operator ::System::ValueType
    operator ::System::ValueType() noexcept {
      return *reinterpret_cast<::System::ValueType*>(this);
    }
    // Get instance field reference: public System.String appid
    [[deprecated("Use field access instead!")]] ::StringW& dyn_appid();
    // Get instance field reference: public System.String userid
    [[deprecated("Use field access instead!")]] ::StringW& dyn_userid();
    // Get instance field reference: public System.Int64 sessionid
    [[deprecated("Use field access instead!")]] int64_t& dyn_sessionid();
    // Get instance field reference: public System.Int64 session_count
    [[deprecated("Use field access instead!")]] int64_t& dyn_session_count();
    // Get instance field reference: public System.String platform
    [[deprecated("Use field access instead!")]] ::StringW& dyn_platform();
    // Get instance field reference: public System.Int32 platform_id
    [[deprecated("Use field access instead!")]] int& dyn_platform_id();
    // Get instance field reference: public System.String sdk_ver
    [[deprecated("Use field access instead!")]] ::StringW& dyn_sdk_ver();
    // Get instance field reference: public System.Boolean debug_device
    [[deprecated("Use field access instead!")]] bool& dyn_debug_device();
    // Get instance field reference: public System.String device_id
    [[deprecated("Use field access instead!")]] ::StringW& dyn_device_id();
  }; // Unity.RemoteConfig.Common
  #pragma pack(pop)
  static check_size<sizeof(Common), 64 + sizeof(::StringW)> __Unity_RemoteConfig_CommonSizeCheck;
  static_assert(sizeof(Common) == 0x48);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
