// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Unity.RemoteConfig.ConfigRequestStatus
#include "Unity/RemoteConfig/ConfigRequestStatus.hpp"
// Including type: Unity.RemoteConfig.ConfigResponse
#include "Unity/RemoteConfig/ConfigResponse.hpp"
// Including type: Unity.RemoteConfig.Delivery
#include "Unity/RemoteConfig/Delivery.hpp"
// Including type: Unity.RemoteConfig.Common
#include "Unity/RemoteConfig/Common.hpp"
// Including type: Unity.RemoteConfig.RequestHeaderTuple
#include "Unity/RemoteConfig/RequestHeaderTuple.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Unity::RemoteConfig
namespace Unity::RemoteConfig {
  // Forward declaring type: RuntimeConfig
  class RuntimeConfig;
  // Forward declaring type: DeviceInfo
  class DeviceInfo;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
  // Forward declaring type: Action`2<T1, T2>
  template<typename T1, typename T2>
  class Action_2;
  // Forward declaring type: Action`3<T1, T2, T3>
  template<typename T1, typename T2, typename T3>
  class Action_3;
  // Forward declaring type: Func`1<TResult>
  template<typename TResult>
  class Func_1;
  // Forward declaring type: Func`3<T1, T2, TResult>
  template<typename T1, typename T2, typename TResult>
  class Func_3;
  // Skipping declaration: ValueType because it is already included!
}
// Forward declaring namespace: Newtonsoft::Json::Linq
namespace Newtonsoft::Json::Linq {
  // Forward declaring type: JObject
  class JObject;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: IEnumerable`1<T>
  template<typename T>
  class IEnumerable_1;
}
// Forward declaring namespace: System::IO
namespace System::IO {
  // Forward declaring type: TextWriter
  class TextWriter;
}
// Completed forward declares
// Type namespace: Unity.RemoteConfig
namespace Unity::RemoteConfig {
  // Forward declaring type: ConfigManagerImpl
  class ConfigManagerImpl;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Unity::RemoteConfig::ConfigManagerImpl);
DEFINE_IL2CPP_ARG_TYPE(::Unity::RemoteConfig::ConfigManagerImpl*, "Unity.RemoteConfig", "ConfigManagerImpl");
// Type namespace: Unity.RemoteConfig
namespace Unity::RemoteConfig {
  // Size: 0xE0
  #pragma pack(push, 1)
  // Autogenerated type: Unity.RemoteConfig.ConfigManagerImpl
  // [TokenAttribute] Offset: FFFFFFFF
  class ConfigManagerImpl : public ::Il2CppObject {
    public:
    // Nested type: ::Unity::RemoteConfig::ConfigManagerImpl::$$c__DisplayClass38_0
    class $$c__DisplayClass38_0;
    public:
    // private Unity.RemoteConfig.ConfigRequestStatus <requestStatus>k__BackingField
    // Size: 0x4
    // Offset: 0x10
    ::Unity::RemoteConfig::ConfigRequestStatus requestStatus;
    // Field size check
    static_assert(sizeof(::Unity::RemoteConfig::ConfigRequestStatus) == 0x4);
    // Padding between fields: requestStatus and: FetchCompleted
    char __padding0[0x4] = {};
    // private System.Action`1<Unity.RemoteConfig.ConfigResponse> FetchCompleted
    // Size: 0x8
    // Offset: 0x18
    ::System::Action_1<::Unity::RemoteConfig::ConfigResponse>* FetchCompleted;
    // Field size check
    static_assert(sizeof(::System::Action_1<::Unity::RemoteConfig::ConfigResponse>*) == 0x8);
    // private Unity.RemoteConfig.RuntimeConfig <appConfig>k__BackingField
    // Size: 0x8
    // Offset: 0x20
    ::Unity::RemoteConfig::RuntimeConfig* appConfig;
    // Field size check
    static_assert(sizeof(::Unity::RemoteConfig::RuntimeConfig*) == 0x8);
    // Unity.RemoteConfig.Delivery deliveryPayload
    // Size: 0x28
    // Offset: 0x28
    ::Unity::RemoteConfig::Delivery deliveryPayload;
    // Field size check
    static_assert(sizeof(::Unity::RemoteConfig::Delivery) == 0x28);
    // Unity.RemoteConfig.Common commonPayload
    // Size: 0x48
    // Offset: 0x50
    ::Unity::RemoteConfig::Common commonPayload;
    // Field size check
    static_assert(sizeof(::Unity::RemoteConfig::Common) == 0x48);
    // Unity.RemoteConfig.DeviceInfo deviceInfoPayload
    // Size: 0x8
    // Offset: 0x98
    ::Unity::RemoteConfig::DeviceInfo* deviceInfoPayload;
    // Field size check
    static_assert(sizeof(::Unity::RemoteConfig::DeviceInfo*) == 0x8);
    // private System.Action`2<Unity.RemoteConfig.ConfigResponse,Newtonsoft.Json.Linq.JObject> ResponseParsed
    // Size: 0x8
    // Offset: 0xA0
    ::System::Action_2<::Unity::RemoteConfig::ConfigResponse, ::Newtonsoft::Json::Linq::JObject*>* ResponseParsed;
    // Field size check
    static_assert(sizeof(::System::Action_2<::Unity::RemoteConfig::ConfigResponse, ::Newtonsoft::Json::Linq::JObject*>*) == 0x8);
    // private System.Action`3<Unity.RemoteConfig.ConfigOrigin,System.Collections.Generic.Dictionary`2<System.String,System.String>,System.String> RawResponseReturned
    // Size: 0x8
    // Offset: 0xA8
    ::System::Action_3<::Unity::RemoteConfig::ConfigOrigin, ::System::Collections::Generic::Dictionary_2<::StringW, ::StringW>*, ::StringW>* RawResponseReturned;
    // Field size check
    static_assert(sizeof(::System::Action_3<::Unity::RemoteConfig::ConfigOrigin, ::System::Collections::Generic::Dictionary_2<::StringW, ::StringW>*, ::StringW>*) == 0x8);
    // private System.Action`3<Unity.RemoteConfig.ConfigOrigin,System.Collections.Generic.Dictionary`2<System.String,System.String>,System.String> RawResponseValidated
    // Size: 0x8
    // Offset: 0xB0
    ::System::Action_3<::Unity::RemoteConfig::ConfigOrigin, ::System::Collections::Generic::Dictionary_2<::StringW, ::StringW>*, ::StringW>* RawResponseValidated;
    // Field size check
    static_assert(sizeof(::System::Action_3<::Unity::RemoteConfig::ConfigOrigin, ::System::Collections::Generic::Dictionary_2<::StringW, ::StringW>*, ::StringW>*) == 0x8);
    // System.Collections.Generic.List`1<System.Func`1<Newtonsoft.Json.Linq.JObject>> requestPayloadProviders
    // Size: 0x8
    // Offset: 0xB8
    ::System::Collections::Generic::List_1<::System::Func_1<::Newtonsoft::Json::Linq::JObject*>*>* requestPayloadProviders;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::System::Func_1<::Newtonsoft::Json::Linq::JObject*>*>*) == 0x8);
    // System.Collections.Generic.List`1<System.Func`1<Unity.RemoteConfig.RequestHeaderTuple>> requestHeaderProviders
    // Size: 0x8
    // Offset: 0xC0
    ::System::Collections::Generic::List_1<::System::Func_1<::Unity::RemoteConfig::RequestHeaderTuple>*>* requestHeaderProviders;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::System::Func_1<::Unity::RemoteConfig::RequestHeaderTuple>*>*) == 0x8);
    // System.Collections.Generic.List`1<System.Func`3<System.Collections.Generic.Dictionary`2<System.String,System.String>,System.String,System.Boolean>> rawResponseValidators
    // Size: 0x8
    // Offset: 0xC8
    ::System::Collections::Generic::List_1<::System::Func_3<::System::Collections::Generic::Dictionary_2<::StringW, ::StringW>*, ::StringW, bool>*>* rawResponseValidators;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::System::Func_3<::System::Collections::Generic::Dictionary_2<::StringW, ::StringW>*, ::StringW, bool>*>*) == 0x8);
    // System.String cacheFile
    // Size: 0x8
    // Offset: 0xD0
    ::StringW cacheFile;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // System.String cacheHeadersFile
    // Size: 0x8
    // Offset: 0xD8
    ::StringW cacheHeadersFile;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    public:
    // Get instance field reference: private Unity.RemoteConfig.ConfigRequestStatus <requestStatus>k__BackingField
    [[deprecated("Use field access instead!")]] ::Unity::RemoteConfig::ConfigRequestStatus& dyn_$requestStatus$k__BackingField();
    // Get instance field reference: private System.Action`1<Unity.RemoteConfig.ConfigResponse> FetchCompleted
    [[deprecated("Use field access instead!")]] ::System::Action_1<::Unity::RemoteConfig::ConfigResponse>*& dyn_FetchCompleted();
    // Get instance field reference: private Unity.RemoteConfig.RuntimeConfig <appConfig>k__BackingField
    [[deprecated("Use field access instead!")]] ::Unity::RemoteConfig::RuntimeConfig*& dyn_$appConfig$k__BackingField();
    // Get instance field reference: Unity.RemoteConfig.Delivery deliveryPayload
