// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Newtonsoft::Json::Linq
namespace Newtonsoft::Json::Linq {
  // Forward declaring type: JObject
  class JObject;
}
// Completed forward declares
// Type namespace: Unity.RemoteConfig
namespace Unity::RemoteConfig {
  // Forward declaring type: Delivery
  struct Delivery;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::Unity::RemoteConfig::Delivery, "Unity.RemoteConfig", "Delivery");
// Type namespace: Unity.RemoteConfig
namespace Unity::RemoteConfig {
  // Size: 0x28
  #pragma pack(push, 1)
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: Unity.RemoteConfig.Delivery
  // [TokenAttribute] Offset: FFFFFFFF
  struct Delivery/*, public ::System::ValueType*/ {
    public:
    public:
    // public System.String customUserId
    // Size: 0x8
    // Offset: 0x0
    ::StringW customUserId;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String environmentId
    // Size: 0x8
    // Offset: 0x8
    ::StringW environmentId;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String packageVersion
    // Size: 0x8
    // Offset: 0x10
    ::StringW packageVersion;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String originService
    // Size: 0x8
    // Offset: 0x18
    ::StringW originService;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public Newtonsoft.Json.Linq.JObject attributionMetadata
    // Size: 0x8
    // Offset: 0x20
    ::Newtonsoft::Json::Linq::JObject* attributionMetadata;
    // Field size check
    static_assert(sizeof(::Newtonsoft::Json::Linq::JObject*) == 0x8);
    public:
    // Creating value type constructor for type: Delivery
    constexpr Delivery(::StringW customUserId_ = {}, ::StringW environmentId_ = {}, ::StringW packageVersion_ = {}, ::StringW originService_ = {}, ::Newtonsoft::Json::Linq::JObject* attributionMetadata_ = {}) noexcept : customUserId{customUserId_}, environmentId{environmentId_}, packageVersion{packageVersion_}, originService{originService_}, attributionMetadata{attributionMetadata_} {}
    // Creating interface conversion operator: operator ::System::ValueType
    operator ::System::ValueType() noexcept {
      return *reinterpret_cast<::System::ValueType*>(this);
    }
    // Get instance field reference: public System.String customUserId
    [[deprecated]] ::StringW& dyn_customUserId();
    // Get instance field reference: public System.String environmentId
    [[deprecated]] ::StringW& dyn_environmentId();
    // Get instance field reference: public System.String packageVersion
    [[deprecated]] ::StringW& dyn_packageVersion();
    // Get instance field reference: public System.String originService
    [[deprecated]] ::StringW& dyn_originService();
    // Get instance field reference: public Newtonsoft.Json.Linq.JObject attributionMetadata
    [[deprecated]] ::Newtonsoft::Json::Linq::JObject*& dyn_attributionMetadata();
  }; // Unity.RemoteConfig.Delivery
  #pragma pack(pop)
  static check_size<sizeof(Delivery), 32 + sizeof(::Newtonsoft::Json::Linq::JObject*)> __Unity_RemoteConfig_DeliverySizeCheck;
  static_assert(sizeof(Delivery) == 0x28);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
