// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.ScriptableObject
#include "UnityEngine/ScriptableObject.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: VROSC::Credits
namespace VROSC::Credits {
  // Forward declaring type: CreditsSectionData
  class CreditsSectionData;
  // Forward declaring type: CreditsObject
  class CreditsObject;
}
// Completed forward declares
// Type namespace: VROSC.Credits
namespace VROSC::Credits {
  // Forward declaring type: CreditsData
  class CreditsData;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::VROSC::Credits::CreditsData);
DEFINE_IL2CPP_ARG_TYPE(::VROSC::Credits::CreditsData*, "VROSC.Credits", "CreditsData");
// Type namespace: VROSC.Credits
namespace VROSC::Credits {
  // Size: 0x44
  #pragma pack(push, 1)
  // Autogenerated type: VROSC.Credits.CreditsData
  // [TokenAttribute] Offset: FFFFFFFF
  // [CreateAssetMenuAttribute] Offset: 780E84
  class CreditsData : public ::UnityEngine::ScriptableObject {
    public:
    public:
    // [HeaderAttribute] Offset: 0x78D40C
    // private System.Collections.Generic.List`1<VROSC.Credits.CreditsSectionData> _sections
    // Size: 0x8
    // Offset: 0x18
    ::System::Collections::Generic::List_1<::VROSC::Credits::CreditsSectionData*>* sections;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::VROSC::Credits::CreditsSectionData*>*) == 0x8);
    // private System.Single _namePadding
    // Size: 0x4
    // Offset: 0x20
    float namePadding;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _sectionPadding
    // Size: 0x4
    // Offset: 0x24
    float sectionPadding;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private VROSC.Credits.CreditsObject _postCreditsObject
    // Size: 0x8
    // Offset: 0x28
    ::VROSC::Credits::CreditsObject* postCreditsObject;
    // Field size check
    static_assert(sizeof(::VROSC::Credits::CreditsObject*) == 0x8);
    // [HeaderAttribute] Offset: 0x78D488
    // private System.Single _scrollSpeed
    // Size: 0x4
    // Offset: 0x30
    float scrollSpeed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _secondsBeforeScroll
    // Size: 0x4
    // Offset: 0x34
    float secondsBeforeScroll;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _startOffset
    // Size: 0x4
    // Offset: 0x38
    float startOffset;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _grabScrollInfluence
    // Size: 0x4
    // Offset: 0x3C
    float grabScrollInfluence;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _grabScrollSmoothing
    // Size: 0x4
    // Offset: 0x40
    float grabScrollSmoothing;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: private System.Collections.Generic.List`1<VROSC.Credits.CreditsSectionData> _sections
    [[deprecated]] ::System::Collections::Generic::List_1<::VROSC::Credits::CreditsSectionData*>*& dyn__sections();
    // Get instance field reference: private System.Single _namePadding
    [[deprecated]] float& dyn__namePadding();
    // Get instance field reference: private System.Single _sectionPadding
    [[deprecated]] float& dyn__sectionPadding();
    // Get instance field reference: private VROSC.Credits.CreditsObject _postCreditsObject
    [[deprecated]] ::VROSC::Credits::CreditsObject*& dyn__postCreditsObject();
    // Get instance field reference: private System.Single _scrollSpeed
    [[deprecated]] float& dyn__scrollSpeed();
    // Get instance field reference: private System.Single _secondsBeforeScroll
    [[deprecated]] float& dyn__secondsBeforeScroll();
    // Get instance field reference: private System.Single _startOffset
    [[deprecated]] float& dyn__startOffset();
    // Get instance field reference: private System.Single _grabScrollInfluence
    [[deprecated]] float& dyn__grabScrollInfluence();
    // Get instance field reference: private System.Single _grabScrollSmoothing
    [[deprecated]] float& dyn__grabScrollSmoothing();
    // public System.Collections.Generic.List`1<VROSC.Credits.CreditsSectionData> get_Sections()
    // Offset: 0x8DF440
    ::System::Collections::Generic::List_1<::VROSC::Credits::CreditsSectionData*>* get_Sections();
    // public System.Single get_NamePadding()
    // Offset: 0x8DF448
    float get_NamePadding();
    // public System.Single get_SectionPadding()
    // Offset: 0x8DF450
    float get_SectionPadding();
    // public VROSC.Credits.CreditsObject get_PostCreditsObject()
    // Offset: 0x8DF458
    ::VROSC::Credits::CreditsObject* get_PostCreditsObject();
    // public System.Single get_ScrollSpeed()
    // Offset: 0x8DF460
    float get_ScrollSpeed();
    // public System.Single get_SecondsBeforeScroll()
    // Offset: 0x8DF468
    float get_SecondsBeforeScroll();
    // public System.Single get_StartOffset()
    // Offset: 0x8DF470
    float get_StartOffset();
    // public System.Single get_GrabScrollInfluence()
    // Offset: 0x8DF478
    float get_GrabScrollInfluence();
    // public System.Single get_GrabScrollSmoothing()
    // Offset: 0x8DF480
    float get_GrabScrollSmoothing();
    // public System.Void .ctor()
    // Offset: 0x8DF488
    // Implemented from: UnityEngine.ScriptableObject
    // Base method: System.Void ScriptableObject::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static CreditsData* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::VROSC::Credits::CreditsData::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<CreditsData*, creationType>()));
    }
  }; // VROSC.Credits.CreditsData
  #pragma pack(pop)
  static check_size<sizeof(CreditsData), 64 + sizeof(float)> __VROSC_Credits_CreditsDataSizeCheck;
  static_assert(sizeof(CreditsData) == 0x44);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: VROSC::Credits::CreditsData::get_Sections
// Il2CppName: get_Sections
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::System::Collections::Generic::List_1<::VROSC::Credits::CreditsSectionData*>* (VROSC::Credits::CreditsData::*)()>(&VROSC::Credits::CreditsData::get_Sections)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(VROSC::Credits::CreditsData*), "get_Sections", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: VROSC::Credits::CreditsData::get_NamePadding
// Il2CppName: get_NamePadding
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<float (VROSC::Credits::CreditsData::*)()>(&VROSC::Credits::CreditsData::get_NamePadding)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(VROSC::Credits::CreditsData*), "get_NamePadding", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: VROSC::Credits::CreditsData::get_SectionPadding
// Il2CppName: get_SectionPadding
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<float (VROSC::Credits::CreditsData::*)()>(&VROSC::Credits::CreditsData::get_SectionPadding)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(VROSC::Credits::CreditsData*), "get_SectionPadding", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: VROSC::Credits::CreditsData::get_PostCreditsObject
// Il2CppName: get_PostCreditsObject
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::VROSC::Credits::CreditsObject* (VROSC::Credits::CreditsData::*)()>(&VROSC::Credits::CreditsData::get_PostCreditsObject)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(VROSC::Credits::CreditsData*), "get_PostCreditsObject", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: VROSC::Credits::CreditsData::get_ScrollSpeed
// Il2CppName: get_ScrollSpeed
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<float (VROSC::Credits::CreditsData::*)()>(&VROSC::Credits::CreditsData::get_ScrollSpeed)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(VROSC::Credits::CreditsData*), "get_ScrollSpeed", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: VROSC::Credits::CreditsData::get_SecondsBeforeScroll
// Il2CppName: get_SecondsBeforeScroll
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<float (VROSC::Credits::CreditsData::*)()>(&VROSC::Credits::CreditsData::get_SecondsBeforeScroll)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(VROSC::Credits::CreditsData*), "get_SecondsBeforeScroll", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: VROSC::Credits::CreditsData::get_StartOffset
// Il2CppName: get_StartOffset
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<float (VROSC::Credits::CreditsData::*)()>(&VROSC::Credits::CreditsData::get_StartOffset)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(VROSC::Credits::CreditsData*), "get_StartOffset", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: VROSC::Credits::CreditsData::get_GrabScrollInfluence
// Il2CppName: get_GrabScrollInfluence
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<float (VROSC::Credits::CreditsData::*)()>(&VROSC::Credits::CreditsData::get_GrabScrollInfluence)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(VROSC::Credits::CreditsData*), "get_GrabScrollInfluence", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: VROSC::Credits::CreditsData::get_GrabScrollSmoothing
// Il2CppName: get_GrabScrollSmoothing
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<float (VROSC::Credits::CreditsData::*)()>(&VROSC::Credits::CreditsData::get_GrabScrollSmoothing)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(VROSC::Credits::CreditsData*), "get_GrabScrollSmoothing", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: VROSC::Credits::CreditsData::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
