// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.Int32
#include "System/Int32.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: OggVorbisEncoder::Setup
namespace OggVorbisEncoder::Setup {
}
// Completed forward declares
// Type namespace: OggVorbisEncoder.Setup
namespace OggVorbisEncoder::Setup {
  // Forward declaring type: PsyInfo
  class PsyInfo;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::OggVorbisEncoder::Setup::PsyInfo);
DEFINE_IL2CPP_ARG_TYPE(::OggVorbisEncoder::Setup::PsyInfo*, "OggVorbisEncoder.Setup", "PsyInfo");
// Type namespace: OggVorbisEncoder.Setup
namespace OggVorbisEncoder::Setup {
  // Size: 0x80
  #pragma pack(push, 1)
  // Autogenerated type: OggVorbisEncoder.Setup.PsyInfo
  // [TokenAttribute] Offset: FFFFFFFF
  class PsyInfo : public ::Il2CppObject {
    public:
    // Nested type: ::OggVorbisEncoder::Setup::PsyInfo::$$c
    class $$c;
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // private System.Single[] _noiseCompand
    // Size: 0x8
    // Offset: 0x10
    ::ArrayW<float> noiseCompand;
    // Field size check
    static_assert(sizeof(::ArrayW<float>) == 0x8);
    // private System.Single[][] _noiseOffset
    // Size: 0x8
    // Offset: 0x18
    ::ArrayW<::ArrayW<float>> noiseOffset;
    // Field size check
    static_assert(sizeof(::ArrayW<::ArrayW<float>>) == 0x8);
    // private System.Single[] _toneAtt
    // Size: 0x8
    // Offset: 0x20
    ::ArrayW<float> toneAtt;
    // Field size check
    static_assert(sizeof(::ArrayW<float>) == 0x8);
    // private System.Single[] _toneMasterAtt
    // Size: 0x8
    // Offset: 0x28
    ::ArrayW<float> toneMasterAtt;
    // Field size check
    static_assert(sizeof(::ArrayW<float>) == 0x8);
    // private System.Int32 <BlockFlag>k__BackingField
    // Size: 0x4
    // Offset: 0x30
    int BlockFlag;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Single <AthAdjAtt>k__BackingField
    // Size: 0x4
    // Offset: 0x34
    float AthAdjAtt;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single <AthMaxAtt>k__BackingField
    // Size: 0x4
    // Offset: 0x38
    float AthMaxAtt;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single <ToneCenterBoost>k__BackingField
    // Size: 0x4
    // Offset: 0x3C
    float ToneCenterBoost;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single <ToneDecay>k__BackingField
    // Size: 0x4
    // Offset: 0x40
    float ToneDecay;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single <ToneAbsLimit>k__BackingField
    // Size: 0x4
    // Offset: 0x44
    float ToneAbsLimit;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private readonly System.Int32 <NoiseMaskP>k__BackingField
    // Size: 0x4
    // Offset: 0x48
    int NoiseMaskP;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Single <NoiseMaxSuppress>k__BackingField
    // Size: 0x4
    // Offset: 0x4C
    float NoiseMaxSuppress;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private readonly System.Single <NoiseWindowLow>k__BackingField
    // Size: 0x4
    // Offset: 0x50
    float NoiseWindowLow;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private readonly System.Single <NoiseWindowHigh>k__BackingField
    // Size: 0x4
    // Offset: 0x54
    float NoiseWindowHigh;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Int32 <NoiseWindowLowMin>k__BackingField
    // Size: 0x4
    // Offset: 0x58
    int NoiseWindowLowMin;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 <NoiseWindowHighMin>k__BackingField
    // Size: 0x4
    // Offset: 0x5C
    int NoiseWindowHighMin;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 <NoiseWindowFixed>k__BackingField
    // Size: 0x4
    // Offset: 0x60
    int NoiseWindowFixed;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Single <MaxCurveDecibel>k__BackingField
    // Size: 0x4
    // Offset: 0x64
    float MaxCurveDecibel;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean <Normalize>k__BackingField
    // Size: 0x1
    // Offset: 0x68
    bool Normalize;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: Normalize and: NormalStart
    char __padding18[0x3] = {};
    // private System.Int32 <NormalStart>k__BackingField
    // Size: 0x4
    // Offset: 0x6C
    int NormalStart;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 <NormalPartition>k__BackingField
    // Size: 0x4
    // Offset: 0x70
    int NormalPartition;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: NormalPartition and: NormalThreshold
    char __padding20[0x4] = {};
    // private System.Double <NormalThreshold>k__BackingField
    // Size: 0x8
    // Offset: 0x78
    double NormalThreshold;
    // Field size check
    static_assert(sizeof(double) == 0x8);
    public:
    // static field const value: static public System.Int32 Bands
    static constexpr const int Bands = 17;
    // Get static field: static public System.Int32 Bands
    static int _get_Bands();
    // Set static field: static public System.Int32 Bands
    static void _set_Bands(int value);
    // static field const value: static private System.Int32 NoiseCompandLevels
    static constexpr const int NoiseCompandLevels = 40;
    // Get static field: static private System.Int32 NoiseCompandLevels
    static int _get_NoiseCompandLevels();
    // Set static field: static private System.Int32 NoiseCompandLevels
    static void _set_NoiseCompandLevels(int value);
    // static field const value: static private System.Int32 NoiseCurves
    static constexpr const int NoiseCurves = 3;
    // Get static field: static private System.Int32 NoiseCurves
