// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: AudioHelm.NoteHandler
#include "AudioHelm/NoteHandler.hpp"
// Including type: System.Int32
#include "System/Int32.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: AudioHelm
namespace AudioHelm {
  // Forward declaring type: HelmParameter
  class HelmParameter;
  // Forward declaring type: HelmPatch
  class HelmPatch;
  // Forward declaring type: Param
  struct Param;
  // Forward declaring type: CommonParam
  struct CommonParam;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Completed forward declares
// Type namespace: AudioHelm
namespace AudioHelm {
  // Forward declaring type: HelmController
  class HelmController;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::AudioHelm::HelmController);
DEFINE_IL2CPP_ARG_TYPE(::AudioHelm::HelmController*, "AudioHelm", "HelmController");
// Type namespace: AudioHelm
namespace AudioHelm {
  // Size: 0x80
  #pragma pack(push, 1)
  // Autogenerated type: AudioHelm.HelmController
  // [TokenAttribute] Offset: FFFFFFFF
  // [RequireComponent] Offset: 66C6A8
  // [HelpURLAttribute] Offset: 66C6A8
  // [AddComponentMenu] Offset: 66C6A8
  class HelmController : public ::UnityEngine::MonoBehaviour/*, public ::AudioHelm::NoteHandler*/ {
    public:
    // Nested type: ::AudioHelm::HelmController::$WaitNoteOff$d__49
    class $WaitNoteOff$d__49;
    // Nested type: ::AudioHelm::HelmController::$WaitFrequencyOff$d__53
    class $WaitFrequencyOff$d__53;
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // [TooltipAttribute] Offset: 0x67AAB4
    // public System.Int32 channel
    // Size: 0x4
    // Offset: 0x18
    int channel;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // protected System.Single synthParamValue0
    // Size: 0x4
    // Offset: 0x1C
    float synthParamValue0;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // protected System.Single synthParamValue1
    // Size: 0x4
    // Offset: 0x20
    float synthParamValue1;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // protected System.Single synthParamValue2
    // Size: 0x4
    // Offset: 0x24
    float synthParamValue2;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // protected System.Single synthParamValue3
    // Size: 0x4
    // Offset: 0x28
    float synthParamValue3;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // protected System.Single synthParamValue4
    // Size: 0x4
    // Offset: 0x2C
    float synthParamValue4;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // protected System.Single synthParamValue5
    // Size: 0x4
    // Offset: 0x30
    float synthParamValue5;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // protected System.Single synthParamValue6
    // Size: 0x4
    // Offset: 0x34
    float synthParamValue6;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // protected System.Single synthParamValue7
    // Size: 0x4
    // Offset: 0x38
    float synthParamValue7;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // protected System.Single synthParamValue8
    // Size: 0x4
    // Offset: 0x3C
    float synthParamValue8;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // protected System.Single synthParamValue9
    // Size: 0x4
    // Offset: 0x40
    float synthParamValue9;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // protected System.Single synthParamValue10
    // Size: 0x4
    // Offset: 0x44
    float synthParamValue10;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // protected System.Single synthParamValue11
    // Size: 0x4
    // Offset: 0x48
    float synthParamValue11;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // protected System.Single synthParamValue12
    // Size: 0x4
    // Offset: 0x4C
    float synthParamValue12;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // protected System.Single synthParamValue13
    // Size: 0x4
    // Offset: 0x50
    float synthParamValue13;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // protected System.Single synthParamValue14
    // Size: 0x4
    // Offset: 0x54
    float synthParamValue14;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // protected System.Single synthParamValue15
    // Size: 0x4
    // Offset: 0x58
    float synthParamValue15;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: synthParamValue15 and: paramValues
    char __padding16[0x4] = {};
    // private System.Single[] paramValues
    // Size: 0x8
    // Offset: 0x60
    ::ArrayW<float> paramValues;
    // Field size check
    static_assert(sizeof(::ArrayW<float>) == 0x8);
    // public System.Collections.Generic.List`1<AudioHelm.HelmParameter> synthParameters
    // Size: 0x8
    // Offset: 0x68
    ::System::Collections::Generic::List_1<::AudioHelm::HelmParameter*>* synthParameters;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::AudioHelm::HelmParameter*>*) == 0x8);
    // private System.Collections.Generic.Dictionary`2<System.Int32,System.Int32> pressedNotes
    // Size: 0x8
    // Offset: 0x70
    ::System::Collections::Generic::Dictionary_2<int, int>* pressedNotes;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<int, int>*) == 0x8);
    // private System.Collections.Generic.Dictionary`2<System.Single,System.Int32> pressedFrequencies
    // Size: 0x8
    // Offset: 0x78
    ::System::Collections::Generic::Dictionary_2<float, int>* pressedFrequencies;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<float, int>*) == 0x8);
    public:
    // Creating interface conversion operator: operator ::AudioHelm::NoteHandler
    operator ::AudioHelm::NoteHandler() noexcept {
      return *reinterpret_cast<::AudioHelm::NoteHandler*>(this);
    }
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // static field const value: static public System.Single UPDATE_WAIT
    static constexpr const float UPDATE_WAIT = 0.04;
    // Get static field: static public System.Single UPDATE_WAIT
    static float _get_UPDATE_WAIT();
    // Set static field: static public System.Single UPDATE_WAIT
    static void _set_UPDATE_WAIT(float value);
    // static field const value: static public System.Int32 MAX_PARAMETERS
