// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: AudioHelm.NoteHandler
#include "AudioHelm/NoteHandler.hpp"
// Including type: UnityEngine.ISerializationCallbackReceiver
#include "UnityEngine/ISerializationCallbackReceiver.hpp"
// Including type: UnityEngine.Vector2
#include "UnityEngine/Vector2.hpp"
// Including type: AudioHelm.MidiFile
#include "AudioHelm/MidiFile.hpp"
// Including type: System.Enum
#include "System/Enum.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: AudioHelm
namespace AudioHelm {
  // Skipping declaration: NotePosition because it is already included!
  // Forward declaring type: Note
  class Note;
  // Forward declaring type: NoteRow
  class NoteRow;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: SortedList`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class SortedList_2;
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: System
namespace System {
  // Skipping declaration: IntPtr because it is already included!
}
// Forward declaring namespace: System::IO
namespace System::IO {
  // Forward declaring type: Stream
  class Stream;
}
// Completed forward declares
// Type namespace: AudioHelm
namespace AudioHelm {
  // Forward declaring type: Sequencer
  class Sequencer;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::AudioHelm::Sequencer);
DEFINE_IL2CPP_ARG_TYPE(::AudioHelm::Sequencer*, "AudioHelm", "Sequencer");
// Type namespace: AudioHelm
namespace AudioHelm {
  // Size: 0xAC
  #pragma pack(push, 1)
  // Autogenerated type: AudioHelm.Sequencer
  // [TokenAttribute] Offset: FFFFFFFF
  class Sequencer : public ::UnityEngine::MonoBehaviour/*, public ::AudioHelm::NoteHandler, public ::UnityEngine::ISerializationCallbackReceiver*/ {
    public:
    // Nested type: ::AudioHelm::Sequencer::NoteAction
    class NoteAction;
    // Nested type: ::AudioHelm::Sequencer::BeatAction
    class BeatAction;
    // Nested type: ::AudioHelm::Sequencer::NoteEvent
    class NoteEvent;
    // Nested type: ::AudioHelm::Sequencer::BeatEvent
    class BeatEvent;
    // Nested type: ::AudioHelm::Sequencer::NoteComparer
    class NoteComparer;
    // Nested type: ::AudioHelm::Sequencer::NotePositionComparer
    class NotePositionComparer;
    // Nested type: ::AudioHelm::Sequencer::NotePosition
    struct NotePosition;
    // Nested type: ::AudioHelm::Sequencer::Division
    struct Division;
    // Size: 0x8
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: AudioHelm.Sequencer/AudioHelm.NotePosition
    // [TokenAttribute] Offset: FFFFFFFF
    struct NotePosition/*, public ::System::ValueType*/ {
      public:
      public:
      // public System.Single position_
      // Size: 0x4
      // Offset: 0x0
      float position;
      // Field size check
      static_assert(sizeof(float) == 0x4);
      // public System.Int32 note_
      // Size: 0x4
      // Offset: 0x4
      int note;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: NotePosition
      constexpr NotePosition(float position_ = {}, int note_ = {}) noexcept : position{position_}, note{note_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public System.Single position_
      float& dyn_position_();
      // Get instance field reference: public System.Int32 note_
      int& dyn_note_();
      // public System.Void .ctor(System.Single position, System.Int32 note)
      // Offset: 0x134A054
      // ABORTED: conflicts with another method.  NotePosition(float position, int note);
    }; // AudioHelm.Sequencer/AudioHelm.NotePosition
    #pragma pack(pop)
    static check_size<sizeof(Sequencer::NotePosition), 4 + sizeof(int)> __AudioHelm_Sequencer_NotePositionSizeCheck;
    static_assert(sizeof(Sequencer::NotePosition) == 0x8);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: AudioHelm.Sequencer/AudioHelm.Division
    // [TokenAttribute] Offset: FFFFFFFF
    struct Division/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: Division
      constexpr Division(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public AudioHelm.Sequencer/AudioHelm.Division kEighth
      static constexpr const int kEighth = 0;
      // Get static field: static public AudioHelm.Sequencer/AudioHelm.Division kEighth
      static ::AudioHelm::Sequencer::Division _get_kEighth();
      // Set static field: static public AudioHelm.Sequencer/AudioHelm.Division kEighth
      static void _set_kEighth(::AudioHelm::Sequencer::Division value);
      // static field const value: static public AudioHelm.Sequencer/AudioHelm.Division kSixteenth
      static constexpr const int kSixteenth = 1;
      // Get static field: static public AudioHelm.Sequencer/AudioHelm.Division kSixteenth
      static ::AudioHelm::Sequencer::Division _get_kSixteenth();
      // Set static field: static public AudioHelm.Sequencer/AudioHelm.Division kSixteenth
      static void _set_kSixteenth(::AudioHelm::Sequencer::Division value);
      // static field const value: static public AudioHelm.Sequencer/AudioHelm.Division kTriplet
      static constexpr const int kTriplet = 2;
      // Get static field: static public AudioHelm.Sequencer/AudioHelm.Division kTriplet
      static ::AudioHelm::Sequencer::Division _get_kTriplet();
      // Set static field: static public AudioHelm.Sequencer/AudioHelm.Division kTriplet
      static void _set_kTriplet(::AudioHelm::Sequencer::Division value);
      // static field const value: static public AudioHelm.Sequencer/AudioHelm.Division kThirtySecond
      static constexpr const int kThirtySecond = 3;
      // Get static field: static public AudioHelm.Sequencer/AudioHelm.Division kThirtySecond
      static ::AudioHelm::Sequencer::Division _get_kThirtySecond();
      // Set static field: static public AudioHelm.Sequencer/AudioHelm.Division kThirtySecond
      static void _set_kThirtySecond(::AudioHelm::Sequencer::Division value);
      // Get instance field reference: public System.Int32 value__
      int& dyn_value__();
    }; // AudioHelm.Sequencer/AudioHelm.Division
    #pragma pack(pop)
    static check_size<sizeof(Sequencer::Division), 0 + sizeof(int)> __AudioHelm_Sequencer_DivisionSizeCheck;
    static_assert(sizeof(Sequencer::Division) == 0x4);
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // private AudioHelm.Sequencer/AudioHelm.NoteAction OnNoteOn
    // Size: 0x8
    // Offset: 0x18
    ::AudioHelm::Sequencer::NoteAction* OnNoteOn;
    // Field size check
    static_assert(sizeof(::AudioHelm::Sequencer::NoteAction*) == 0x8);
    // private AudioHelm.Sequencer/AudioHelm.NoteAction OnNoteOff
    // Size: 0x8
    // Offset: 0x20
    ::AudioHelm::Sequencer::NoteAction* OnNoteOff;
    // Field size check
    static_assert(sizeof(::AudioHelm::Sequencer::NoteAction*) == 0x8);
    // private AudioHelm.Sequencer/AudioHelm.BeatAction OnBeat
    // Size: 0x8
    // Offset: 0x28
    ::AudioHelm::Sequencer::BeatAction* OnBeat;
    // Field size check
    static_assert(sizeof(::AudioHelm::Sequencer::BeatAction*) == 0x8);
    // [TooltipAttribute] Offset: 0x67ADB0
    // public AudioHelm.Sequencer/AudioHelm.NoteEvent noteOnEvent
    // Size: 0x8
    // Offset: 0x30
    ::AudioHelm::Sequencer::NoteEvent* noteOnEvent;
    // Field size check
    static_assert(sizeof(::AudioHelm::Sequencer::NoteEvent*) == 0x8);
    // [TooltipAttribute] Offset: 0x67ADE8
    // public AudioHelm.Sequencer/AudioHelm.NoteEvent noteOffEvent
    // Size: 0x8
    // Offset: 0x38
    ::AudioHelm::Sequencer::NoteEvent* noteOffEvent;
    // Field size check
    static_assert(sizeof(::AudioHelm::Sequencer::NoteEvent*) == 0x8);
    // [TooltipAttribute] Offset: 0x67AE20
    // public AudioHelm.Sequencer/AudioHelm.BeatEvent beatEvent
    // Size: 0x8
    // Offset: 0x40
    ::AudioHelm::Sequencer::BeatEvent* beatEvent;
    // Field size check
    static_assert(sizeof(::AudioHelm::Sequencer::BeatEvent*) == 0x8);
    // private System.Collections.Generic.List`1<AudioHelm.Note> activeNotes
    // Size: 0x8
    // Offset: 0x48
    ::System::Collections::Generic::List_1<::AudioHelm::Note*>* activeNotes;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::AudioHelm::Note*>*) == 0x8);
    // [TooltipAttribute] Offset: 0x67AE58
    // public System.Int32 length
    // Size: 0x4
    // Offset: 0x50
    int length;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 currentIndex
    // Size: 0x4
    // Offset: 0x54
    int currentIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Boolean loop
    // Size: 0x1
    // Offset: 0x58
    bool loop;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: loop and: beatTime
    char __padding9[0x7] = {};
    // protected System.Double beatTime
    // Size: 0x8
    // Offset: 0x60
    double beatTime;
    // Field size check
    static_assert(sizeof(double) == 0x8);
    // protected System.Boolean paused
    // Size: 0x1
    // Offset: 0x68
    bool paused;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: paused and: allNotes
    char __padding11[0x7] = {};
    // public AudioHelm.NoteRow[] allNotes
    // Size: 0x8
    // Offset: 0x70
    ::ArrayW<::AudioHelm::NoteRow*> allNotes;
    // Field size check
    static_assert(sizeof(::ArrayW<::AudioHelm::NoteRow*>) == 0x8);
    // public UnityEngine.Vector2 scrollPosition
    // Size: 0x8
    // Offset: 0x78
    ::UnityEngine::Vector2 scrollPosition;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // [TooltipAttribute] Offset: 0x67AE90
    // public System.Boolean autoScroll
    // Size: 0x1
    // Offset: 0x80
    bool autoScroll;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: autoScroll and: division
    char __padding14[0x3] = {};
    // [TooltipAttribute] Offset: 0x67AEC8
    // public AudioHelm.Sequencer/AudioHelm.Division division
    // Size: 0x4
    // Offset: 0x84
    ::AudioHelm::Sequencer::Division division;
    // Field size check
    static_assert(sizeof(::AudioHelm::Sequencer::Division) == 0x4);
    // [TooltipAttribute] Offset: 0x67AF00
    // public System.Single zoom
    // Size: 0x4
    // Offset: 0x88
    float zoom;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: zoom and: sortedNoteOns
    char __padding16[0x4] = {};
    // private System.Collections.Generic.SortedList`2<AudioHelm.Sequencer/AudioHelm.NotePosition,AudioHelm.Note> sortedNoteOns
    // Size: 0x8
    // Offset: 0x90
    ::System::Collections::Generic::SortedList_2<::AudioHelm::Sequencer::NotePosition, ::AudioHelm::Note*>* sortedNoteOns;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::SortedList_2<::AudioHelm::Sequencer::NotePosition, ::AudioHelm::Note*>*) == 0x8);
    // private System.Collections.Generic.SortedList`2<AudioHelm.Sequencer/AudioHelm.NotePosition,AudioHelm.Note> sortedNoteOffs
    // Size: 0x8
    // Offset: 0x98
    ::System::Collections::Generic::SortedList_2<::AudioHelm::Sequencer::NotePosition, ::AudioHelm::Note*>* sortedNoteOffs;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::SortedList_2<::AudioHelm::Sequencer::NotePosition, ::AudioHelm::Note*>*) == 0x8);
    // private System.Single lastSequencerPosition
    // Size: 0x4
    // Offset: 0xA0
    float lastSequencerPosition;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean waitTillNextCycle
    // Size: 0x1
    // Offset: 0xA4
    bool waitTillNextCycle;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: waitTillNextCycle and: numCycles
    char __padding20[0x3] = {};
    // private System.Int32 numCycles
    // Size: 0x4
    // Offset: 0xA8
    int numCycles;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    public:
    // Creating interface conversion operator: operator ::AudioHelm::NoteHandler
    operator ::AudioHelm::NoteHandler() noexcept {
      return *reinterpret_cast<::AudioHelm::NoteHandler*>(this);
    }
    // Creating interface conversion operator: operator ::UnityEngine::ISerializationCallbackReceiver
    operator ::UnityEngine::ISerializationCallbackReceiver() noexcept {
      return *reinterpret_cast<::UnityEngine::ISerializationCallbackReceiver*>(this);
    }
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get static field: static private AudioHelm.Sequencer/AudioHelm.NoteComparer noteComparer
    static ::AudioHelm::Sequencer::NoteComparer* _get_noteComparer();
    // Set static field: static private AudioHelm.Sequencer/AudioHelm.NoteComparer noteComparer
