// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: System.Enum
#include "System/Enum.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Oculus::Platform::Samples::VrHoops
namespace Oculus::Platform::Samples::VrHoops {
  // Skipping declaration: State because it is already included!
  // Forward declaring type: PlayerArea
  class PlayerArea;
  // Forward declaring type: Player
  class Player;
}
// Forward declaring namespace: UnityEngine::UI
namespace UnityEngine::UI {
  // Forward declaring type: Text
  class Text;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Camera
  class Camera;
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: GameObject
  class GameObject;
}
// Forward declaring namespace: Oculus::Platform::Models
namespace Oculus::Platform::Models {
  // Forward declaring type: User
  class User;
  // Forward declaring type: LeaderboardEntry
  class LeaderboardEntry;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: SortedDictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class SortedDictionary_2;
}
// Completed forward declares
// Type namespace: Oculus.Platform.Samples.VrHoops
namespace Oculus::Platform::Samples::VrHoops {
  // Forward declaring type: MatchController
  class MatchController;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Oculus::Platform::Samples::VrHoops::MatchController);
DEFINE_IL2CPP_ARG_TYPE(::Oculus::Platform::Samples::VrHoops::MatchController*, "Oculus.Platform.Samples.VrHoops", "MatchController");
// Type namespace: Oculus.Platform.Samples.VrHoops
namespace Oculus::Platform::Samples::VrHoops {
  // Size: 0x7C
  #pragma pack(push, 1)
  // Autogenerated type: Oculus.Platform.Samples.VrHoops.MatchController
  // [TokenAttribute] Offset: FFFFFFFF
  class MatchController : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::Oculus::Platform::Samples::VrHoops::MatchController::State
    struct State;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: Oculus.Platform.Samples.VrHoops.MatchController/Oculus.Platform.Samples.VrHoops.State
    // [TokenAttribute] Offset: FFFFFFFF
    struct State/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: State
      constexpr State(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public Oculus.Platform.Samples.VrHoops.MatchController/Oculus.Platform.Samples.VrHoops.State UNKNOWN
      static constexpr const int UNKNOWN = 0;
      // Get static field: static public Oculus.Platform.Samples.VrHoops.MatchController/Oculus.Platform.Samples.VrHoops.State UNKNOWN
      static ::Oculus::Platform::Samples::VrHoops::MatchController::State _get_UNKNOWN();
      // Set static field: static public Oculus.Platform.Samples.VrHoops.MatchController/Oculus.Platform.Samples.VrHoops.State UNKNOWN
      static void _set_UNKNOWN(::Oculus::Platform::Samples::VrHoops::MatchController::State value);
      // static field const value: static public Oculus.Platform.Samples.VrHoops.MatchController/Oculus.Platform.Samples.VrHoops.State NONE
      static constexpr const int NONE = 1;
      // Get static field: static public Oculus.Platform.Samples.VrHoops.MatchController/Oculus.Platform.Samples.VrHoops.State NONE
      static ::Oculus::Platform::Samples::VrHoops::MatchController::State _get_NONE();
      // Set static field: static public Oculus.Platform.Samples.VrHoops.MatchController/Oculus.Platform.Samples.VrHoops.State NONE
      static void _set_NONE(::Oculus::Platform::Samples::VrHoops::MatchController::State value);
      // static field const value: static public Oculus.Platform.Samples.VrHoops.MatchController/Oculus.Platform.Samples.VrHoops.State WAITING_TO_START_PRACTICE
      static constexpr const int WAITING_TO_START_PRACTICE = 2;
      // Get static field: static public Oculus.Platform.Samples.VrHoops.MatchController/Oculus.Platform.Samples.VrHoops.State WAITING_TO_START_PRACTICE
      static ::Oculus::Platform::Samples::VrHoops::MatchController::State _get_WAITING_TO_START_PRACTICE();
      // Set static field: static public Oculus.Platform.Samples.VrHoops.MatchController/Oculus.Platform.Samples.VrHoops.State WAITING_TO_START_PRACTICE
      static void _set_WAITING_TO_START_PRACTICE(::Oculus::Platform::Samples::VrHoops::MatchController::State value);
      // static field const value: static public Oculus.Platform.Samples.VrHoops.MatchController/Oculus.Platform.Samples.VrHoops.State PRACTICING
      static constexpr const int PRACTICING = 3;
      // Get static field: static public Oculus.Platform.Samples.VrHoops.MatchController/Oculus.Platform.Samples.VrHoops.State PRACTICING
      static ::Oculus::Platform::Samples::VrHoops::MatchController::State _get_PRACTICING();
      // Set static field: static public Oculus.Platform.Samples.VrHoops.MatchController/Oculus.Platform.Samples.VrHoops.State PRACTICING
      static void _set_PRACTICING(::Oculus::Platform::Samples::VrHoops::MatchController::State value);
      // static field const value: static public Oculus.Platform.Samples.VrHoops.MatchController/Oculus.Platform.Samples.VrHoops.State VIEWING_RESULTS_PRACTICE
      static constexpr const int VIEWING_RESULTS_PRACTICE = 4;
      // Get static field: static public Oculus.Platform.Samples.VrHoops.MatchController/Oculus.Platform.Samples.VrHoops.State VIEWING_RESULTS_PRACTICE
      static ::Oculus::Platform::Samples::VrHoops::MatchController::State _get_VIEWING_RESULTS_PRACTICE();
      // Set static field: static public Oculus.Platform.Samples.VrHoops.MatchController/Oculus.Platform.Samples.VrHoops.State VIEWING_RESULTS_PRACTICE
      static void _set_VIEWING_RESULTS_PRACTICE(::Oculus::Platform::Samples::VrHoops::MatchController::State value);
      // static field const value: static public Oculus.Platform.Samples.VrHoops.MatchController/Oculus.Platform.Samples.VrHoops.State WAITING_FOR_MATCH
      static constexpr const int WAITING_FOR_MATCH = 5;
      // Get static field: static public Oculus.Platform.Samples.VrHoops.MatchController/Oculus.Platform.Samples.VrHoops.State WAITING_FOR_MATCH
      static ::Oculus::Platform::Samples::VrHoops::MatchController::State _get_WAITING_FOR_MATCH();
      // Set static field: static public Oculus.Platform.Samples.VrHoops.MatchController/Oculus.Platform.Samples.VrHoops.State WAITING_FOR_MATCH
      static void _set_WAITING_FOR_MATCH(::Oculus::Platform::Samples::VrHoops::MatchController::State value);
      // static field const value: static public Oculus.Platform.Samples.VrHoops.MatchController/Oculus.Platform.Samples.VrHoops.State WAITING_TO_SETUP_MATCH
      static constexpr const int WAITING_TO_SETUP_MATCH = 6;
      // Get static field: static public Oculus.Platform.Samples.VrHoops.MatchController/Oculus.Platform.Samples.VrHoops.State WAITING_TO_SETUP_MATCH
      static ::Oculus::Platform::Samples::VrHoops::MatchController::State _get_WAITING_TO_SETUP_MATCH();
      // Set static field: static public Oculus.Platform.Samples.VrHoops.MatchController/Oculus.Platform.Samples.VrHoops.State WAITING_TO_SETUP_MATCH
      static void _set_WAITING_TO_SETUP_MATCH(::Oculus::Platform::Samples::VrHoops::MatchController::State value);
      // static field const value: static public Oculus.Platform.Samples.VrHoops.MatchController/Oculus.Platform.Samples.VrHoops.State PLAYING_MATCH
      static constexpr const int PLAYING_MATCH = 7;
      // Get static field: static public Oculus.Platform.Samples.VrHoops.MatchController/Oculus.Platform.Samples.VrHoops.State PLAYING_MATCH
      static ::Oculus::Platform::Samples::VrHoops::MatchController::State _get_PLAYING_MATCH();
      // Set static field: static public Oculus.Platform.Samples.VrHoops.MatchController/Oculus.Platform.Samples.VrHoops.State PLAYING_MATCH
      static void _set_PLAYING_MATCH(::Oculus::Platform::Samples::VrHoops::MatchController::State value);
      // static field const value: static public Oculus.Platform.Samples.VrHoops.MatchController/Oculus.Platform.Samples.VrHoops.State VIEWING_MATCH_RESULTS
      static constexpr const int VIEWING_MATCH_RESULTS = 8;
      // Get static field: static public Oculus.Platform.Samples.VrHoops.MatchController/Oculus.Platform.Samples.VrHoops.State VIEWING_MATCH_RESULTS
      static ::Oculus::Platform::Samples::VrHoops::MatchController::State _get_VIEWING_MATCH_RESULTS();
      // Set static field: static public Oculus.Platform.Samples.VrHoops.MatchController/Oculus.Platform.Samples.VrHoops.State VIEWING_MATCH_RESULTS
      static void _set_VIEWING_MATCH_RESULTS(::Oculus::Platform::Samples::VrHoops::MatchController::State value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // Oculus.Platform.Samples.VrHoops.MatchController/Oculus.Platform.Samples.VrHoops.State
    #pragma pack(pop)
    static check_size<sizeof(MatchController::State), 0 + sizeof(int)> __Oculus_Platform_Samples_VrHoops_MatchController_StateSizeCheck;
    static_assert(sizeof(MatchController::State) == 0x4);
    public:
    // private UnityEngine.UI.Text m_timerText
    // Size: 0x8
    // Offset: 0x18
    ::UnityEngine::UI::Text* m_timerText;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Text*) == 0x8);
    // private UnityEngine.Camera m_camera
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::Camera* m_camera;
    // Field size check
    static_assert(sizeof(::UnityEngine::Camera*) == 0x8);
    // private UnityEngine.Transform m_idleCameraTransform
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::Transform* m_idleCameraTransform;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private UnityEngine.UI.Text m_matchmakeButtonText
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::UI::Text* m_matchmakeButtonText;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Text*) == 0x8);
    // private Oculus.Platform.Samples.VrHoops.PlayerArea[] m_playerAreas
    // Size: 0x8
    // Offset: 0x38
    ::ArrayW<::Oculus::Platform::Samples::VrHoops::PlayerArea*> m_playerAreas;
    // Field size check
    static_assert(sizeof(::ArrayW<::Oculus::Platform::Samples::VrHoops::PlayerArea*>) == 0x8);
    // private System.UInt32 PRACTICE_WARMUP_TIME
    // Size: 0x4
    // Offset: 0x40
    uint PRACTICE_WARMUP_TIME;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 MATCH_WARMUP_TIME
    // Size: 0x4
    // Offset: 0x44
    uint MATCH_WARMUP_TIME;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 MATCH_TIME
    // Size: 0x4
    // Offset: 0x48
    uint MATCH_TIME;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 MATCH_COOLDOWN_TIME
    // Size: 0x4
    // Offset: 0x4C
    uint MATCH_COOLDOWN_TIME;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private UnityEngine.GameObject m_mostWinsLeaderboard
    // Size: 0x8
    // Offset: 0x50
    ::UnityEngine::GameObject* m_mostWinsLeaderboard;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject m_highestScoresLeaderboard
    // Size: 0x8
    // Offset: 0x58
    ::UnityEngine::GameObject* m_highestScoresLeaderboard;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject m_leaderboardEntryPrefab
    // Size: 0x8
    // Offset: 0x60
    ::UnityEngine::GameObject* m_leaderboardEntryPrefab;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject m_flytext
    // Size: 0x8
    // Offset: 0x68
    ::UnityEngine::GameObject* m_flytext;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private Oculus.Platform.Samples.VrHoops.MatchController/Oculus.Platform.Samples.VrHoops.State m_currentState
    // Size: 0x4
    // Offset: 0x70
    ::Oculus::Platform::Samples::VrHoops::MatchController::State m_currentState;
    // Field size check
    static_assert(sizeof(::Oculus::Platform::Samples::VrHoops::MatchController::State) == 0x4);
    // private System.Single m_nextStateTransitionTime
    // Size: 0x4
    // Offset: 0x74
    float m_nextStateTransitionTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Int32 m_localSlot
    // Size: 0x4
    // Offset: 0x78
    int m_localSlot;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: private UnityEngine.UI.Text m_timerText
    [[deprecated("Use field access instead!")]] ::UnityEngine::UI::Text*& dyn_m_timerText();
    // Get instance field reference: private UnityEngine.Camera m_camera
    [[deprecated("Use field access instead!")]] ::UnityEngine::Camera*& dyn_m_camera();
    // Get instance field reference: private UnityEngine.Transform m_idleCameraTransform
    [[deprecated("Use field access instead!")]] ::UnityEngine::Transform*& dyn_m_idleCameraTransform();
    // Get instance field reference: private UnityEngine.UI.Text m_matchmakeButtonText
    [[deprecated("Use field access instead!")]] ::UnityEngine::UI::Text*& dyn_m_matchmakeButtonText();
