// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.IO.Stream
#include "System/IO/Stream.hpp"
// Including type: System.IO.Compression.CompressionMode
#include "System/IO/Compression/CompressionMode.hpp"
// Including type: System.IO.Compression.ZipArchiveEntry/System.IO.Compression.CompressionMethodValues
#include "System/IO/Compression/ZipArchiveEntry.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::IO::Compression
namespace System::IO::Compression {
  // Forward declaring type: InflaterManaged
  class InflaterManaged;
  // Forward declaring type: DeflaterManaged
  class DeflaterManaged;
  // Forward declaring type: IFileFormatWriter
  class IFileFormatWriter;
  // Forward declaring type: IFileFormatReader
  class IFileFormatReader;
}
// Forward declaring namespace: System::Threading::Tasks
namespace System::Threading::Tasks {
  // Forward declaring type: Task`1<TResult>
  template<typename TResult>
  class Task_1;
  // Forward declaring type: Task
  class Task;
}
// Forward declaring namespace: System::Threading
namespace System::Threading {
  // Forward declaring type: CancellationToken
  struct CancellationToken;
}
// Forward declaring namespace: System::IO
namespace System::IO {
  // Forward declaring type: SeekOrigin
  struct SeekOrigin;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: IAsyncResult
  class IAsyncResult;
  // Forward declaring type: AsyncCallback
  class AsyncCallback;
}
// Completed forward declares
// Type namespace: System.IO.Compression
namespace System::IO::Compression {
  // Forward declaring type: DeflateManagedStream
  class DeflateManagedStream;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::System::IO::Compression::DeflateManagedStream);
DEFINE_IL2CPP_ARG_TYPE(::System::IO::Compression::DeflateManagedStream*, "System.IO.Compression", "DeflateManagedStream");
// Type namespace: System.IO.Compression
namespace System::IO::Compression {
  // Size: 0x62
  #pragma pack(push, 1)
  // Autogenerated type: System.IO.Compression.DeflateManagedStream
  // [TokenAttribute] Offset: FFFFFFFF
  class DeflateManagedStream : public ::System::IO::Stream {
    public:
    // Nested type: ::System::IO::Compression::DeflateManagedStream::$ReadAsyncCore$d__40
    struct $ReadAsyncCore$d__40;
    // Nested type: ::System::IO::Compression::DeflateManagedStream::$WriteAsyncCore$d__47
    struct $WriteAsyncCore$d__47;
    public:
    // private System.IO.Stream _stream
    // Size: 0x8
    // Offset: 0x28
    ::System::IO::Stream* stream;
    // Field size check
    static_assert(sizeof(::System::IO::Stream*) == 0x8);
    // private System.IO.Compression.CompressionMode _mode
    // Size: 0x4
    // Offset: 0x30
    ::System::IO::Compression::CompressionMode mode;
    // Field size check
    static_assert(sizeof(::System::IO::Compression::CompressionMode) == 0x4);
    // private System.Boolean _leaveOpen
    // Size: 0x1
    // Offset: 0x34
    bool leaveOpen;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: leaveOpen and: inflater
    char __padding2[0x3] = {};
    // private System.IO.Compression.InflaterManaged _inflater
    // Size: 0x8
    // Offset: 0x38
    ::System::IO::Compression::InflaterManaged* inflater;
    // Field size check
    static_assert(sizeof(::System::IO::Compression::InflaterManaged*) == 0x8);
    // private System.IO.Compression.DeflaterManaged _deflater
    // Size: 0x8
    // Offset: 0x40
    ::System::IO::Compression::DeflaterManaged* deflater;
    // Field size check
    static_assert(sizeof(::System::IO::Compression::DeflaterManaged*) == 0x8);
    // private System.Byte[] _buffer
    // Size: 0x8
    // Offset: 0x48
    ::ArrayW<uint8_t> buffer;
    // Field size check
    static_assert(sizeof(::ArrayW<uint8_t>) == 0x8);
    // private System.Int32 _asyncOperations
    // Size: 0x4
    // Offset: 0x50
    int asyncOperations;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: asyncOperations and: formatWriter
    char __padding6[0x4] = {};
    // private System.IO.Compression.IFileFormatWriter _formatWriter
    // Size: 0x8
    // Offset: 0x58
    ::System::IO::Compression::IFileFormatWriter* formatWriter;
    // Field size check
    static_assert(sizeof(::System::IO::Compression::IFileFormatWriter*) == 0x8);
    // private System.Boolean _wroteHeader
    // Size: 0x1
    // Offset: 0x60
    bool wroteHeader;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _wroteBytes
    // Size: 0x1
    // Offset: 0x61
    bool wroteBytes;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Get instance field reference: private System.IO.Stream _stream
    [[deprecated]] ::System::IO::Stream*& dyn__stream();
    // Get instance field reference: private System.IO.Compression.CompressionMode _mode
    [[deprecated]] ::System::IO::Compression::CompressionMode& dyn__mode();
    // Get instance field reference: private System.Boolean _leaveOpen
    [[deprecated]] bool& dyn__leaveOpen();
    // Get instance field reference: private System.IO.Compression.InflaterManaged _inflater
    [[deprecated]] ::System::IO::Compression::InflaterManaged*& dyn__inflater();
    // Get instance field reference: private System.IO.Compression.DeflaterManaged _deflater
    [[deprecated]] ::System::IO::Compression::DeflaterManaged*& dyn__deflater();
    // Get instance field reference: private System.Byte[] _buffer
    [[deprecated]] ::ArrayW<uint8_t>& dyn__buffer();
