// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.IO.Compression.ZipVersionMadeByPlatform
#include "System/IO/Compression/ZipVersionMadeByPlatform.hpp"
// Including type: System.IO.Compression.ZipVersionNeededValues
#include "System/IO/Compression/ZipVersionNeededValues.hpp"
// Including type: System.DateTimeOffset
#include "System/DateTimeOffset.hpp"
// Including type: System.Nullable`1
#include "System/Nullable_1.hpp"
// Including type: System.IO.Compression.ZipGenericExtraField
#include "System/IO/Compression/ZipGenericExtraField.hpp"
// Including type: System.IO.Compression.CompressionLevel
#include "System/IO/Compression/CompressionLevel.hpp"
// Including type: System.IO.Compression.ZipCentralDirectoryFileHeader
#include "System/IO/Compression/ZipCentralDirectoryFileHeader.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::IO::Compression
namespace System::IO::Compression {
  // Forward declaring type: ZipArchive
  class ZipArchive;
  // Skipping declaration: CompressionMethodValues because it is already included!
  // Forward declaring type: CheckSumAndSizeWriteStream
  class CheckSumAndSizeWriteStream;
}
// Forward declaring namespace: System::IO
namespace System::IO {
  // Forward declaring type: Stream
  class Stream;
  // Forward declaring type: MemoryStream
  class MemoryStream;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: EventHandler
  class EventHandler;
}
// Completed forward declares
// Type namespace: System.IO.Compression
namespace System::IO::Compression {
  // Forward declaring type: ZipArchiveEntry
  class ZipArchiveEntry;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::System::IO::Compression::ZipArchiveEntry);
DEFINE_IL2CPP_ARG_TYPE(::System::IO::Compression::ZipArchiveEntry*, "System.IO.Compression", "ZipArchiveEntry");
// Type namespace: System.IO.Compression
namespace System::IO::Compression {
  // WARNING Size may be invalid!
  // Autogenerated type: System.IO.Compression.ZipArchiveEntry
  // [TokenAttribute] Offset: FFFFFFFF
  class ZipArchiveEntry : public ::Il2CppObject {
    public:
    // Nested type: ::System::IO::Compression::ZipArchiveEntry::DirectToArchiveWriterStream
    class DirectToArchiveWriterStream;
    // Nested type: ::System::IO::Compression::ZipArchiveEntry::BitFlagValues
    struct BitFlagValues;
    // Nested type: ::System::IO::Compression::ZipArchiveEntry::CompressionMethodValues
    struct CompressionMethodValues;
    // Nested type: ::System::IO::Compression::ZipArchiveEntry::$$c
    class $$c;
    // Size: 0x2
    #pragma pack(push, 1)
    // Autogenerated type: System.IO.Compression.ZipArchiveEntry/System.IO.Compression.BitFlagValues
    // [TokenAttribute] Offset: FFFFFFFF
    // [FlagsAttribute] Offset: FFFFFFFF
    struct BitFlagValues/*, public ::System::Enum*/ {
      public:
      public:
      // public System.UInt16 value__
      // Size: 0x2
      // Offset: 0x0
      uint16_t value;
      // Field size check
      static_assert(sizeof(uint16_t) == 0x2);
      public:
      // Creating value type constructor for type: BitFlagValues
      constexpr BitFlagValues(uint16_t value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator uint16_t
      constexpr operator uint16_t() const noexcept {
        return value;
      }
      // static field const value: static public System.IO.Compression.ZipArchiveEntry/System.IO.Compression.BitFlagValues DataDescriptor
      static constexpr const uint16_t DataDescriptor = 8u;
      // Get static field: static public System.IO.Compression.ZipArchiveEntry/System.IO.Compression.BitFlagValues DataDescriptor
      static ::System::IO::Compression::ZipArchiveEntry::BitFlagValues _get_DataDescriptor();
      // Set static field: static public System.IO.Compression.ZipArchiveEntry/System.IO.Compression.BitFlagValues DataDescriptor
      static void _set_DataDescriptor(::System::IO::Compression::ZipArchiveEntry::BitFlagValues value);
      // static field const value: static public System.IO.Compression.ZipArchiveEntry/System.IO.Compression.BitFlagValues UnicodeFileName
      static constexpr const uint16_t UnicodeFileName = 2048u;
      // Get static field: static public System.IO.Compression.ZipArchiveEntry/System.IO.Compression.BitFlagValues UnicodeFileName
      static ::System::IO::Compression::ZipArchiveEntry::BitFlagValues _get_UnicodeFileName();
      // Set static field: static public System.IO.Compression.ZipArchiveEntry/System.IO.Compression.BitFlagValues UnicodeFileName
      static void _set_UnicodeFileName(::System::IO::Compression::ZipArchiveEntry::BitFlagValues value);
      // Get instance field reference: public System.UInt16 value__
      [[deprecated("Use field access instead!")]] uint16_t& dyn_value__();
    }; // System.IO.Compression.ZipArchiveEntry/System.IO.Compression.BitFlagValues
    #pragma pack(pop)
    static check_size<sizeof(ZipArchiveEntry::BitFlagValues), 0 + sizeof(uint16_t)> __System_IO_Compression_ZipArchiveEntry_BitFlagValuesSizeCheck;
    static_assert(sizeof(ZipArchiveEntry::BitFlagValues) == 0x2);
    // Size: 0x2
    #pragma pack(push, 1)
    // Autogenerated type: System.IO.Compression.ZipArchiveEntry/System.IO.Compression.CompressionMethodValues
    // [TokenAttribute] Offset: FFFFFFFF
    struct CompressionMethodValues/*, public ::System::Enum*/ {
      public:
      public:
      // public System.UInt16 value__
      // Size: 0x2
      // Offset: 0x0
      uint16_t value;
      // Field size check
      static_assert(sizeof(uint16_t) == 0x2);
      public:
      // Creating value type constructor for type: CompressionMethodValues
      constexpr CompressionMethodValues(uint16_t value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator uint16_t
      constexpr operator uint16_t() const noexcept {
        return value;
      }
      // static field const value: static public System.IO.Compression.ZipArchiveEntry/System.IO.Compression.CompressionMethodValues Stored
      static constexpr const uint16_t Stored = 0u;
      // Get static field: static public System.IO.Compression.ZipArchiveEntry/System.IO.Compression.CompressionMethodValues Stored
      static ::System::IO::Compression::ZipArchiveEntry::CompressionMethodValues _get_Stored();
      // Set static field: static public System.IO.Compression.ZipArchiveEntry/System.IO.Compression.CompressionMethodValues Stored
      static void _set_Stored(::System::IO::Compression::ZipArchiveEntry::CompressionMethodValues value);
      // static field const value: static public System.IO.Compression.ZipArchiveEntry/System.IO.Compression.CompressionMethodValues Deflate
      static constexpr const uint16_t Deflate = 8u;
      // Get static field: static public System.IO.Compression.ZipArchiveEntry/System.IO.Compression.CompressionMethodValues Deflate
      static ::System::IO::Compression::ZipArchiveEntry::CompressionMethodValues _get_Deflate();
      // Set static field: static public System.IO.Compression.ZipArchiveEntry/System.IO.Compression.CompressionMethodValues Deflate
      static void _set_Deflate(::System::IO::Compression::ZipArchiveEntry::CompressionMethodValues value);
      // static field const value: static public System.IO.Compression.ZipArchiveEntry/System.IO.Compression.CompressionMethodValues Deflate64
      static constexpr const uint16_t Deflate64 = 9u;
      // Get static field: static public System.IO.Compression.ZipArchiveEntry/System.IO.Compression.CompressionMethodValues Deflate64
      static ::System::IO::Compression::ZipArchiveEntry::CompressionMethodValues _get_Deflate64();
      // Set static field: static public System.IO.Compression.ZipArchiveEntry/System.IO.Compression.CompressionMethodValues Deflate64
      static void _set_Deflate64(::System::IO::Compression::ZipArchiveEntry::CompressionMethodValues value);
      // static field const value: static public System.IO.Compression.ZipArchiveEntry/System.IO.Compression.CompressionMethodValues BZip2
      static constexpr const uint16_t BZip2 = 12u;
      // Get static field: static public System.IO.Compression.ZipArchiveEntry/System.IO.Compression.CompressionMethodValues BZip2
      static ::System::IO::Compression::ZipArchiveEntry::CompressionMethodValues _get_BZip2();
      // Set static field: static public System.IO.Compression.ZipArchiveEntry/System.IO.Compression.CompressionMethodValues BZip2
      static void _set_BZip2(::System::IO::Compression::ZipArchiveEntry::CompressionMethodValues value);
      // static field const value: static public System.IO.Compression.ZipArchiveEntry/System.IO.Compression.CompressionMethodValues LZMA
      static constexpr const uint16_t LZMA = 14u;
      // Get static field: static public System.IO.Compression.ZipArchiveEntry/System.IO.Compression.CompressionMethodValues LZMA
      static ::System::IO::Compression::ZipArchiveEntry::CompressionMethodValues _get_LZMA();
      // Set static field: static public System.IO.Compression.ZipArchiveEntry/System.IO.Compression.CompressionMethodValues LZMA
      static void _set_LZMA(::System::IO::Compression::ZipArchiveEntry::CompressionMethodValues value);
      // Get instance field reference: public System.UInt16 value__
      [[deprecated("Use field access instead!")]] uint16_t& dyn_value__();
    }; // System.IO.Compression.ZipArchiveEntry/System.IO.Compression.CompressionMethodValues
    #pragma pack(pop)
    static check_size<sizeof(ZipArchiveEntry::CompressionMethodValues), 0 + sizeof(uint16_t)> __System_IO_Compression_ZipArchiveEntry_CompressionMethodValuesSizeCheck;
    static_assert(sizeof(ZipArchiveEntry::CompressionMethodValues) == 0x2);
    public:
    // private System.IO.Compression.ZipArchive _archive
    // Size: 0x8
    // Offset: 0x10
    ::System::IO::Compression::ZipArchive* archive;
    // Field size check
    static_assert(sizeof(::System::IO::Compression::ZipArchive*) == 0x8);
    // private readonly System.Boolean _originallyInArchive
    // Size: 0x1
    // Offset: 0x18
    bool originallyInArchive;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private readonly System.Int32 _diskNumberStart
    // Size: 0x4
    // Offset: 0x1C
    int diskNumberStart;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private readonly System.IO.Compression.ZipVersionMadeByPlatform _versionMadeByPlatform
    // Size: 0x1
    // Offset: 0x20
    ::System::IO::Compression::ZipVersionMadeByPlatform versionMadeByPlatform;
    // Field size check
    static_assert(sizeof(::System::IO::Compression::ZipVersionMadeByPlatform) == 0x1);
    // private System.IO.Compression.ZipVersionNeededValues _versionMadeBySpecification
    // Size: 0x2
    // Offset: 0x22
    ::System::IO::Compression::ZipVersionNeededValues versionMadeBySpecification;
    // Field size check
    static_assert(sizeof(::System::IO::Compression::ZipVersionNeededValues) == 0x2);
    // private System.IO.Compression.ZipVersionNeededValues _versionToExtract
    // Size: 0x2
    // Offset: 0x24
    ::System::IO::Compression::ZipVersionNeededValues versionToExtract;
    // Field size check
    static_assert(sizeof(::System::IO::Compression::ZipVersionNeededValues) == 0x2);
    // private System.IO.Compression.ZipArchiveEntry/System.IO.Compression.BitFlagValues _generalPurposeBitFlag
    // Size: 0x2
    // Offset: 0x26
    ::System::IO::Compression::ZipArchiveEntry::BitFlagValues generalPurposeBitFlag;
    // Field size check
    static_assert(sizeof(::System::IO::Compression::ZipArchiveEntry::BitFlagValues) == 0x2);
    // private System.IO.Compression.ZipArchiveEntry/System.IO.Compression.CompressionMethodValues _storedCompressionMethod
    // Size: 0x2
    // Offset: 0x28
    ::System::IO::Compression::ZipArchiveEntry::CompressionMethodValues storedCompressionMethod;
    // Field size check
    static_assert(sizeof(::System::IO::Compression::ZipArchiveEntry::CompressionMethodValues) == 0x2);
    // private System.DateTimeOffset _lastModified
    // Size: 0xA
    // Offset: 0x30
    ::System::DateTimeOffset lastModified;
    // Field size check
    static_assert(sizeof(::System::DateTimeOffset) == 0xA);
    // private System.Int64 _compressedSize
    // Size: 0x8
    // Offset: 0x40
    int64_t compressedSize;
    // Field size check
    static_assert(sizeof(int64_t) == 0x8);
    // private System.Int64 _uncompressedSize
    // Size: 0x8
    // Offset: 0x48
    int64_t uncompressedSize;
    // Field size check
    static_assert(sizeof(int64_t) == 0x8);
    // private System.Int64 _offsetOfLocalHeader
    // Size: 0x8
    // Offset: 0x50
    int64_t offsetOfLocalHeader;
    // Field size check
    static_assert(sizeof(int64_t) == 0x8);
    // private System.Nullable`1<System.Int64> _storedOffsetOfCompressedData
    // Size: 0xFFFFFFFF
    // Offset: 0x58
    ::System::Nullable_1<int64_t> storedOffsetOfCompressedData;
    // private System.UInt32 _crc32
    // Size: 0x4
    // Offset: 0x68
    uint crc32;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.Byte[][] _compressedBytes
    // Size: 0x8
    // Offset: 0x70
    ::ArrayW<::ArrayW<uint8_t>> compressedBytes;
    // Field size check
    static_assert(sizeof(::ArrayW<::ArrayW<uint8_t>>) == 0x8);
    // private System.IO.MemoryStream _storedUncompressedData
    // Size: 0x8
    // Offset: 0x78
    ::System::IO::MemoryStream* storedUncompressedData;
    // Field size check
    static_assert(sizeof(::System::IO::MemoryStream*) == 0x8);
    // private System.Boolean _currentlyOpenForWrite
    // Size: 0x1
    // Offset: 0x80
    bool currentlyOpenForWrite;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _everOpenedForWrite
    // Size: 0x1
    // Offset: 0x81
    bool everOpenedForWrite;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.IO.Stream _outstandingWriteStream
    // Size: 0x8
    // Offset: 0x88
    ::System::IO::Stream* outstandingWriteStream;
    // Field size check
    static_assert(sizeof(::System::IO::Stream*) == 0x8);
    // private System.UInt32 _externalFileAttr
    // Size: 0x4
    // Offset: 0x90
    uint externalFileAttr;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.String _storedEntryName
    // Size: 0x8
    // Offset: 0x98
    ::StringW storedEntryName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Byte[] _storedEntryNameBytes
    // Size: 0x8
    // Offset: 0xA0
    ::ArrayW<uint8_t> storedEntryNameBytes;
    // Field size check
    static_assert(sizeof(::ArrayW<uint8_t>) == 0x8);
    // private System.Collections.Generic.List`1<System.IO.Compression.ZipGenericExtraField> _cdUnknownExtraFields
    // Size: 0x8
    // Offset: 0xA8
    ::System::Collections::Generic::List_1<::System::IO::Compression::ZipGenericExtraField>* cdUnknownExtraFields;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::System::IO::Compression::ZipGenericExtraField>*) == 0x8);
    // private System.Collections.Generic.List`1<System.IO.Compression.ZipGenericExtraField> _lhUnknownExtraFields
    // Size: 0x8
    // Offset: 0xB0
    ::System::Collections::Generic::List_1<::System::IO::Compression::ZipGenericExtraField>* lhUnknownExtraFields;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::System::IO::Compression::ZipGenericExtraField>*) == 0x8);
    // private System.Byte[] _fileComment
    // Size: 0x8
    // Offset: 0xB8
    ::ArrayW<uint8_t> fileComment;
    // Field size check
    static_assert(sizeof(::ArrayW<uint8_t>) == 0x8);
    // private System.Nullable`1<System.IO.Compression.CompressionLevel> _compressionLevel
    // Size: 0xFFFFFFFF
    // Offset: 0xC0
    ::System::Nullable_1<::System::IO::Compression::CompressionLevel> compressionLevel;
    public:
    // Get static field: static private readonly System.Boolean s_allowLargeZipArchiveEntriesInUpdateMode
    static bool _get_s_allowLargeZipArchiveEntriesInUpdateMode();
    // Set static field: static private readonly System.Boolean s_allowLargeZipArchiveEntriesInUpdateMode
    static void _set_s_allowLargeZipArchiveEntriesInUpdateMode(bool value);
    // Get static field: static readonly System.IO.Compression.ZipVersionMadeByPlatform CurrentZipPlatform
    static ::System::IO::Compression::ZipVersionMadeByPlatform _get_CurrentZipPlatform();
    // Set static field: static readonly System.IO.Compression.ZipVersionMadeByPlatform CurrentZipPlatform
    static void _set_CurrentZipPlatform(::System::IO::Compression::ZipVersionMadeByPlatform value);
    // Get instance field reference: private System.IO.Compression.ZipArchive _archive
