// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.IDisposable
#include "System/IDisposable.hpp"
// Including type: System.IO.Compression.ZipArchiveMode
#include "System/IO/Compression/ZipArchiveMode.hpp"
// Including type: System.IO.Compression.CompressionLevel
#include "System/IO/Compression/CompressionLevel.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::IO
namespace System::IO {
  // Forward declaring type: Stream
  class Stream;
  // Forward declaring type: BinaryReader
  class BinaryReader;
}
// Forward declaring namespace: System::IO::Compression
namespace System::IO::Compression {
  // Forward declaring type: ZipArchiveEntry
  class ZipArchiveEntry;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Forward declaring namespace: System::Collections::ObjectModel
namespace System::Collections::ObjectModel {
  // Forward declaring type: ReadOnlyCollection`1<T>
  template<typename T>
  class ReadOnlyCollection_1;
}
// Forward declaring namespace: System::Text
namespace System::Text {
  // Forward declaring type: Encoding
  class Encoding;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Nullable`1<T>
  template<typename T>
  struct Nullable_1;
}
// Completed forward declares
// Type namespace: System.IO.Compression
namespace System::IO::Compression {
  // Forward declaring type: ZipArchive
  class ZipArchive;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::System::IO::Compression::ZipArchive);
DEFINE_IL2CPP_ARG_TYPE(::System::IO::Compression::ZipArchive*, "System.IO.Compression", "ZipArchive");
// Type namespace: System.IO.Compression
namespace System::IO::Compression {
  // Size: 0x80
  #pragma pack(push, 1)
  // Autogenerated type: System.IO.Compression.ZipArchive
  // [TokenAttribute] Offset: FFFFFFFF
  class ZipArchive : public ::Il2CppObject/*, public ::System::IDisposable*/ {
    public:
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // private System.IO.Stream _archiveStream
    // Size: 0x8
    // Offset: 0x10
    ::System::IO::Stream* archiveStream;
    // Field size check
    static_assert(sizeof(::System::IO::Stream*) == 0x8);
    // private System.IO.Compression.ZipArchiveEntry _archiveStreamOwner
    // Size: 0x8
    // Offset: 0x18
    ::System::IO::Compression::ZipArchiveEntry* archiveStreamOwner;
    // Field size check
    static_assert(sizeof(::System::IO::Compression::ZipArchiveEntry*) == 0x8);
    // private System.IO.BinaryReader _archiveReader
    // Size: 0x8
    // Offset: 0x20
    ::System::IO::BinaryReader* archiveReader;
    // Field size check
    static_assert(sizeof(::System::IO::BinaryReader*) == 0x8);
    // private System.IO.Compression.ZipArchiveMode _mode
    // Size: 0x14
    // Offset: 0x28
    ::System::IO::Compression::ZipArchiveMode mode;
    // Field size check
    static_assert(sizeof(::System::IO::Compression::ZipArchiveMode) == 0x14);
    // private System.Collections.Generic.List`1<System.IO.Compression.ZipArchiveEntry> _entries
    // Size: 0x8
    // Offset: 0x30
    ::System::Collections::Generic::List_1<::System::IO::Compression::ZipArchiveEntry*>* entries;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::System::IO::Compression::ZipArchiveEntry*>*) == 0x8);
    // private System.Collections.ObjectModel.ReadOnlyCollection`1<System.IO.Compression.ZipArchiveEntry> _entriesCollection
    // Size: 0x8
    // Offset: 0x38
    ::System::Collections::ObjectModel::ReadOnlyCollection_1<::System::IO::Compression::ZipArchiveEntry*>* entriesCollection;
    // Field size check
    static_assert(sizeof(::System::Collections::ObjectModel::ReadOnlyCollection_1<::System::IO::Compression::ZipArchiveEntry*>*) == 0x8);
    // private System.Collections.Generic.Dictionary`2<System.String,System.IO.Compression.ZipArchiveEntry> _entriesDictionary
    // Size: 0x8
    // Offset: 0x40
    ::System::Collections::Generic::Dictionary_2<::StringW, ::System::IO::Compression::ZipArchiveEntry*>* entriesDictionary;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::StringW, ::System::IO::Compression::ZipArchiveEntry*>*) == 0x8);
    // private System.Boolean _readEntries
    // Size: 0x1
    // Offset: 0x48
    bool readEntries;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _leaveOpen
    // Size: 0x1
    // Offset: 0x49
    bool leaveOpen;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: leaveOpen and: centralDirectoryStart
    char __padding8[0x6] = {};
    // private System.Int64 _centralDirectoryStart
    // Size: 0x8
    // Offset: 0x50
    int64_t centralDirectoryStart;
    // Field size check
    static_assert(sizeof(int64_t) == 0x8);
    // private System.Boolean _isDisposed
    // Size: 0x1
    // Offset: 0x58
    bool isDisposed;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isDisposed and: numberOfThisDisk
    char __padding10[0x3] = {};
    // private System.UInt32 _numberOfThisDisk
    // Size: 0x4
    // Offset: 0x5C
    uint numberOfThisDisk;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.Int64 _expectedNumberOfEntries
    // Size: 0x8
    // Offset: 0x60
    int64_t expectedNumberOfEntries;
    // Field size check
    static_assert(sizeof(int64_t) == 0x8);
    // private System.IO.Stream _backingStream
    // Size: 0x8
    // Offset: 0x68
    ::System::IO::Stream* backingStream;
    // Field size check
    static_assert(sizeof(::System::IO::Stream*) == 0x8);
    // private System.Byte[] _archiveComment
    // Size: 0x8
    // Offset: 0x70
    ::ArrayW<uint8_t> archiveComment;
    // Field size check
    static_assert(sizeof(::ArrayW<uint8_t>) == 0x8);
    // private System.Text.Encoding _entryNameEncoding
    // Size: 0x8
    // Offset: 0x78
    ::System::Text::Encoding* entryNameEncoding;
    // Field size check
    static_assert(sizeof(::System::Text::Encoding*) == 0x8);
    public:
    // Creating interface conversion operator: operator ::System::IDisposable
    operator ::System::IDisposable() noexcept {
      return *reinterpret_cast<::System::IDisposable*>(this);
    }
    // Get instance field reference: private System.IO.Stream _archiveStream
    ::System::IO::Stream*& dyn__archiveStream();
    // Get instance field reference: private System.IO.Compression.ZipArchiveEntry _archiveStreamOwner
    ::System::IO::Compression::ZipArchiveEntry*& dyn__archiveStreamOwner();
    // Get instance field reference: private System.IO.BinaryReader _archiveReader
    ::System::IO::BinaryReader*& dyn__archiveReader();
    // Get instance field reference: private System.IO.Compression.ZipArchiveMode _mode
    ::System::IO::Compression::ZipArchiveMode& dyn__mode();
