// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: OggVorbisEncoder.Setup.ISetupTemplate
#include "OggVorbisEncoder/Setup/ISetupTemplate.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: OggVorbisEncoder::Setup
namespace OggVorbisEncoder::Setup {
  // Forward declaring type: Att3
  class Att3;
  // Forward declaring type: AdjBlock
  class AdjBlock;
  // Forward declaring type: NoiseGuard
  class NoiseGuard;
  // Forward declaring type: Noise3
  class Noise3;
  // Forward declaring type: CompandBlock
  class CompandBlock;
  // Forward declaring type: PsyGlobal
  class PsyGlobal;
  // Forward declaring type: AdjStereo
  class AdjStereo;
  // Forward declaring type: IStaticCodeBook
  class IStaticCodeBook;
  // Forward declaring type: Floor
  class Floor;
  // Forward declaring type: IMappingTemplate
  class IMappingTemplate;
}
// Completed forward declares
// Type namespace: OggVorbisEncoder.Setup.Templates.Stereo44
namespace OggVorbisEncoder::Setup::Templates::Stereo44 {
  // Forward declaring type: Stereo44SetupDataTemplate
  class Stereo44SetupDataTemplate;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::OggVorbisEncoder::Setup::Templates::Stereo44::Stereo44SetupDataTemplate);
DEFINE_IL2CPP_ARG_TYPE(::OggVorbisEncoder::Setup::Templates::Stereo44::Stereo44SetupDataTemplate*, "OggVorbisEncoder.Setup.Templates.Stereo44", "Stereo44SetupDataTemplate");
// Type namespace: OggVorbisEncoder.Setup.Templates.Stereo44
namespace OggVorbisEncoder::Setup::Templates::Stereo44 {
  // Size: 0x120
  #pragma pack(push, 1)
  // Autogenerated type: OggVorbisEncoder.Setup.Templates.Stereo44.Stereo44SetupDataTemplate
  // [TokenAttribute] Offset: FFFFFFFF
  class Stereo44SetupDataTemplate : public ::Il2CppObject/*, public ::OggVorbisEncoder::Setup::ISetupTemplate*/ {
    public:
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // private readonly System.Double[] <SampleRateMapping>k__BackingField
    // Size: 0x8
    // Offset: 0x10
    ::ArrayW<double> SampleRateMapping;
    // Field size check
    static_assert(sizeof(::ArrayW<double>) == 0x8);
    // private readonly System.Double[] <QualityMapping>k__BackingField
    // Size: 0x8
    // Offset: 0x18
    ::ArrayW<double> QualityMapping;
    // Field size check
    static_assert(sizeof(::ArrayW<double>) == 0x8);
    // private readonly System.Int32 <CouplingRestriction>k__BackingField
    // Size: 0x4
    // Offset: 0x20
    int CouplingRestriction;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private readonly System.Int32 <SampleRateMinRestriction>k__BackingField
    // Size: 0x4
    // Offset: 0x24
    int SampleRateMinRestriction;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private readonly System.Int32 <SampleRateMaxRestriction>k__BackingField
    // Size: 0x4
    // Offset: 0x28
    int SampleRateMaxRestriction;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: SampleRateMaxRestriction and: BlockSizeShort
    char __padding4[0x4] = {};
    // private readonly System.Int32[] <BlockSizeShort>k__BackingField
    // Size: 0x8
    // Offset: 0x30
    ::ArrayW<int> BlockSizeShort;
    // Field size check
    static_assert(sizeof(::ArrayW<int>) == 0x8);
    // private readonly System.Int32[] <BlockSizeLong>k__BackingField
    // Size: 0x8
    // Offset: 0x38
    ::ArrayW<int> BlockSizeLong;
    // Field size check
    static_assert(sizeof(::ArrayW<int>) == 0x8);
    // private readonly OggVorbisEncoder.Setup.Att3[] <PsyToneMasterAtt>k__BackingField
    // Size: 0x8
    // Offset: 0x40
    ::ArrayW<::OggVorbisEncoder::Setup::Att3*> PsyToneMasterAtt;
    // Field size check
    static_assert(sizeof(::ArrayW<::OggVorbisEncoder::Setup::Att3*>) == 0x8);
    // private readonly System.Int32[] <PsyTone0Decibel>k__BackingField
    // Size: 0x8
    // Offset: 0x48
    ::ArrayW<int> PsyTone0Decibel;
    // Field size check
    static_assert(sizeof(::ArrayW<int>) == 0x8);
    // private readonly System.Int32[] <PsyToneDecibelSuppress>k__BackingField
    // Size: 0x8
    // Offset: 0x50
    ::ArrayW<int> PsyToneDecibelSuppress;
    // Field size check
    static_assert(sizeof(::ArrayW<int>) == 0x8);
    // private readonly OggVorbisEncoder.Setup.AdjBlock[] <PsyToneAdjImpulse>k__BackingField
    // Size: 0x8
    // Offset: 0x58
    ::ArrayW<::OggVorbisEncoder::Setup::AdjBlock*> PsyToneAdjImpulse;
    // Field size check
    static_assert(sizeof(::ArrayW<::OggVorbisEncoder::Setup::AdjBlock*>) == 0x8);
    // private readonly OggVorbisEncoder.Setup.AdjBlock[] <PsyToneAdjLong>k__BackingField
    // Size: 0x8
    // Offset: 0x60
    ::ArrayW<::OggVorbisEncoder::Setup::AdjBlock*> PsyToneAdjLong;
    // Field size check
    static_assert(sizeof(::ArrayW<::OggVorbisEncoder::Setup::AdjBlock*>) == 0x8);
    // private readonly OggVorbisEncoder.Setup.AdjBlock[] <PsyToneAdjOther>k__BackingField
    // Size: 0x8
    // Offset: 0x68
    ::ArrayW<::OggVorbisEncoder::Setup::AdjBlock*> PsyToneAdjOther;
    // Field size check
    static_assert(sizeof(::ArrayW<::OggVorbisEncoder::Setup::AdjBlock*>) == 0x8);
    // private readonly OggVorbisEncoder.Setup.NoiseGuard[] <PsyNoiseGuards>k__BackingField
    // Size: 0x8
    // Offset: 0x70
    ::ArrayW<::OggVorbisEncoder::Setup::NoiseGuard*> PsyNoiseGuards;
    // Field size check
    static_assert(sizeof(::ArrayW<::OggVorbisEncoder::Setup::NoiseGuard*>) == 0x8);
    // private readonly OggVorbisEncoder.Setup.Noise3[] <PsyNoiseBiasImpulse>k__BackingField
    // Size: 0x8
    // Offset: 0x78
    ::ArrayW<::OggVorbisEncoder::Setup::Noise3*> PsyNoiseBiasImpulse;
    // Field size check
    static_assert(sizeof(::ArrayW<::OggVorbisEncoder::Setup::Noise3*>) == 0x8);
    // private readonly OggVorbisEncoder.Setup.Noise3[] <PsyNoiseBiasPadding>k__BackingField
    // Size: 0x8
    // Offset: 0x80
    ::ArrayW<::OggVorbisEncoder::Setup::Noise3*> PsyNoiseBiasPadding;
    // Field size check
    static_assert(sizeof(::ArrayW<::OggVorbisEncoder::Setup::Noise3*>) == 0x8);
    // private readonly OggVorbisEncoder.Setup.Noise3[] <PsyNoiseBiasTrans>k__BackingField
    // Size: 0x8
    // Offset: 0x88
    ::ArrayW<::OggVorbisEncoder::Setup::Noise3*> PsyNoiseBiasTrans;
    // Field size check
    static_assert(sizeof(::ArrayW<::OggVorbisEncoder::Setup::Noise3*>) == 0x8);
    // private readonly OggVorbisEncoder.Setup.Noise3[] <PsyNoiseBiasLong>k__BackingField
    // Size: 0x8
    // Offset: 0x90
    ::ArrayW<::OggVorbisEncoder::Setup::Noise3*> PsyNoiseBiasLong;
    // Field size check
    static_assert(sizeof(::ArrayW<::OggVorbisEncoder::Setup::Noise3*>) == 0x8);
    // private readonly System.Int32[] <PsyNoiseDecibelSuppress>k__BackingField
    // Size: 0x8
    // Offset: 0x98
    ::ArrayW<int> PsyNoiseDecibelSuppress;
    // Field size check
    static_assert(sizeof(::ArrayW<int>) == 0x8);
    // private readonly OggVorbisEncoder.Setup.CompandBlock[] <PsyNoiseCompand>k__BackingField
    // Size: 0x8
    // Offset: 0xA0
    ::ArrayW<::OggVorbisEncoder::Setup::CompandBlock*> PsyNoiseCompand;
    // Field size check
    static_assert(sizeof(::ArrayW<::OggVorbisEncoder::Setup::CompandBlock*>) == 0x8);
    // private readonly System.Double[] <PsyNoiseCompandShortMapping>k__BackingField
    // Size: 0x8
    // Offset: 0xA8
    ::ArrayW<double> PsyNoiseCompandShortMapping;
    // Field size check
    static_assert(sizeof(::ArrayW<double>) == 0x8);
    // private readonly System.Double[] <PsyNoiseCompandLongMapping>k__BackingField
    // Size: 0x8
    // Offset: 0xB0
    ::ArrayW<double> PsyNoiseCompandLongMapping;
    // Field size check
    static_assert(sizeof(::ArrayW<double>) == 0x8);
    // private readonly System.Int32[][] <PsyNoiseNormalStart>k__BackingField
    // Size: 0x8
    // Offset: 0xB8
    ::ArrayW<::ArrayW<int>> PsyNoiseNormalStart;
    // Field size check
    static_assert(sizeof(::ArrayW<::ArrayW<int>>) == 0x8);
    // private readonly System.Int32[][] <PsyNoiseNormalPartition>k__BackingField
    // Size: 0x8
    // Offset: 0xC0
    ::ArrayW<::ArrayW<int>> PsyNoiseNormalPartition;
    // Field size check
    static_assert(sizeof(::ArrayW<::ArrayW<int>>) == 0x8);
    // private readonly System.Double[] <PsyNoiseNormalThreshold>k__BackingField
    // Size: 0x8
    // Offset: 0xC8
    ::ArrayW<double> PsyNoiseNormalThreshold;
    // Field size check
    static_assert(sizeof(::ArrayW<double>) == 0x8);
    // private readonly System.Int32[] <PsyAthFloat>k__BackingField
    // Size: 0x8
    // Offset: 0xD0
    ::ArrayW<int> PsyAthFloat;
    // Field size check
    static_assert(sizeof(::ArrayW<int>) == 0x8);
    // private readonly System.Int32[] <PsyAthAbs>k__BackingField
    // Size: 0x8
    // Offset: 0xD8
    ::ArrayW<int> PsyAthAbs;
    // Field size check
    static_assert(sizeof(::ArrayW<int>) == 0x8);
    // private readonly System.Double[] <PsyLowPass>k__BackingField
    // Size: 0x8
    // Offset: 0xE0
    ::ArrayW<double> PsyLowPass;
    // Field size check
    static_assert(sizeof(::ArrayW<double>) == 0x8);
    // private readonly OggVorbisEncoder.Setup.PsyGlobal[] <GlobalParams>k__BackingField
    // Size: 0x8
    // Offset: 0xE8
    ::ArrayW<::OggVorbisEncoder::Setup::PsyGlobal*> GlobalParams;
    // Field size check
    static_assert(sizeof(::ArrayW<::OggVorbisEncoder::Setup::PsyGlobal*>) == 0x8);
    // private readonly System.Double[] <GlobalMapping>k__BackingField
    // Size: 0x8
    // Offset: 0xF0
    ::ArrayW<double> GlobalMapping;
    // Field size check
    static_assert(sizeof(::ArrayW<double>) == 0x8);
    // private readonly OggVorbisEncoder.Setup.AdjStereo[] <StereoModes>k__BackingField
    // Size: 0x8
    // Offset: 0xF8
    ::ArrayW<::OggVorbisEncoder::Setup::AdjStereo*> StereoModes;
    // Field size check
    static_assert(sizeof(::ArrayW<::OggVorbisEncoder::Setup::AdjStereo*>) == 0x8);
    // private readonly OggVorbisEncoder.Setup.IStaticCodeBook[][] <FloorBooks>k__BackingField
    // Size: 0x8
    // Offset: 0x100
    ::ArrayW<::ArrayW<::OggVorbisEncoder::Setup::IStaticCodeBook*>> FloorBooks;
    // Field size check
    static_assert(sizeof(::ArrayW<::ArrayW<::OggVorbisEncoder::Setup::IStaticCodeBook*>>) == 0x8);
    // private readonly OggVorbisEncoder.Setup.Floor[] <FloorParams>k__BackingField
    // Size: 0x8
    // Offset: 0x108
    ::ArrayW<::OggVorbisEncoder::Setup::Floor*> FloorParams;
    // Field size check
    static_assert(sizeof(::ArrayW<::OggVorbisEncoder::Setup::Floor*>) == 0x8);
    // private readonly System.Int32[][] <FloorMappings>k__BackingField
    // Size: 0x8
    // Offset: 0x110
    ::ArrayW<::ArrayW<int>> FloorMappings;
    // Field size check
    static_assert(sizeof(::ArrayW<::ArrayW<int>>) == 0x8);
    // private readonly OggVorbisEncoder.Setup.IMappingTemplate[] <Maps>k__BackingField
    // Size: 0x8
    // Offset: 0x118
    ::ArrayW<::OggVorbisEncoder::Setup::IMappingTemplate*> Maps;
    // Field size check
    static_assert(sizeof(::ArrayW<::OggVorbisEncoder::Setup::IMappingTemplate*>) == 0x8);
    public:
    // Creating interface conversion operator: operator ::OggVorbisEncoder::Setup::ISetupTemplate
    operator ::OggVorbisEncoder::Setup::ISetupTemplate() noexcept {
      return *reinterpret_cast<::OggVorbisEncoder::Setup::ISetupTemplate*>(this);
    }
    // Get static field: static private readonly System.Double[] SampleRateMapping44Stereo
    static ::ArrayW<double> _get_SampleRateMapping44Stereo();
    // Set static field: static private readonly System.Double[] SampleRateMapping44Stereo
    static void _set_SampleRateMapping44Stereo(::ArrayW<double> value);
    // Get static field: static private readonly System.Double[] QualityMapping44
    static ::ArrayW<double> _get_QualityMapping44();
    // Set static field: static private readonly System.Double[] QualityMapping44
