// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Type namespace: Models
namespace Models {
  // Forward declaring type: Photo
  class Photo;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Models::Photo);
DEFINE_IL2CPP_ARG_TYPE(::Models::Photo*, "Models", "Photo");
// Type namespace: Models
namespace Models {
  // Size: 0x30
  #pragma pack(push, 1)
  // Autogenerated type: Models.Photo
  // [TokenAttribute] Offset: FFFFFFFF
  class Photo : public ::Il2CppObject {
    public:
    public:
    // public System.Int32 albumId
    // Size: 0x4
    // Offset: 0x10
    int albumId;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 id
    // Size: 0x4
    // Offset: 0x14
    int id;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.String title
    // Size: 0x8
    // Offset: 0x18
    ::StringW title;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String url
    // Size: 0x8
    // Offset: 0x20
    ::StringW url;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String thumbnailUrl
    // Size: 0x8
    // Offset: 0x28
    ::StringW thumbnailUrl;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    public:
    // Get instance field reference: public System.Int32 albumId
    [[deprecated("Use field access instead!")]] int& dyn_albumId();
    // Get instance field reference: public System.Int32 id
    [[deprecated("Use field access instead!")]] int& dyn_id();
    // Get instance field reference: public System.String title
    [[deprecated("Use field access instead!")]] ::StringW& dyn_title();
    // Get instance field reference: public System.String url
    [[deprecated("Use field access instead!")]] ::StringW& dyn_url();
    // Get instance field reference: public System.String thumbnailUrl
    [[deprecated("Use field access instead!")]] ::StringW& dyn_thumbnailUrl();
    // public System.Void .ctor()
    // Offset: 0xADE890
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static Photo* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::Models::Photo::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<Photo*, creationType>()));
    }
    // public override System.String ToString()
    // Offset: 0xADE884
    // Implemented from: System.Object
    // Base method: System.String Object::ToString()
    ::StringW ToString();
  }; // Models.Photo
  #pragma pack(pop)
  static check_size<sizeof(Photo), 40 + sizeof(::StringW)> __Models_PhotoSizeCheck;
  static_assert(sizeof(Photo) == 0x30);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: Models::Photo::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
// Writing MetadataGetter for method: Models::Photo::ToString
// Il2CppName: ToString
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::StringW (Models::Photo::*)()>(&Models::Photo::ToString)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Models::Photo*), "ToString", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
