// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Type namespace: Models
namespace Models {
  // Forward declaring type: User
  class User;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Models::User);
DEFINE_IL2CPP_ARG_TYPE(::Models::User*, "Models", "User");
// Type namespace: Models
namespace Models {
  // Size: 0x40
  #pragma pack(push, 1)
  // Autogenerated type: Models.User
  // [TokenAttribute] Offset: FFFFFFFF
  class User : public ::Il2CppObject {
    public:
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // public System.Int32 id
    // Size: 0x4
    // Offset: 0x10
    int id;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: id and: name
    char __padding0[0x4] = {};
    // public System.String name
    // Size: 0x8
    // Offset: 0x18
    ::StringW name;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String username
    // Size: 0x8
    // Offset: 0x20
    ::StringW username;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String email
    // Size: 0x8
    // Offset: 0x28
    ::StringW email;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String phone
    // Size: 0x8
    // Offset: 0x30
    ::StringW phone;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String website
    // Size: 0x8
    // Offset: 0x38
    ::StringW website;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    public:
    // Get instance field reference: public System.Int32 id
    int& dyn_id();
    // Get instance field reference: public System.String name
    ::StringW& dyn_name();
    // Get instance field reference: public System.String username
    ::StringW& dyn_username();
    // Get instance field reference: public System.String email
    ::StringW& dyn_email();
    // Get instance field reference: public System.String phone
    ::StringW& dyn_phone();
    // Get instance field reference: public System.String website
    ::StringW& dyn_website();
    // public System.Void .ctor()
    // Offset: 0x13A6018
    // Implemented from: System.Object
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static User* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::Models::User::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<User*, creationType>()));
    }
    // public override System.String ToString()
    // Offset: 0x13A600C
    // Implemented from: System.Object
    // Base method: System.String Object::ToString()
    ::StringW ToString();
  }; // Models.User
  #pragma pack(pop)
  static check_size<sizeof(User), 56 + sizeof(::StringW)> __Models_UserSizeCheck;
  static_assert(sizeof(User) == 0x40);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: Models::User::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
// Writing MetadataGetter for method: Models::User::ToString
// Il2CppName: ToString
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::StringW (Models::User::*)()>(&Models::User::ToString)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Models::User*), "ToString", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
