// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::UI
namespace UnityEngine::UI {
  // Forward declaring type: Button
  class Button;
}
// Forward declaring namespace: TMPro
namespace TMPro {
  // Forward declaring type: TextMeshProUGUI
  class TextMeshProUGUI;
}
// Forward declaring namespace: VROSC
namespace VROSC {
  // Forward declaring type: CommunitySessionsDataController
  class CommunitySessionsDataController;
  // Forward declaring type: CloudSessionsDataController
  class CloudSessionsDataController;
  // Forward declaring type: UserPreferencesDataController
  class UserPreferencesDataController;
  // Forward declaring type: UserFavoritesDataController
  class UserFavoritesDataController;
  // Forward declaring type: Error
  struct Error;
}
// Completed forward declares
// Type namespace: VROSC.FBDebug
namespace VROSC::FBDebug {
  // Forward declaring type: UserDataDebugPanel
  class UserDataDebugPanel;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::VROSC::FBDebug::UserDataDebugPanel);
DEFINE_IL2CPP_ARG_TYPE(::VROSC::FBDebug::UserDataDebugPanel*, "VROSC.FBDebug", "UserDataDebugPanel");
// Type namespace: VROSC.FBDebug
namespace VROSC::FBDebug {
  // Size: 0x70
  #pragma pack(push, 1)
  // Autogenerated type: VROSC.FBDebug.UserDataDebugPanel
  // [TokenAttribute] Offset: FFFFFFFF
  class UserDataDebugPanel : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // private UnityEngine.UI.Button _getNewDataButton
    // Size: 0x8
    // Offset: 0x18
    ::UnityEngine::UI::Button* getNewDataButton;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Button*) == 0x8);
    // private UnityEngine.UI.Button _writeDataButton
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::UI::Button* writeDataButton;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Button*) == 0x8);
    // private UnityEngine.UI.Button _deleteDataButton
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::UI::Button* deleteDataButton;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Button*) == 0x8);
    // private TMPro.TextMeshProUGUI _dataText
    // Size: 0x8
    // Offset: 0x30
    ::TMPro::TextMeshProUGUI* dataText;
    // Field size check
    static_assert(sizeof(::TMPro::TextMeshProUGUI*) == 0x8);
    // [HeaderAttribute] Offset: 0x78D704
    // private System.String _sessionId
    // Size: 0x8
    // Offset: 0x38
    ::StringW sessionId;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // [HeaderAttribute] Offset: 0x78D750
    // private System.Boolean _alwaysHoldMallets
    // Size: 0x1
    // Offset: 0x40
    bool alwaysHoldMallets;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: alwaysHoldMallets and: malletAngle
    char __padding5[0x3] = {};
    // private System.Single _malletAngle
    // Size: 0x4
    // Offset: 0x44
    float malletAngle;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _malletLength
    // Size: 0x4
    // Offset: 0x48
    float malletLength;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: malletLength and: communitySessionsDataController
    char __padding7[0x4] = {};
    // private VROSC.CommunitySessionsDataController _communitySessionsDataController
    // Size: 0x8
    // Offset: 0x50
    ::VROSC::CommunitySessionsDataController* communitySessionsDataController;
    // Field size check
    static_assert(sizeof(::VROSC::CommunitySessionsDataController*) == 0x8);
    // private VROSC.CloudSessionsDataController _cloudSessionsDataController
    // Size: 0x8
    // Offset: 0x58
    ::VROSC::CloudSessionsDataController* cloudSessionsDataController;
    // Field size check
    static_assert(sizeof(::VROSC::CloudSessionsDataController*) == 0x8);
    // private VROSC.UserPreferencesDataController _userPreferencesDataController
    // Size: 0x8
    // Offset: 0x60
    ::VROSC::UserPreferencesDataController* userPreferencesDataController;
    // Field size check
    static_assert(sizeof(::VROSC::UserPreferencesDataController*) == 0x8);
    // private VROSC.UserFavoritesDataController _userFavoritesDataController
    // Size: 0x8
    // Offset: 0x68
    ::VROSC::UserFavoritesDataController* userFavoritesDataController;
    // Field size check
    static_assert(sizeof(::VROSC::UserFavoritesDataController*) == 0x8);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get static field: static private System.String _data
    static ::StringW _get__data();
    // Set static field: static private System.String _data
    static void _set__data(::StringW value);
    // Get instance field reference: private UnityEngine.UI.Button _getNewDataButton
    [[deprecated]] ::UnityEngine::UI::Button*& dyn__getNewDataButton();
    // Get instance field reference: private UnityEngine.UI.Button _writeDataButton
    [[deprecated]] ::UnityEngine::UI::Button*& dyn__writeDataButton();
    // Get instance field reference: private UnityEngine.UI.Button _deleteDataButton
    [[deprecated]] ::UnityEngine::UI::Button*& dyn__deleteDataButton();
    // Get instance field reference: private TMPro.TextMeshProUGUI _dataText
    [[deprecated]] ::TMPro::TextMeshProUGUI*& dyn__dataText();
    // Get instance field reference: private System.String _sessionId
    [[deprecated]] ::StringW& dyn__sessionId();
    // Get instance field reference: private System.Boolean _alwaysHoldMallets
    [[deprecated]] bool& dyn__alwaysHoldMallets();
    // Get instance field reference: private System.Single _malletAngle
    [[deprecated]] float& dyn__malletAngle();
    // Get instance field reference: private System.Single _malletLength
    [[deprecated]] float& dyn__malletLength();
    // Get instance field reference: private VROSC.CommunitySessionsDataController _communitySessionsDataController
    [[deprecated]] ::VROSC::CommunitySessionsDataController*& dyn__communitySessionsDataController();
    // Get instance field reference: private VROSC.CloudSessionsDataController _cloudSessionsDataController
    [[deprecated]] ::VROSC::CloudSessionsDataController*& dyn__cloudSessionsDataController();
    // Get instance field reference: private VROSC.UserPreferencesDataController _userPreferencesDataController
    [[deprecated]] ::VROSC::UserPreferencesDataController*& dyn__userPreferencesDataController();
    // Get instance field reference: private VROSC.UserFavoritesDataController _userFavoritesDataController
    [[deprecated]] ::VROSC::UserFavoritesDataController*& dyn__userFavoritesDataController();
    // private System.Void Awake()
    // Offset: 0x191B2F4
    void Awake();
    // private System.Void OnDestroy()
    // Offset: 0x191B508
    void OnDestroy();
    // private System.Void Update()
    // Offset: 0x191B644
    void Update();
    // private System.Void OnValidate()
    // Offset: 0x191B6C8
    void OnValidate();
    // private System.Void GetNewDataButtonPressed()
    // Offset: 0x191B790
    void GetNewDataButtonPressed();
    // private System.Void WriteDataButtonPressed()
    // Offset: 0x191B8A4
    void WriteDataButtonPressed();
    // private System.Void DeleteDataButtonPressed()
    // Offset: 0x191BB34
    void DeleteDataButtonPressed();
    // private System.Void LoadSessionsSuccess()
    // Offset: 0x191BCDC
    void LoadSessionsSuccess();
    // private System.Void LoadSessionsFailure(VROSC.Error error)
    // Offset: 0x191BE90
    void LoadSessionsFailure(::VROSC::Error error);
    // private System.Void RemoveSessionSuccess()
    // Offset: 0x191BF4C
    void RemoveSessionSuccess();
    // private System.Void RemoveSessionFailure(VROSC.Error error)
    // Offset: 0x191BFC0
    void RemoveSessionFailure(::VROSC::Error error);
    // private System.Void LoadPreferencesSuccess()
    // Offset: 0x191C0A8
    void LoadPreferencesSuccess();
    // private System.Void LoadPreferencesFailure(VROSC.Error error)
    // Offset: 0x191C128
    void LoadPreferencesFailure(::VROSC::Error error);
    // private System.Void LoadFavoritesSuccess()
    // Offset: 0x191C1E4
    void LoadFavoritesSuccess();
    // private System.Void LoadFavoritesFailure(VROSC.Error error)
    // Offset: 0x191C264
    void LoadFavoritesFailure(::VROSC::Error error);
    // private System.Void SaveSessionsSuccess()
    // Offset: 0x191C320
    void SaveSessionsSuccess();
    // private System.Void SaveSessionsFailure(VROSC.Error error)
    // Offset: 0x191C394
    void SaveSessionsFailure(::VROSC::Error error);
    // private System.Void SaveMalletsPreferencesSuccess()
    // Offset: 0x191C47C
    void SaveMalletsPreferencesSuccess();
    // private System.Void SaveMalletsPreferencesFailure(VROSC.Error error)
    // Offset: 0x191C4F0
    void SaveMalletsPreferencesFailure(::VROSC::Error error);
    // private System.Void SaveFavoritesSuccess()
    // Offset: 0x191C5D8
    void SaveFavoritesSuccess();
    // private System.Void SaveFavoritesFailure(VROSC.Error error)
    // Offset: 0x191C64C
    void SaveFavoritesFailure(::VROSC::Error error);
    // static public System.Void PrintData(System.String data, System.Boolean clear)
    // Offset: 0x191BD50
    static void PrintData(::StringW data, bool clear);
    // public System.Void .ctor()
    // Offset: 0x191C734
    // Implemented from: UnityEngine.MonoBehaviour
    // Base method: System.Void MonoBehaviour::.ctor()
    // Base method: System.Void Behaviour::.ctor()
    // Base method: System.Void Component::.ctor()
    // Base method: System.Void Object::.ctor()
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static UserDataDebugPanel* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::VROSC::FBDebug::UserDataDebugPanel::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<UserDataDebugPanel*, creationType>()));
    }
    // static private System.Void .cctor()
    // Offset: 0x191C73C
    // Implemented from: UnityEngine.Object
    // Base method: System.Void Object::.cctor()
    static void _cctor();
  }; // VROSC.FBDebug.UserDataDebugPanel
  #pragma pack(pop)
  static check_size<sizeof(UserDataDebugPanel), 104 + sizeof(::VROSC::UserFavoritesDataController*)> __VROSC_FBDebug_UserDataDebugPanelSizeCheck;
  static_assert(sizeof(UserDataDebugPanel) == 0x70);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: VROSC::FBDebug::UserDataDebugPanel::Awake
// Il2CppName: Awake
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::FBDebug::UserDataDebugPanel::*)()>(&VROSC::FBDebug::UserDataDebugPanel::Awake)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(VROSC::FBDebug::UserDataDebugPanel*), "Awake", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: VROSC::FBDebug::UserDataDebugPanel::OnDestroy
// Il2CppName: OnDestroy
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::FBDebug::UserDataDebugPanel::*)()>(&VROSC::FBDebug::UserDataDebugPanel::OnDestroy)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(VROSC::FBDebug::UserDataDebugPanel*), "OnDestroy", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: VROSC::FBDebug::UserDataDebugPanel::Update
// Il2CppName: Update
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::FBDebug::UserDataDebugPanel::*)()>(&VROSC::FBDebug::UserDataDebugPanel::Update)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(VROSC::FBDebug::UserDataDebugPanel*), "Update", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: VROSC::FBDebug::UserDataDebugPanel::OnValidate
// Il2CppName: OnValidate
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::FBDebug::UserDataDebugPanel::*)()>(&VROSC::FBDebug::UserDataDebugPanel::OnValidate)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(VROSC::FBDebug::UserDataDebugPanel*), "OnValidate", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: VROSC::FBDebug::UserDataDebugPanel::GetNewDataButtonPressed
// Il2CppName: GetNewDataButtonPressed
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::FBDebug::UserDataDebugPanel::*)()>(&VROSC::FBDebug::UserDataDebugPanel::GetNewDataButtonPressed)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(VROSC::FBDebug::UserDataDebugPanel*), "GetNewDataButtonPressed", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: VROSC::FBDebug::UserDataDebugPanel::WriteDataButtonPressed
// Il2CppName: WriteDataButtonPressed
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::FBDebug::UserDataDebugPanel::*)()>(&VROSC::FBDebug::UserDataDebugPanel::WriteDataButtonPressed)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(VROSC::FBDebug::UserDataDebugPanel*), "WriteDataButtonPressed", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: VROSC::FBDebug::UserDataDebugPanel::DeleteDataButtonPressed
// Il2CppName: DeleteDataButtonPressed
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::FBDebug::UserDataDebugPanel::*)()>(&VROSC::FBDebug::UserDataDebugPanel::DeleteDataButtonPressed)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(VROSC::FBDebug::UserDataDebugPanel*), "DeleteDataButtonPressed", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: VROSC::FBDebug::UserDataDebugPanel::LoadSessionsSuccess
// Il2CppName: LoadSessionsSuccess
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::FBDebug::UserDataDebugPanel::*)()>(&VROSC::FBDebug::UserDataDebugPanel::LoadSessionsSuccess)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(VROSC::FBDebug::UserDataDebugPanel*), "LoadSessionsSuccess", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: VROSC::FBDebug::UserDataDebugPanel::LoadSessionsFailure
// Il2CppName: LoadSessionsFailure
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::FBDebug::UserDataDebugPanel::*)(::VROSC::Error)>(&VROSC::FBDebug::UserDataDebugPanel::LoadSessionsFailure)> {
  static const MethodInfo* get() {
    static auto* error = &::il2cpp_utils::GetClassFromName("VROSC", "Error")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(VROSC::FBDebug::UserDataDebugPanel*), "LoadSessionsFailure", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{error});
  }
};
// Writing MetadataGetter for method: VROSC::FBDebug::UserDataDebugPanel::RemoveSessionSuccess
// Il2CppName: RemoveSessionSuccess
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::FBDebug::UserDataDebugPanel::*)()>(&VROSC::FBDebug::UserDataDebugPanel::RemoveSessionSuccess)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(VROSC::FBDebug::UserDataDebugPanel*), "RemoveSessionSuccess", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: VROSC::FBDebug::UserDataDebugPanel::RemoveSessionFailure
// Il2CppName: RemoveSessionFailure
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::FBDebug::UserDataDebugPanel::*)(::VROSC::Error)>(&VROSC::FBDebug::UserDataDebugPanel::RemoveSessionFailure)> {
  static const MethodInfo* get() {
    static auto* error = &::il2cpp_utils::GetClassFromName("VROSC", "Error")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(VROSC::FBDebug::UserDataDebugPanel*), "RemoveSessionFailure", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{error});
  }
};
// Writing MetadataGetter for method: VROSC::FBDebug::UserDataDebugPanel::LoadPreferencesSuccess
// Il2CppName: LoadPreferencesSuccess
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::FBDebug::UserDataDebugPanel::*)()>(&VROSC::FBDebug::UserDataDebugPanel::LoadPreferencesSuccess)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(VROSC::FBDebug::UserDataDebugPanel*), "LoadPreferencesSuccess", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: VROSC::FBDebug::UserDataDebugPanel::LoadPreferencesFailure
// Il2CppName: LoadPreferencesFailure
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::FBDebug::UserDataDebugPanel::*)(::VROSC::Error)>(&VROSC::FBDebug::UserDataDebugPanel::LoadPreferencesFailure)> {
  static const MethodInfo* get() {
    static auto* error = &::il2cpp_utils::GetClassFromName("VROSC", "Error")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(VROSC::FBDebug::UserDataDebugPanel*), "LoadPreferencesFailure", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{error});
  }
};
// Writing MetadataGetter for method: VROSC::FBDebug::UserDataDebugPanel::LoadFavoritesSuccess
// Il2CppName: LoadFavoritesSuccess
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::FBDebug::UserDataDebugPanel::*)()>(&VROSC::FBDebug::UserDataDebugPanel::LoadFavoritesSuccess)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(VROSC::FBDebug::UserDataDebugPanel*), "LoadFavoritesSuccess", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: VROSC::FBDebug::UserDataDebugPanel::LoadFavoritesFailure
// Il2CppName: LoadFavoritesFailure
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::FBDebug::UserDataDebugPanel::*)(::VROSC::Error)>(&VROSC::FBDebug::UserDataDebugPanel::LoadFavoritesFailure)> {
  static const MethodInfo* get() {
    static auto* error = &::il2cpp_utils::GetClassFromName("VROSC", "Error")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(VROSC::FBDebug::UserDataDebugPanel*), "LoadFavoritesFailure", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{error});
  }
};
// Writing MetadataGetter for method: VROSC::FBDebug::UserDataDebugPanel::SaveSessionsSuccess
// Il2CppName: SaveSessionsSuccess
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::FBDebug::UserDataDebugPanel::*)()>(&VROSC::FBDebug::UserDataDebugPanel::SaveSessionsSuccess)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(VROSC::FBDebug::UserDataDebugPanel*), "SaveSessionsSuccess", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: VROSC::FBDebug::UserDataDebugPanel::SaveSessionsFailure
// Il2CppName: SaveSessionsFailure
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::FBDebug::UserDataDebugPanel::*)(::VROSC::Error)>(&VROSC::FBDebug::UserDataDebugPanel::SaveSessionsFailure)> {
  static const MethodInfo* get() {
    static auto* error = &::il2cpp_utils::GetClassFromName("VROSC", "Error")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(VROSC::FBDebug::UserDataDebugPanel*), "SaveSessionsFailure", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{error});
  }
};
// Writing MetadataGetter for method: VROSC::FBDebug::UserDataDebugPanel::SaveMalletsPreferencesSuccess
// Il2CppName: SaveMalletsPreferencesSuccess
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::FBDebug::UserDataDebugPanel::*)()>(&VROSC::FBDebug::UserDataDebugPanel::SaveMalletsPreferencesSuccess)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(VROSC::FBDebug::UserDataDebugPanel*), "SaveMalletsPreferencesSuccess", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: VROSC::FBDebug::UserDataDebugPanel::SaveMalletsPreferencesFailure
// Il2CppName: SaveMalletsPreferencesFailure
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::FBDebug::UserDataDebugPanel::*)(::VROSC::Error)>(&VROSC::FBDebug::UserDataDebugPanel::SaveMalletsPreferencesFailure)> {
  static const MethodInfo* get() {
    static auto* error = &::il2cpp_utils::GetClassFromName("VROSC", "Error")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(VROSC::FBDebug::UserDataDebugPanel*), "SaveMalletsPreferencesFailure", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{error});
  }
};
// Writing MetadataGetter for method: VROSC::FBDebug::UserDataDebugPanel::SaveFavoritesSuccess
// Il2CppName: SaveFavoritesSuccess
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::FBDebug::UserDataDebugPanel::*)()>(&VROSC::FBDebug::UserDataDebugPanel::SaveFavoritesSuccess)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(VROSC::FBDebug::UserDataDebugPanel*), "SaveFavoritesSuccess", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: VROSC::FBDebug::UserDataDebugPanel::SaveFavoritesFailure
// Il2CppName: SaveFavoritesFailure
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VROSC::FBDebug::UserDataDebugPanel::*)(::VROSC::Error)>(&VROSC::FBDebug::UserDataDebugPanel::SaveFavoritesFailure)> {
  static const MethodInfo* get() {
    static auto* error = &::il2cpp_utils::GetClassFromName("VROSC", "Error")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(VROSC::FBDebug::UserDataDebugPanel*), "SaveFavoritesFailure", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{error});
  }
};
// Writing MetadataGetter for method: VROSC::FBDebug::UserDataDebugPanel::PrintData
// Il2CppName: PrintData
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (*)(::StringW, bool)>(&VROSC::FBDebug::UserDataDebugPanel::PrintData)> {
  static const MethodInfo* get() {
    static auto* data = &::il2cpp_utils::GetClassFromName("System", "String")->byval_arg;
    static auto* clear = &::il2cpp_utils::GetClassFromName("System", "Boolean")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(VROSC::FBDebug::UserDataDebugPanel*), "PrintData", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{data, clear});
  }
};
// Writing MetadataGetter for method: VROSC::FBDebug::UserDataDebugPanel::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
// Writing MetadataGetter for method: VROSC::FBDebug::UserDataDebugPanel::_cctor
// Il2CppName: .cctor
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (*)()>(&VROSC::FBDebug::UserDataDebugPanel::_cctor)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(VROSC::FBDebug::UserDataDebugPanel*), ".cctor", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
