// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Type namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GUISettings
  class GUISettings;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::GUISettings);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::GUISettings*, "UnityEngine", "GUISettings");
// Type namespace: UnityEngine
namespace UnityEngine {
  // Size: 0x38
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.GUISettings
  // [TokenAttribute] Offset: FFFFFFFF
  // [NativeHeaderAttribute] Offset: 6BEFBC
  class GUISettings : public ::Il2CppObject {
    public:
    public:
    // private System.Boolean m_DoubleClickSelectsWord
    // Size: 0x1
    // Offset: 0x10
    bool m_DoubleClickSelectsWord;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_TripleClickSelectsLine
    // Size: 0x1
    // Offset: 0x11
    bool m_TripleClickSelectsLine;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_TripleClickSelectsLine and: m_CursorColor
    char __padding1[0x2] = {};
    // private UnityEngine.Color m_CursorColor
    // Size: 0x10
    // Offset: 0x14
    ::UnityEngine::Color m_CursorColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private System.Single m_CursorFlashSpeed
    // Size: 0x4
    // Offset: 0x24
    float m_CursorFlashSpeed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Color m_SelectionColor
    // Size: 0x10
    // Offset: 0x28
    ::UnityEngine::Color m_SelectionColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    public:
    // Get instance field reference: private System.Boolean m_DoubleClickSelectsWord
    [[deprecated]] bool& dyn_m_DoubleClickSelectsWord();
    // Get instance field reference: private System.Boolean m_TripleClickSelectsLine
    [[deprecated]] bool& dyn_m_TripleClickSelectsLine();
    // Get instance field reference: private UnityEngine.Color m_CursorColor
    [[deprecated]] ::UnityEngine::Color& dyn_m_CursorColor();
    // Get instance field reference: private System.Single m_CursorFlashSpeed
    [[deprecated]] float& dyn_m_CursorFlashSpeed();
    // Get instance field reference: private UnityEngine.Color m_SelectionColor
    [[deprecated]] ::UnityEngine::Color& dyn_m_SelectionColor();
    // public System.Void .ctor()
    // Offset: 0x187E090
    // Implemented from: System.Object
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static GUISettings* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::UnityEngine::GUISettings::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<GUISettings*, creationType>()));
    }
  }; // UnityEngine.GUISettings
  #pragma pack(pop)
  static check_size<sizeof(GUISettings), 40 + sizeof(::UnityEngine::Color)> __UnityEngine_GUISettingsSizeCheck;
  static_assert(sizeof(GUISettings) == 0x38);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: UnityEngine::GUISettings::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
