// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: MalbersAnimations.Readme
#include "MalbersAnimations/Readme.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MalbersAnimations::Readme::Section);
DEFINE_IL2CPP_ARG_TYPE(::MalbersAnimations::Readme::Section*, "MalbersAnimations", "Readme/Section");
// Type namespace: MalbersAnimations
namespace MalbersAnimations {
  // Size: 0x30
  #pragma pack(push, 1)
  // Autogenerated type: MalbersAnimations.Readme/MalbersAnimations.Section
  // [TokenAttribute] Offset: FFFFFFFF
  class Readme::Section : public ::Il2CppObject {
    public:
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // public System.String heading
    // Size: 0x8
    // Offset: 0x10
    ::StringW heading;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String text
    // Size: 0x8
    // Offset: 0x18
    ::StringW text;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String linkText
    // Size: 0x8
    // Offset: 0x20
    ::StringW linkText;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String url
    // Size: 0x8
    // Offset: 0x28
    ::StringW url;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    public:
    // Get instance field reference: public System.String heading
    ::StringW& dyn_heading();
    // Get instance field reference: public System.String text
    ::StringW& dyn_text();
    // Get instance field reference: public System.String linkText
    ::StringW& dyn_linkText();
    // Get instance field reference: public System.String url
    ::StringW& dyn_url();
    // public System.Void .ctor()
    // Offset: 0x1344F3C
    // Implemented from: System.Object
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static Readme::Section* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::MalbersAnimations::Readme::Section::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<Readme::Section*, creationType>()));
    }
  }; // MalbersAnimations.Readme/MalbersAnimations.Section
  #pragma pack(pop)
  static check_size<sizeof(Readme::Section), 40 + sizeof(::StringW)> __MalbersAnimations_Readme_SectionSizeCheck;
  static_assert(sizeof(Readme::Section) == 0x30);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: MalbersAnimations::Readme::Section::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
