// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Facebook.WitAi.VoiceService
#include "Facebook/WitAi/VoiceService.hpp"
// Including type: Facebook.WitAi.IWitRuntimeConfigProvider
#include "Facebook/WitAi/IWitRuntimeConfigProvider.hpp"
// Including type: Facebook.WitAi.Data.RingBuffer`1
#include "Facebook/WitAi/Data/RingBuffer_1.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Facebook::WitAi
namespace Facebook::WitAi {
  // Forward declaring type: WitRequest
  class WitRequest;
}
// Forward declaring namespace: Facebook::WitAi::Configuration
namespace Facebook::WitAi::Configuration {
  // Forward declaring type: WitRuntimeConfiguration
  class WitRuntimeConfiguration;
  // Forward declaring type: WitRequestOptions
  class WitRequestOptions;
}
// Forward declaring namespace: Facebook::WitAi::Interfaces
namespace Facebook::WitAi::Interfaces {
  // Forward declaring type: IAudioInputSource
  class IAudioInputSource;
  // Forward declaring type: ITranscriptionProvider
  class ITranscriptionProvider;
}
// Forward declaring namespace: System::Collections::Concurrent
namespace System::Collections::Concurrent {
  // Forward declaring type: ConcurrentQueue`1<T>
  template<typename T>
  class ConcurrentQueue_1;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action
  class Action;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Coroutine
  class Coroutine;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Completed forward declares
// Type namespace: Facebook.WitAi
namespace Facebook::WitAi {
  // Forward declaring type: Wit
  class Wit;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Facebook::WitAi::Wit);
DEFINE_IL2CPP_ARG_TYPE(::Facebook::WitAi::Wit*, "Facebook.WitAi", "Wit");
// Type namespace: Facebook.WitAi
namespace Facebook::WitAi {
  // Size: 0xA0
  #pragma pack(push, 1)
  // Autogenerated type: Facebook.WitAi.Wit
  // [TokenAttribute] Offset: FFFFFFFF
  class Wit : public ::Facebook::WitAi::VoiceService/*, public ::Facebook::WitAi::IWitRuntimeConfigProvider*/ {
    public:
    // Nested type: ::Facebook::WitAi::Wit::$DeactivateDueToTimeLimit$d__43
    class $DeactivateDueToTimeLimit$d__43;
    // Nested type: ::Facebook::WitAi::Wit::$$c__DisplayClass47_0
    class $$c__DisplayClass47_0;
    // Nested type: ::Facebook::WitAi::Wit::$$c__DisplayClass47_1
    class $$c__DisplayClass47_1;
    // Nested type: ::Facebook::WitAi::Wit::$$c__DisplayClass55_0
    class $$c__DisplayClass55_0;
    public:
    // [HeaderAttribute] Offset: 0x6C756C
    // [FormerlySerializedAsAttribute] Offset: 0x6C756C
    // [TooltipAttribute] Offset: 0x6C756C
    // private Facebook.WitAi.Configuration.WitRuntimeConfiguration runtimeConfiguration
    // Size: 0x8
    // Offset: 0x20
    ::Facebook::WitAi::Configuration::WitRuntimeConfiguration* runtimeConfiguration;
    // Field size check
    static_assert(sizeof(::Facebook::WitAi::Configuration::WitRuntimeConfiguration*) == 0x8);
    // private System.Single activationTime
    // Size: 0x4
    // Offset: 0x28
    float activationTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: activationTime and: micInput
    char __padding1[0x4] = {};
    // private Facebook.WitAi.Interfaces.IAudioInputSource micInput
    // Size: 0x8
    // Offset: 0x30
    ::Facebook::WitAi::Interfaces::IAudioInputSource* micInput;
    // Field size check
    static_assert(sizeof(::Facebook::WitAi::Interfaces::IAudioInputSource*) == 0x8);
    // private Facebook.WitAi.Configuration.WitRequestOptions currentRequestOptions
    // Size: 0x8
    // Offset: 0x38
    ::Facebook::WitAi::Configuration::WitRequestOptions* currentRequestOptions;
    // Field size check
    static_assert(sizeof(::Facebook::WitAi::Configuration::WitRequestOptions*) == 0x8);
    // private System.Single lastMinVolumeLevelTime
    // Size: 0x4
    // Offset: 0x40
    float lastMinVolumeLevelTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: lastMinVolumeLevelTime and: activeRequest
    char __padding4[0x4] = {};
    // private Facebook.WitAi.WitRequest activeRequest
    // Size: 0x8
    // Offset: 0x48
    ::Facebook::WitAi::WitRequest* activeRequest;
    // Field size check
    static_assert(sizeof(::Facebook::WitAi::WitRequest*) == 0x8);
    // private System.Collections.Concurrent.ConcurrentQueue`1<System.Action> updateQueue
    // Size: 0x8
    // Offset: 0x50
    ::System::Collections::Concurrent::ConcurrentQueue_1<::System::Action*>* updateQueue;
    // Field size check
    static_assert(sizeof(::System::Collections::Concurrent::ConcurrentQueue_1<::System::Action*>*) == 0x8);
    // private System.Boolean isSoundWakeActive
    // Size: 0x1
    // Offset: 0x58
    bool isSoundWakeActive;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isSoundWakeActive and: micDataBuffer
    char __padding7[0x7] = {};
    // private Facebook.WitAi.Data.RingBuffer`1<System.Byte> micDataBuffer
    // Size: 0x8
    // Offset: 0x60
    ::Facebook::WitAi::Data::RingBuffer_1<uint8_t>* micDataBuffer;
    // Field size check
    static_assert(sizeof(::Facebook::WitAi::Data::RingBuffer_1<uint8_t>*) == 0x8);
    // private Facebook.WitAi.Data.RingBuffer`1/Facebook.WitAi.Data.Marker<System.Byte> lastSampleMarker
    // Size: 0x8
    // Offset: 0x68
    typename ::Facebook::WitAi::Data::RingBuffer_1<uint8_t>::Marker* lastSampleMarker;
    // Field size check
    static_assert(sizeof(typename ::Facebook::WitAi::Data::RingBuffer_1<uint8_t>::Marker*) == 0x8);
    // private System.Byte[] writeBuffer
    // Size: 0x8
    // Offset: 0x70
    ::ArrayW<uint8_t> writeBuffer;
    // Field size check
    static_assert(sizeof(::ArrayW<uint8_t>) == 0x8);
    // private System.Boolean minKeepAliveWasHit
    // Size: 0x1
    // Offset: 0x78
    bool minKeepAliveWasHit;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean isActive
    // Size: 0x1
    // Offset: 0x79
    bool isActive;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isActive and: byteDataBuffer
    char __padding12[0x6] = {};
    // private System.Byte[] byteDataBuffer
    // Size: 0x8
    // Offset: 0x80
    ::ArrayW<uint8_t> byteDataBuffer;
    // Field size check
    static_assert(sizeof(::ArrayW<uint8_t>) == 0x8);
    // private Facebook.WitAi.Interfaces.ITranscriptionProvider activeTranscriptionProvider
    // Size: 0x8
    // Offset: 0x88
    ::Facebook::WitAi::Interfaces::ITranscriptionProvider* activeTranscriptionProvider;
    // Field size check
    static_assert(sizeof(::Facebook::WitAi::Interfaces::ITranscriptionProvider*) == 0x8);
    // private UnityEngine.Coroutine timeLimitCoroutine
    // Size: 0x8
    // Offset: 0x90
    ::UnityEngine::Coroutine* timeLimitCoroutine;
    // Field size check
    static_assert(sizeof(::UnityEngine::Coroutine*) == 0x8);
    // private System.Boolean receivedTranscription
    // Size: 0x1
    // Offset: 0x98
    bool receivedTranscription;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: receivedTranscription and: lastWordTime
    char __padding16[0x3] = {};
    // private System.Single lastWordTime
    // Size: 0x4
    // Offset: 0x9C
    float lastWordTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    public:
    // Creating interface conversion operator: operator ::Facebook::WitAi::IWitRuntimeConfigProvider
    operator ::Facebook::WitAi::IWitRuntimeConfigProvider() noexcept {
      return *reinterpret_cast<::Facebook::WitAi::IWitRuntimeConfigProvider*>(this);
    }
    // Get instance field reference: private Facebook.WitAi.Configuration.WitRuntimeConfiguration runtimeConfiguration
    [[deprecated]] ::Facebook::WitAi::Configuration::WitRuntimeConfiguration*& dyn_runtimeConfiguration();
    // Get instance field reference: private System.Single activationTime
    [[deprecated]] float& dyn_activationTime();
    // Get instance field reference: private Facebook.WitAi.Interfaces.IAudioInputSource micInput
    [[deprecated]] ::Facebook::WitAi::Interfaces::IAudioInputSource*& dyn_micInput();
