// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.Net.WebRequest
#include "System/Net/WebRequest.hpp"
// Including type: System.Net.DecompressionMethods
#include "System/Net/DecompressionMethods.hpp"
// Including type: System.Threading.CancellationToken
#include "System/Threading/CancellationToken.hpp"
// Including type: System.ValueTuple`5
#include "System/ValueTuple_5.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Net
namespace System::Net {
  // Skipping declaration: NtlmAuthState because it is already included!
  // Forward declaring type: HttpContinueDelegate
  class HttpContinueDelegate;
  // Forward declaring type: CookieContainer
  class CookieContainer;
  // Forward declaring type: ICredentials
  class ICredentials;
  // Forward declaring type: WebHeaderCollection
  class WebHeaderCollection;
  // Forward declaring type: IWebProxy

  // Forward declaring type: WebRequestStream
  class WebRequestStream;
  // Forward declaring type: HttpWebResponse
  class HttpWebResponse;
  // Forward declaring type: WebCompletionSource
  class WebCompletionSource;
  // Forward declaring type: WebOperation
  class WebOperation;
  // Forward declaring type: ServerCertValidationCallback
  class ServerCertValidationCallback;
  // Forward declaring type: BufferOffsetSize
  class BufferOffsetSize;
  // Forward declaring type: WebResponseStream
  class WebResponseStream;
  // Forward declaring type: WebException
  class WebException;
  // Forward declaring type: HttpStatusCode
  struct HttpStatusCode;
  // Forward declaring type: WebResponse
  class WebResponse;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Func`2<T, TResult>
  template<typename T, typename TResult>
  class Func_2;
  // Forward declaring type: Uri
  class Uri;
  // Forward declaring type: Version
  class Version;
  // Forward declaring type: Action
  class Action;
  // Forward declaring type: Exception
  class Exception;
  // Forward declaring type: IAsyncResult
  class IAsyncResult;
  // Forward declaring type: ValueTuple`2<T1, T2>
  template<typename T1, typename T2>
  struct ValueTuple_2;
  // Forward declaring type: ValueTuple`4<T1, T2, T3, T4>
  template<typename T1, typename T2, typename T3, typename T4>
  struct ValueTuple_4;
  // Forward declaring type: AsyncCallback
  class AsyncCallback;
}
// Forward declaring namespace: System::Security::Cryptography::X509Certificates
namespace System::Security::Cryptography::X509Certificates {
  // Forward declaring type: X509CertificateCollection
  class X509CertificateCollection;
}
// Forward declaring namespace: Mono::Security::Interface
namespace Mono::Security::Interface {
  // Forward declaring type: MonoTlsProvider
  class MonoTlsProvider;
  // Forward declaring type: MonoTlsSettings
  class MonoTlsSettings;
}
// Forward declaring namespace: System::IO
namespace System::IO {
  // Forward declaring type: Stream
  class Stream;
}
// Forward declaring namespace: System::Threading::Tasks
namespace System::Threading::Tasks {
  // Forward declaring type: Task
  class Task;
  // Forward declaring type: Task`1<TResult>
  template<typename TResult>
  class Task_1;
}
// Forward declaring namespace: System::Runtime::Serialization
namespace System::Runtime::Serialization {
  // Forward declaring type: SerializationInfo
  class SerializationInfo;
}
// Completed forward declares
// Type namespace: System.Net
namespace System::Net {
  // Forward declaring type: HttpWebRequest
  class HttpWebRequest;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::System::Net::HttpWebRequest);
DEFINE_IL2CPP_ARG_TYPE(::System::Net::HttpWebRequest*, "System.Net", "HttpWebRequest");
// Type namespace: System.Net
namespace System::Net {
  // Size: 0x18F
  #pragma pack(push, 1)
  // Autogenerated type: System.Net.HttpWebRequest
  // [TokenAttribute] Offset: FFFFFFFF
  class HttpWebRequest : public ::System::Net::WebRequest {
    public:
    // Nested type: ::System::Net::HttpWebRequest::NtlmAuthState
    struct NtlmAuthState;
    // Nested type: ::System::Net::HttpWebRequest::AuthorizationState
    struct AuthorizationState;
    // Nested type: ::System::Net::HttpWebRequest::$MyGetRequestStreamAsync$d__229
    struct $MyGetRequestStreamAsync$d__229;
    // Nested type: ::System::Net::HttpWebRequest::$$c__234_1<T>
    template<typename T>
    class $$c__234_1;
    // Nested type: ::System::Net::HttpWebRequest::$RunWithTimeout$d__234_1<T>
    template<typename T>
    struct $RunWithTimeout$d__234_1;
    // Nested type: ::System::Net::HttpWebRequest::$MyGetResponseAsync$d__236
    struct $MyGetResponseAsync$d__236;
    // Nested type: ::System::Net::HttpWebRequest::$GetResponseFromData$d__237
    struct $GetResponseFromData$d__237;
    // Nested type: ::System::Net::HttpWebRequest::$$GetRewriteHandler$b__263_0$d
    struct $$GetRewriteHandler$b__263_0$d;
    // Size: 0x14
    #pragma pack(push, 1)
    // Autogenerated type: System.Net.HttpWebRequest/System.Net.NtlmAuthState
    // [TokenAttribute] Offset: FFFFFFFF
    struct NtlmAuthState/*, public ::System::Enum*/ {
      public:
      // Writing base type padding for base size: 0x0 to desired offset: 0x10
      char ___base_padding[0x10] = {};
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x10
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: NtlmAuthState
      constexpr NtlmAuthState(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public System.Net.HttpWebRequest/System.Net.NtlmAuthState None
      static constexpr const int None = 0;
      // Get static field: static public System.Net.HttpWebRequest/System.Net.NtlmAuthState None
      static ::System::Net::HttpWebRequest::NtlmAuthState _get_None();
      // Set static field: static public System.Net.HttpWebRequest/System.Net.NtlmAuthState None
      static void _set_None(::System::Net::HttpWebRequest::NtlmAuthState value);
      // static field const value: static public System.Net.HttpWebRequest/System.Net.NtlmAuthState Challenge
      static constexpr const int Challenge = 1;
      // Get static field: static public System.Net.HttpWebRequest/System.Net.NtlmAuthState Challenge
      static ::System::Net::HttpWebRequest::NtlmAuthState _get_Challenge();
      // Set static field: static public System.Net.HttpWebRequest/System.Net.NtlmAuthState Challenge
      static void _set_Challenge(::System::Net::HttpWebRequest::NtlmAuthState value);
      // static field const value: static public System.Net.HttpWebRequest/System.Net.NtlmAuthState Response
      static constexpr const int Response = 2;
      // Get static field: static public System.Net.HttpWebRequest/System.Net.NtlmAuthState Response
      static ::System::Net::HttpWebRequest::NtlmAuthState _get_Response();
      // Set static field: static public System.Net.HttpWebRequest/System.Net.NtlmAuthState Response
      static void _set_Response(::System::Net::HttpWebRequest::NtlmAuthState value);
      // Get instance field reference: public System.Int32 value__
      int& dyn_value__();
    }; // System.Net.HttpWebRequest/System.Net.NtlmAuthState
    #pragma pack(pop)
    static check_size<sizeof(HttpWebRequest::NtlmAuthState), 16 + sizeof(int)> __System_Net_HttpWebRequest_NtlmAuthStateSizeCheck;
    static_assert(sizeof(HttpWebRequest::NtlmAuthState) == 0x14);
    // Size: 0x20
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: System.Net.HttpWebRequest/System.Net.AuthorizationState
    // [TokenAttribute] Offset: FFFFFFFF
    struct AuthorizationState/*, public ::System::ValueType*/ {
      public:
      public:
      // private readonly System.Net.HttpWebRequest request
      // Size: 0x8
      // Offset: 0x0
      ::System::Net::HttpWebRequest* request;
      // Field size check
      static_assert(sizeof(::System::Net::HttpWebRequest*) == 0x8);
      // private readonly System.Boolean isProxy
      // Size: 0x1
      // Offset: 0x8
      bool isProxy;
      // Field size check
      static_assert(sizeof(bool) == 0x1);
      // private System.Boolean isCompleted
      // Size: 0x1
      // Offset: 0x9
      bool isCompleted;
      // Field size check
      static_assert(sizeof(bool) == 0x1);
      // Padding between fields: isCompleted and: ntlm_auth_state
      char __padding2[0x2] = {};
      // private System.Net.HttpWebRequest/System.Net.NtlmAuthState ntlm_auth_state
      // Size: 0x14
      // Offset: 0xC
      ::System::Net::HttpWebRequest::NtlmAuthState ntlm_auth_state;
      // Field size check
      static_assert(sizeof(::System::Net::HttpWebRequest::NtlmAuthState) == 0x14);
      public:
      // Creating value type constructor for type: AuthorizationState
      constexpr AuthorizationState(::System::Net::HttpWebRequest* request_ = {}, bool isProxy_ = {}, bool isCompleted_ = {}, ::System::Net::HttpWebRequest::NtlmAuthState ntlm_auth_state_ = {}) noexcept : request{request_}, isProxy{isProxy_}, isCompleted{isCompleted_}, ntlm_auth_state{ntlm_auth_state_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: private readonly System.Net.HttpWebRequest request
      ::System::Net::HttpWebRequest*& dyn_request();
      // Get instance field reference: private readonly System.Boolean isProxy
      bool& dyn_isProxy();
      // Get instance field reference: private System.Boolean isCompleted
      bool& dyn_isCompleted();
      // Get instance field reference: private System.Net.HttpWebRequest/System.Net.NtlmAuthState ntlm_auth_state
      ::System::Net::HttpWebRequest::NtlmAuthState& dyn_ntlm_auth_state();
      // public System.Boolean get_IsCompleted()
      // Offset: 0x8DDA08
      bool get_IsCompleted();
      // public System.Net.HttpWebRequest/System.Net.NtlmAuthState get_NtlmAuthState()
      // Offset: 0x8DDA10
      ::System::Net::HttpWebRequest::NtlmAuthState get_NtlmAuthState();
      // public System.Boolean get_IsNtlmAuthenticated()
      // Offset: 0x8DC390
      bool get_IsNtlmAuthenticated();
      // public System.Void .ctor(System.Net.HttpWebRequest request, System.Boolean isProxy)
      // Offset: 0x8DDA18
      AuthorizationState(::System::Net::HttpWebRequest* request, bool isProxy);
      // public System.Boolean CheckAuthorization(System.Net.WebResponse response, System.Net.HttpStatusCode code)
      // Offset: 0x8DDA30
      bool CheckAuthorization(::System::Net::WebResponse* response, ::System::Net::HttpStatusCode code);
      // public System.Void Reset()
      // Offset: 0x8DDD74
      void Reset();
      // public override System.String ToString()
      // Offset: 0x8DDDFC
      // Implemented from: System.ValueType
      // Base method: System.String ValueType::ToString()
      ::StringW ToString();
    }; // System.Net.HttpWebRequest/System.Net.AuthorizationState
    #pragma pack(pop)
    static check_size<sizeof(HttpWebRequest::AuthorizationState), 12 + sizeof(::System::Net::HttpWebRequest::NtlmAuthState)> __System_Net_HttpWebRequest_AuthorizationStateSizeCheck;
    static_assert(sizeof(HttpWebRequest::AuthorizationState) == 0x20);
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // private System.Uri requestUri
    // Size: 0x8
    // Offset: 0x38
    ::System::Uri* requestUri;
    // Field size check
    static_assert(sizeof(::System::Uri*) == 0x8);
    // private System.Uri actualUri
    // Size: 0x8
    // Offset: 0x40
    ::System::Uri* actualUri;
    // Field size check
    static_assert(sizeof(::System::Uri*) == 0x8);
    // private System.Boolean hostChanged
    // Size: 0x1
    // Offset: 0x48
    bool hostChanged;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean allowAutoRedirect
    // Size: 0x1
    // Offset: 0x49
    bool allowAutoRedirect;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean allowBuffering
    // Size: 0x1
    // Offset: 0x4A
    bool allowBuffering;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: allowBuffering and: certificates
    char __padding4[0x5] = {};
    // private System.Security.Cryptography.X509Certificates.X509CertificateCollection certificates
    // Size: 0x8
    // Offset: 0x50
    ::System::Security::Cryptography::X509Certificates::X509CertificateCollection* certificates;
    // Field size check
    static_assert(sizeof(::System::Security::Cryptography::X509Certificates::X509CertificateCollection*) == 0x8);
    // private System.String connectionGroup
    // Size: 0x8
    // Offset: 0x58
    ::StringW connectionGroup;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Boolean haveContentLength
    // Size: 0x1
    // Offset: 0x60
    bool haveContentLength;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: haveContentLength and: contentLength
    char __padding7[0x7] = {};
    // private System.Int64 contentLength
    // Size: 0x8
    // Offset: 0x68
    int64_t contentLength;
    // Field size check
    static_assert(sizeof(int64_t) == 0x8);
    // private System.Net.HttpContinueDelegate continueDelegate
    // Size: 0x8
    // Offset: 0x70
    ::System::Net::HttpContinueDelegate* continueDelegate;
    // Field size check
    static_assert(sizeof(::System::Net::HttpContinueDelegate*) == 0x8);
    // private System.Net.CookieContainer cookieContainer
    // Size: 0x8
    // Offset: 0x78
    ::System::Net::CookieContainer* cookieContainer;
    // Field size check
    static_assert(sizeof(::System::Net::CookieContainer*) == 0x8);
    // private System.Net.ICredentials credentials
    // Size: 0x8
    // Offset: 0x80
    ::System::Net::ICredentials* credentials;
    // Field size check
    static_assert(sizeof(::System::Net::ICredentials*) == 0x8);
    // private System.Boolean haveResponse
    // Size: 0x1
    // Offset: 0x88
    bool haveResponse;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean requestSent
    // Size: 0x1
    // Offset: 0x89
    bool requestSent;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: requestSent and: webHeaders
    char __padding13[0x6] = {};
    // private System.Net.WebHeaderCollection webHeaders
    // Size: 0x8
    // Offset: 0x90
    ::System::Net::WebHeaderCollection* webHeaders;
    // Field size check
    static_assert(sizeof(::System::Net::WebHeaderCollection*) == 0x8);
    // private System.Boolean keepAlive
    // Size: 0x1
    // Offset: 0x98
    bool keepAlive;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: keepAlive and: maxAutoRedirect
    char __padding15[0x3] = {};
    // private System.Int32 maxAutoRedirect
    // Size: 0x4
    // Offset: 0x9C
    int maxAutoRedirect;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.String mediaType
    // Size: 0x8
    // Offset: 0xA0
    ::StringW mediaType;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String method
    // Size: 0x8
    // Offset: 0xA8
    ::StringW method;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String initialMethod
    // Size: 0x8
    // Offset: 0xB0
    ::StringW initialMethod;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Boolean pipelined
    // Size: 0x1
    // Offset: 0xB8
    bool pipelined;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean preAuthenticate
    // Size: 0x1
    // Offset: 0xB9
    bool preAuthenticate;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean usedPreAuth
    // Size: 0x1
    // Offset: 0xBA
    bool usedPreAuth;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: usedPreAuth and: version
    char __padding22[0x5] = {};
    // private System.Version version
    // Size: 0x8
    // Offset: 0xC0
    ::System::Version* version;
    // Field size check
    static_assert(sizeof(::System::Version*) == 0x8);
    // private System.Boolean force_version
    // Size: 0x1
    // Offset: 0xC8
    bool force_version;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: force_version and: actualVersion
    char __padding24[0x7] = {};
    // private System.Version actualVersion
    // Size: 0x8
    // Offset: 0xD0
    ::System::Version* actualVersion;
    // Field size check
    static_assert(sizeof(::System::Version*) == 0x8);
    // private System.Net.IWebProxy proxy
    // Size: 0x8
    // Offset: 0xD8
    ::System::Net::IWebProxy* proxy;
    // Field size check
    static_assert(sizeof(::System::Net::IWebProxy*) == 0x8);
    // private System.Boolean sendChunked
    // Size: 0x1
    // Offset: 0xE0
    bool sendChunked;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: sendChunked and: servicePoint
    char __padding27[0x7] = {};
    // private System.Net.ServicePoint servicePoint
    // Size: 0x8
    // Offset: 0xE8
    ::System::Net::ServicePoint* servicePoint;
    // Field size check
    static_assert(sizeof(::System::Net::ServicePoint*) == 0x8);
    // private System.Int32 timeout
    // Size: 0x4
    // Offset: 0xF0
    int timeout;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: timeout and: writeStream
    char __padding29[0x4] = {};
    // private System.Net.WebRequestStream writeStream
    // Size: 0x8
    // Offset: 0xF8
    ::System::Net::WebRequestStream* writeStream;
    // Field size check
    static_assert(sizeof(::System::Net::WebRequestStream*) == 0x8);
    // private System.Net.HttpWebResponse webResponse
    // Size: 0x8
    // Offset: 0x100
    ::System::Net::HttpWebResponse* webResponse;
    // Field size check
    static_assert(sizeof(::System::Net::HttpWebResponse*) == 0x8);
    // private System.Net.WebCompletionSource responseTask
    // Size: 0x8
    // Offset: 0x108
    ::System::Net::WebCompletionSource* responseTask;
    // Field size check
    static_assert(sizeof(::System::Net::WebCompletionSource*) == 0x8);
    // private System.Net.WebOperation currentOperation
    // Size: 0x8
    // Offset: 0x110
    ::System::Net::WebOperation* currentOperation;
    // Field size check
    static_assert(sizeof(::System::Net::WebOperation*) == 0x8);
    // private System.Int32 aborted
    // Size: 0x4
    // Offset: 0x118
    int aborted;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean gotRequestStream
    // Size: 0x1
    // Offset: 0x11C
    bool gotRequestStream;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: gotRequestStream and: redirects
    char __padding35[0x3] = {};
    // private System.Int32 redirects
    // Size: 0x4
    // Offset: 0x120
    int redirects;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean expectContinue
    // Size: 0x1
    // Offset: 0x124
    bool expectContinue;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean getResponseCalled
    // Size: 0x1
    // Offset: 0x125
    bool getResponseCalled;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: getResponseCalled and: locker
    char __padding38[0x2] = {};
    // private System.Object locker
    // Size: 0x8
    // Offset: 0x128
    ::Il2CppObject* locker;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // private System.Boolean finished_reading
    // Size: 0x1
    // Offset: 0x130
    bool finished_reading;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: finished_reading and: auto_decomp
    char __padding40[0x3] = {};
    // private System.Net.DecompressionMethods auto_decomp
    // Size: 0x14
    // Offset: 0x134
    ::System::Net::DecompressionMethods auto_decomp;
    // Field size check
    static_assert(sizeof(::System::Net::DecompressionMethods) == 0x14);
    // private System.Int32 maxResponseHeadersLength
    // Size: 0x4
    // Offset: 0x138
    int maxResponseHeadersLength;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 readWriteTimeout
    // Size: 0x4
    // Offset: 0x13C
    int readWriteTimeout;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private Mono.Security.Interface.MonoTlsProvider tlsProvider
    // Size: 0x8
    // Offset: 0x140
    ::Mono::Security::Interface::MonoTlsProvider* tlsProvider;
    // Field size check
    static_assert(sizeof(::Mono::Security::Interface::MonoTlsProvider*) == 0x8);
    // private Mono.Security.Interface.MonoTlsSettings tlsSettings
    // Size: 0x8
    // Offset: 0x148
    ::Mono::Security::Interface::MonoTlsSettings* tlsSettings;
    // Field size check
    static_assert(sizeof(::Mono::Security::Interface::MonoTlsSettings*) == 0x8);
    // private System.Net.ServerCertValidationCallback certValidationCallback
    // Size: 0x8
    // Offset: 0x150
    ::System::Net::ServerCertValidationCallback* certValidationCallback;
    // Field size check
    static_assert(sizeof(::System::Net::ServerCertValidationCallback*) == 0x8);
    // private System.Net.HttpWebRequest/System.Net.AuthorizationState auth_state
    // Size: 0x20
    // Offset: 0x158
    ::System::Net::HttpWebRequest::AuthorizationState auth_state;
    // Field size check
    static_assert(sizeof(::System::Net::HttpWebRequest::AuthorizationState) == 0x20);
    // private System.Net.HttpWebRequest/System.Net.AuthorizationState proxy_auth_state
    // Size: 0x20
    // Offset: 0x168
    ::System::Net::HttpWebRequest::AuthorizationState proxy_auth_state;
    // Field size check
    static_assert(sizeof(::System::Net::HttpWebRequest::AuthorizationState) == 0x20);
    // private System.String host
    // Size: 0x8
    // Offset: 0x178
    ::StringW host;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // System.Func`2<System.IO.Stream,System.Threading.Tasks.Task> ResendContentFactory
    // Size: 0x8
    // Offset: 0x180
    ::System::Func_2<::System::IO::Stream*, ::System::Threading::Tasks::Task*>* ResendContentFactory;
    // Field size check
    static_assert(sizeof(::System::Func_2<::System::IO::Stream*, ::System::Threading::Tasks::Task*>*) == 0x8);
    // readonly System.Int32 ID
    // Size: 0x4
    // Offset: 0x188
    int _ID;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean <ThrowOnError>k__BackingField
    // Size: 0x1
    // Offset: 0x18C
    bool ThrowOnError;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean unsafe_auth_blah
    // Size: 0x1
    // Offset: 0x18D
    bool unsafe_auth_blah;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean <ReuseConnection>k__BackingField
    // Size: 0x1
    // Offset: 0x18E
    bool ReuseConnection;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Get static field: static private System.Int32 defaultMaxResponseHeadersLength
    static int _get_defaultMaxResponseHeadersLength();
    // Set static field: static private System.Int32 defaultMaxResponseHeadersLength
    static void _set_defaultMaxResponseHeadersLength(int value);
    // Get instance field reference: private System.Uri requestUri
    ::System::Uri*& dyn_requestUri();
    // Get instance field reference: private System.Uri actualUri
    ::System::Uri*& dyn_actualUri();
    // Get instance field reference: private System.Boolean hostChanged
    bool& dyn_hostChanged();
    // Get instance field reference: private System.Boolean allowAutoRedirect
    bool& dyn_allowAutoRedirect();
    // Get instance field reference: private System.Boolean allowBuffering
    bool& dyn_allowBuffering();
