// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.Net.WebConnectionStream
#include "System/Net/WebConnectionStream.hpp"
// Including type: System.Net.HttpStatusCode
#include "System/Net/HttpStatusCode.hpp"
// Including type: System.ValueTuple`2
#include "System/ValueTuple_2.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Net
namespace System::Net {
  // Forward declaring type: BufferOffsetSize
  class BufferOffsetSize;
  // Forward declaring type: WebCompletionSource
  class WebCompletionSource;
  // Forward declaring type: WebRequestStream
  class WebRequestStream;
  // Forward declaring type: WebHeaderCollection
  class WebHeaderCollection;
  // Forward declaring type: MonoChunkStream
  class MonoChunkStream;
  // Forward declaring type: WebException
  class WebException;
  // Forward declaring type: WebExceptionStatus
  struct WebExceptionStatus;
  // Forward declaring type: ReadState
  struct ReadState;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Version
  class Version;
  // Forward declaring type: Exception
  class Exception;
}
// Forward declaring namespace: System::Threading::Tasks
namespace System::Threading::Tasks {
  // Forward declaring type: Task`1<TResult>
  template<typename TResult>
  class Task_1;
  // Forward declaring type: Task
  class Task;
}
// Forward declaring namespace: System::Threading
namespace System::Threading {
  // Forward declaring type: CancellationToken
  struct CancellationToken;
}
// Completed forward declares
// Type namespace: System.Net
namespace System::Net {
  // Forward declaring type: WebResponseStream
  class WebResponseStream;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::System::Net::WebResponseStream);
DEFINE_IL2CPP_ARG_TYPE(::System::Net::WebResponseStream*, "System.Net", "WebResponseStream");
// Type namespace: System.Net
namespace System::Net {
  // Size: 0xE8
  #pragma pack(push, 1)
  // Autogenerated type: System.Net.WebResponseStream
  // [TokenAttribute] Offset: FFFFFFFF
  class WebResponseStream : public ::System::Net::WebConnectionStream {
    public:
    // Nested type: ::System::Net::WebResponseStream::$$c__DisplayClass48_0
    class $$c__DisplayClass48_0;
    // Nested type: ::System::Net::WebResponseStream::$ReadAsync$d__48
    struct $ReadAsync$d__48;
    // Nested type: ::System::Net::WebResponseStream::$ProcessRead$d__49
    struct $ProcessRead$d__49;
    // Nested type: ::System::Net::WebResponseStream::$InnerReadAsync$d__50
    struct $InnerReadAsync$d__50;
    // Nested type: ::System::Net::WebResponseStream::$EnsureReadAsync$d__51
    struct $EnsureReadAsync$d__51;
    // Nested type: ::System::Net::WebResponseStream::$Initialize$d__56
    struct $Initialize$d__56;
    // Nested type: ::System::Net::WebResponseStream::$ReadAllAsync$d__57
    struct $ReadAllAsync$d__57;
    // Nested type: ::System::Net::WebResponseStream::$InitReadAsync$d__61
    struct $InitReadAsync$d__61;
    #ifdef USE_CODEGEN_FIELDS
    public:
    #else
    #ifdef CODEGEN_FIELD_ACCESSIBILITY
    CODEGEN_FIELD_ACCESSIBILITY:
    #else
    protected:
    #endif
    #endif
    // private System.Net.BufferOffsetSize readBuffer
    // Size: 0x8
    // Offset: 0x68
    ::System::Net::BufferOffsetSize* readBuffer;
    // Field size check
    static_assert(sizeof(::System::Net::BufferOffsetSize*) == 0x8);
    // private System.Int64 contentLength
    // Size: 0x8
    // Offset: 0x70
    int64_t contentLength;
    // Field size check
    static_assert(sizeof(int64_t) == 0x8);
    // private System.Int64 totalRead
    // Size: 0x8
    // Offset: 0x78
    int64_t totalRead;
    // Field size check
    static_assert(sizeof(int64_t) == 0x8);
    // private System.Boolean nextReadCalled
    // Size: 0x1
    // Offset: 0x80
    bool nextReadCalled;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: nextReadCalled and: stream_length
    char __padding3[0x3] = {};
    // private System.Int32 stream_length
    // Size: 0x4
    // Offset: 0x84
    int stream_length;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Net.WebCompletionSource pendingRead
    // Size: 0x8
    // Offset: 0x88
    ::System::Net::WebCompletionSource* pendingRead;
    // Field size check
    static_assert(sizeof(::System::Net::WebCompletionSource*) == 0x8);
    // private System.Object locker
    // Size: 0x8
    // Offset: 0x90
    ::Il2CppObject* locker;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // private System.Int32 nestedRead
    // Size: 0x4
    // Offset: 0x98
    int nestedRead;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean read_eof
    // Size: 0x1
    // Offset: 0x9C
    bool read_eof;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: read_eof and: RequestStream
    char __padding8[0x3] = {};
    // private readonly System.Net.WebRequestStream <RequestStream>k__BackingField
    // Size: 0x8
    // Offset: 0xA0
    ::System::Net::WebRequestStream* RequestStream;
    // Field size check
    static_assert(sizeof(::System::Net::WebRequestStream*) == 0x8);
    // private System.Net.WebHeaderCollection <Headers>k__BackingField
    // Size: 0x8
    // Offset: 0xA8
    ::System::Net::WebHeaderCollection* Headers;
    // Field size check
    static_assert(sizeof(::System::Net::WebHeaderCollection*) == 0x8);
    // private System.Net.HttpStatusCode <StatusCode>k__BackingField
    // Size: 0x4
    // Offset: 0xB0
    ::System::Net::HttpStatusCode StatusCode;
    // Field size check
    static_assert(sizeof(::System::Net::HttpStatusCode) == 0x4);
    // Padding between fields: StatusCode and: StatusDescription
    char __padding11[0x4] = {};
    // private System.String <StatusDescription>k__BackingField
    // Size: 0x8
    // Offset: 0xB8
    ::StringW StatusDescription;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Version <Version>k__BackingField
    // Size: 0x8
    // Offset: 0xC0
    ::System::Version* Version;
    // Field size check
    static_assert(sizeof(::System::Version*) == 0x8);
    // private System.Boolean <KeepAlive>k__BackingField
    // Size: 0x1
    // Offset: 0xC8
    bool KeepAlive;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: KeepAlive and: ME
    char __padding14[0x7] = {};
    // readonly System.String ME
    // Size: 0x8
    // Offset: 0xD0
    ::StringW ME;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Boolean <ChunkedRead>k__BackingField
    // Size: 0x1
    // Offset: 0xD8
    bool ChunkedRead;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: ChunkedRead and: ChunkStream
    char __padding16[0x7] = {};
    // private System.Net.MonoChunkStream <ChunkStream>k__BackingField
    // Size: 0x8
    // Offset: 0xE0
    ::System::Net::MonoChunkStream* ChunkStream;
    // Field size check
    static_assert(sizeof(::System::Net::MonoChunkStream*) == 0x8);
    public:
    // Get instance field reference: private System.Net.BufferOffsetSize readBuffer
    ::System::Net::BufferOffsetSize*& dyn_readBuffer();
    // Get instance field reference: private System.Int64 contentLength
    int64_t& dyn_contentLength();
    // Get instance field reference: private System.Int64 totalRead
    int64_t& dyn_totalRead();
    // Get instance field reference: private System.Boolean nextReadCalled
    bool& dyn_nextReadCalled();
    // Get instance field reference: private System.Int32 stream_length
    int& dyn_stream_length();
    // Get instance field reference: private System.Net.WebCompletionSource pendingRead
    ::System::Net::WebCompletionSource*& dyn_pendingRead();
    // Get instance field reference: private System.Object locker
    ::Il2CppObject*& dyn_locker();
