// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: Facebook.WitAi.Interfaces.IAudioInputSource
#include "Facebook/WitAi/Interfaces/IAudioInputSource.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Facebook::WitAi::Lib
namespace Facebook::WitAi::Lib {
}
// Forward declaring namespace: Facebook::WitAi::Data
namespace Facebook::WitAi::Data {
  // Forward declaring type: AudioEncoding
  class AudioEncoding;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: AudioClip
  class AudioClip;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action
  class Action;
  // Forward declaring type: Action`3<T1, T2, T3>
  template<typename T1, typename T2, typename T3>
  class Action_3;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Completed forward declares
// Type namespace: Facebook.WitAi.Lib
namespace Facebook::WitAi::Lib {
  // Forward declaring type: Mic
  class Mic;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Facebook::WitAi::Lib::Mic);
DEFINE_IL2CPP_ARG_TYPE(::Facebook::WitAi::Lib::Mic*, "Facebook.WitAi.Lib", "Mic");
// Type namespace: Facebook.WitAi.Lib
namespace Facebook::WitAi::Lib {
  // Size: 0x70
  #pragma pack(push, 1)
  // Autogenerated type: Facebook.WitAi.Lib.Mic
  // [TokenAttribute] Offset: FFFFFFFF
  // [RequireComponent] Offset: 6C7360
  class Mic : public ::UnityEngine::MonoBehaviour/*, public ::Facebook::WitAi::Interfaces::IAudioInputSource*/ {
    public:
    // Nested type: ::Facebook::WitAi::Lib::Mic::$ReadRawAudio$d__55
    class $ReadRawAudio$d__55;
    public:
    // private System.Boolean <IsRecording>k__BackingField
    // Size: 0x1
    // Offset: 0x18
    bool IsRecording;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: IsRecording and: AudioEncoding
    char __padding0[0x7] = {};
    // private readonly Facebook.WitAi.Data.AudioEncoding <AudioEncoding>k__BackingField
    // Size: 0x8
    // Offset: 0x20
    ::Facebook::WitAi::Data::AudioEncoding* AudioEncoding;
    // Field size check
    static_assert(sizeof(::Facebook::WitAi::Data::AudioEncoding*) == 0x8);
    // private System.Single[] <Sample>k__BackingField
    // Size: 0x8
    // Offset: 0x28
    ::ArrayW<float> Sample;
    // Field size check
    static_assert(sizeof(::ArrayW<float>) == 0x8);
    // private System.Int32 <SampleDurationMS>k__BackingField
    // Size: 0x4
    // Offset: 0x30
    int SampleDurationMS;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: SampleDurationMS and: AudioClip
    char __padding3[0x4] = {};
    // private UnityEngine.AudioClip <AudioClip>k__BackingField
    // Size: 0x8
    // Offset: 0x38
    ::UnityEngine::AudioClip* AudioClip;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioClip*) == 0x8);
    // private System.Collections.Generic.List`1<System.String> devices
    // Size: 0x8
    // Offset: 0x40
    ::System::Collections::Generic::List_1<::StringW>* devices;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::StringW>*) == 0x8);
    // private System.Int32 <CurrentDeviceIndex>k__BackingField
    // Size: 0x4
    // Offset: 0x48
    int CurrentDeviceIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 m_SampleCount
    // Size: 0x4
    // Offset: 0x4C
    int m_SampleCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Action OnStartRecording
    // Size: 0x8
    // Offset: 0x50
    ::System::Action* OnStartRecording;
    // Field size check
    static_assert(sizeof(::System::Action*) == 0x8);
    // private System.Action OnStartRecordingFailed
    // Size: 0x8
    // Offset: 0x58
    ::System::Action* OnStartRecordingFailed;
    // Field size check
    static_assert(sizeof(::System::Action*) == 0x8);
    // private System.Action`3<System.Int32,System.Single[],System.Single> OnSampleReady
    // Size: 0x8
    // Offset: 0x60
    ::System::Action_3<int, ::ArrayW<float>, float>* OnSampleReady;
    // Field size check
    static_assert(sizeof(::System::Action_3<int, ::ArrayW<float>, float>*) == 0x8);
    // private System.Action OnStopRecording
    // Size: 0x8
    // Offset: 0x68
    ::System::Action* OnStopRecording;
    // Field size check
    static_assert(sizeof(::System::Action*) == 0x8);
    public:
    // Creating interface conversion operator: operator ::Facebook::WitAi::Interfaces::IAudioInputSource
    operator ::Facebook::WitAi::Interfaces::IAudioInputSource() noexcept {
      return *reinterpret_cast<::Facebook::WitAi::Interfaces::IAudioInputSource*>(this);
    }
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get static field: static private Facebook.WitAi.Lib.Mic m_Instance
    static ::Facebook::WitAi::Lib::Mic* _get_m_Instance();
    // Set static field: static private Facebook.WitAi.Lib.Mic m_Instance
    static void _set_m_Instance(::Facebook::WitAi::Lib::Mic* value);
    // Get instance field reference: private System.Boolean <IsRecording>k__BackingField
    [[deprecated]] bool& dyn_$IsRecording$k__BackingField();
