// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: DG.Tweening.DOTweenModulePhysics
#include "DG/Tweening/DOTweenModulePhysics.hpp"
// Including type: UnityEngine.Vector3
#include "UnityEngine/Vector3.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Rigidbody
  class Rigidbody;
}
// Forward declaring namespace: DG::Tweening
namespace DG::Tweening {
  // Forward declaring type: Sequence
  class Sequence;
  // Forward declaring type: Tween
  class Tween;
}
// Completed forward declares
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::DG::Tweening::DOTweenModulePhysics::$$c__DisplayClass6_0);
DEFINE_IL2CPP_ARG_TYPE(::DG::Tweening::DOTweenModulePhysics::$$c__DisplayClass6_0*, "DG.Tweening", "DOTweenModulePhysics/<>c__DisplayClass6_0");
// Type namespace: DG.Tweening
namespace DG::Tweening {
  // Size: 0x48
  #pragma pack(push, 1)
  // Autogenerated type: DG.Tweening.DOTweenModulePhysics/DG.Tweening.<>c__DisplayClass6_0
  // [TokenAttribute] Offset: FFFFFFFF
  // [CompilerGeneratedAttribute] Offset: FFFFFFFF
  class DOTweenModulePhysics::$$c__DisplayClass6_0 : public ::Il2CppObject {
    public:
    public:
    // public UnityEngine.Rigidbody target
    // Size: 0x8
    // Offset: 0x10
    ::UnityEngine::Rigidbody* target;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rigidbody*) == 0x8);
    // public System.Single startPosY
    // Size: 0x4
    // Offset: 0x18
    float startPosY;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Boolean offsetYSet
    // Size: 0x1
    // Offset: 0x1C
    bool offsetYSet;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: offsetYSet and: offsetY
    char __padding2[0x3] = {};
    // public System.Single offsetY
    // Size: 0x4
    // Offset: 0x20
    float offsetY;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: offsetY and: s
    char __padding3[0x4] = {};
    // public DG.Tweening.Sequence s
    // Size: 0x8
    // Offset: 0x28
    ::DG::Tweening::Sequence* s;
    // Field size check
    static_assert(sizeof(::DG::Tweening::Sequence*) == 0x8);
    // public UnityEngine.Vector3 endValue
    // Size: 0xC
    // Offset: 0x30
    ::UnityEngine::Vector3 endValue;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // Padding between fields: endValue and: yTween
    char __padding5[0x4] = {};
    // public DG.Tweening.Tween yTween
    // Size: 0x8
    // Offset: 0x40
    ::DG::Tweening::Tween* yTween;
    // Field size check
    static_assert(sizeof(::DG::Tweening::Tween*) == 0x8);
    public:
    // Get instance field reference: public UnityEngine.Rigidbody target
    [[deprecated]] ::UnityEngine::Rigidbody*& dyn_target();
    // Get instance field reference: public System.Single startPosY
    [[deprecated]] float& dyn_startPosY();
    // Get instance field reference: public System.Boolean offsetYSet
    [[deprecated]] bool& dyn_offsetYSet();
    // Get instance field reference: public System.Single offsetY
    [[deprecated]] float& dyn_offsetY();
    // Get instance field reference: public DG.Tweening.Sequence s
    [[deprecated]] ::DG::Tweening::Sequence*& dyn_s();
    // Get instance field reference: public UnityEngine.Vector3 endValue
    [[deprecated]] ::UnityEngine::Vector3& dyn_endValue();
    // Get instance field reference: public DG.Tweening.Tween yTween
    [[deprecated]] ::DG::Tweening::Tween*& dyn_yTween();
    // UnityEngine.Vector3 <DOJump>b__0()
    // Offset: 0x17E2C5C
    ::UnityEngine::Vector3 $DOJump$b__0();
    // System.Void <DOJump>b__1()
    // Offset: 0x17E2C78
    void $DOJump$b__1();
    // UnityEngine.Vector3 <DOJump>b__2()
    // Offset: 0x17E2CAC
    ::UnityEngine::Vector3 $DOJump$b__2();
    // UnityEngine.Vector3 <DOJump>b__3()
    // Offset: 0x17E2CC8
    ::UnityEngine::Vector3 $DOJump$b__3();
    // System.Void <DOJump>b__4()
    // Offset: 0x17E2CE4
    void $DOJump$b__4();
    // public System.Void .ctor()
    // Offset: 0x17DB2A4
    // Implemented from: System.Object
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static DOTweenModulePhysics::$$c__DisplayClass6_0* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::DG::Tweening::DOTweenModulePhysics::$$c__DisplayClass6_0::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<DOTweenModulePhysics::$$c__DisplayClass6_0*, creationType>()));
    }
  }; // DG.Tweening.DOTweenModulePhysics/DG.Tweening.<>c__DisplayClass6_0
  #pragma pack(pop)
  static check_size<sizeof(DOTweenModulePhysics::$$c__DisplayClass6_0), 64 + sizeof(::DG::Tweening::Tween*)> __DG_Tweening_DOTweenModulePhysics_$$c__DisplayClass6_0SizeCheck;
  static_assert(sizeof(DOTweenModulePhysics::$$c__DisplayClass6_0) == 0x48);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: DG::Tweening::DOTweenModulePhysics::$$c__DisplayClass6_0::$DOJump$b__0
// Il2CppName: <DOJump>b__0
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::UnityEngine::Vector3 (DG::Tweening::DOTweenModulePhysics::$$c__DisplayClass6_0::*)()>(&DG::Tweening::DOTweenModulePhysics::$$c__DisplayClass6_0::$DOJump$b__0)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(DG::Tweening::DOTweenModulePhysics::$$c__DisplayClass6_0*), "<DOJump>b__0", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: DG::Tweening::DOTweenModulePhysics::$$c__DisplayClass6_0::$DOJump$b__1
// Il2CppName: <DOJump>b__1
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (DG::Tweening::DOTweenModulePhysics::$$c__DisplayClass6_0::*)()>(&DG::Tweening::DOTweenModulePhysics::$$c__DisplayClass6_0::$DOJump$b__1)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(DG::Tweening::DOTweenModulePhysics::$$c__DisplayClass6_0*), "<DOJump>b__1", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: DG::Tweening::DOTweenModulePhysics::$$c__DisplayClass6_0::$DOJump$b__2
// Il2CppName: <DOJump>b__2
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::UnityEngine::Vector3 (DG::Tweening::DOTweenModulePhysics::$$c__DisplayClass6_0::*)()>(&DG::Tweening::DOTweenModulePhysics::$$c__DisplayClass6_0::$DOJump$b__2)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(DG::Tweening::DOTweenModulePhysics::$$c__DisplayClass6_0*), "<DOJump>b__2", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: DG::Tweening::DOTweenModulePhysics::$$c__DisplayClass6_0::$DOJump$b__3
// Il2CppName: <DOJump>b__3
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::UnityEngine::Vector3 (DG::Tweening::DOTweenModulePhysics::$$c__DisplayClass6_0::*)()>(&DG::Tweening::DOTweenModulePhysics::$$c__DisplayClass6_0::$DOJump$b__3)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(DG::Tweening::DOTweenModulePhysics::$$c__DisplayClass6_0*), "<DOJump>b__3", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: DG::Tweening::DOTweenModulePhysics::$$c__DisplayClass6_0::$DOJump$b__4
// Il2CppName: <DOJump>b__4
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (DG::Tweening::DOTweenModulePhysics::$$c__DisplayClass6_0::*)()>(&DG::Tweening::DOTweenModulePhysics::$$c__DisplayClass6_0::$DOJump$b__4)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(DG::Tweening::DOTweenModulePhysics::$$c__DisplayClass6_0*), "<DOJump>b__4", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: DG::Tweening::DOTweenModulePhysics::$$c__DisplayClass6_0::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
