// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: DG.Tweening.Core.ABSSequentiable
#include "DG/Tweening/Core/ABSSequentiable.hpp"
// Including type: DG.Tweening.UpdateType
#include "DG/Tweening/UpdateType.hpp"
// Including type: DG.Tweening.LoopType
#include "DG/Tweening/LoopType.hpp"
// Including type: DG.Tweening.Ease
#include "DG/Tweening/Ease.hpp"
// Including type: DG.Tweening.Core.Enums.SpecialStartupMode
#include "DG/Tweening/Core/Enums/SpecialStartupMode.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: DG::Tweening
namespace DG::Tweening {
  // Forward declaring type: TweenCallback
  class TweenCallback;
  // Forward declaring type: TweenCallback`1<T>
  template<typename T>
  class TweenCallback_1;
  // Forward declaring type: EaseFunction
  class EaseFunction;
  // Forward declaring type: Sequence
  class Sequence;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Type
  class Type;
}
// Forward declaring namespace: DG::Tweening::Core::Enums
namespace DG::Tweening::Core::Enums {
  // Forward declaring type: UpdateMode
  struct UpdateMode;
  // Forward declaring type: UpdateNotice
  struct UpdateNotice;
}
// Completed forward declares
// Type namespace: DG.Tweening
namespace DG::Tweening {
  // Forward declaring type: Tween
  class Tween;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::DG::Tweening::Tween);
DEFINE_IL2CPP_ARG_TYPE(::DG::Tweening::Tween*, "DG.Tweening", "Tween");
// Type namespace: DG.Tweening
namespace DG::Tweening {
  // Size: 0x120
  #pragma pack(push, 1)
  // Autogenerated type: DG.Tweening.Tween
  // [TokenAttribute] Offset: FFFFFFFF
  class Tween : public ::DG::Tweening::Core::ABSSequentiable {
    public:
    public:
    // public System.Single timeScale
    // Size: 0x4
    // Offset: 0x28
    float timeScale;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Boolean isBackwards
    // Size: 0x1
    // Offset: 0x2C
    bool isBackwards;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isBackwards and: id
    char __padding1[0x3] = {};
    // public System.Object id
    // Size: 0x8
    // Offset: 0x30
    ::Il2CppObject* id;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // public System.String stringId
    // Size: 0x8
    // Offset: 0x38
    ::StringW stringId;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.Int32 intId
    // Size: 0x4
    // Offset: 0x40
    int intId;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: intId and: target
    char __padding4[0x4] = {};
    // public System.Object target
    // Size: 0x8
    // Offset: 0x48
    ::Il2CppObject* target;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // DG.Tweening.UpdateType updateType
    // Size: 0x4
    // Offset: 0x50
    ::DG::Tweening::UpdateType updateType;
    // Field size check
    static_assert(sizeof(::DG::Tweening::UpdateType) == 0x4);
    // System.Boolean isIndependentUpdate
    // Size: 0x1
    // Offset: 0x54
    bool isIndependentUpdate;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isIndependentUpdate and: onPlay
    char __padding7[0x3] = {};
    // public DG.Tweening.TweenCallback onPlay
    // Size: 0x8
    // Offset: 0x58
    ::DG::Tweening::TweenCallback* onPlay;
    // Field size check
    static_assert(sizeof(::DG::Tweening::TweenCallback*) == 0x8);
    // public DG.Tweening.TweenCallback onPause
    // Size: 0x8
    // Offset: 0x60
    ::DG::Tweening::TweenCallback* onPause;
    // Field size check
    static_assert(sizeof(::DG::Tweening::TweenCallback*) == 0x8);
    // public DG.Tweening.TweenCallback onRewind
    // Size: 0x8
    // Offset: 0x68
    ::DG::Tweening::TweenCallback* onRewind;
    // Field size check
    static_assert(sizeof(::DG::Tweening::TweenCallback*) == 0x8);
    // public DG.Tweening.TweenCallback onUpdate
    // Size: 0x8
    // Offset: 0x70
    ::DG::Tweening::TweenCallback* onUpdate;
    // Field size check
    static_assert(sizeof(::DG::Tweening::TweenCallback*) == 0x8);
    // public DG.Tweening.TweenCallback onStepComplete
    // Size: 0x8
    // Offset: 0x78
    ::DG::Tweening::TweenCallback* onStepComplete;
    // Field size check
    static_assert(sizeof(::DG::Tweening::TweenCallback*) == 0x8);
    // public DG.Tweening.TweenCallback onComplete
    // Size: 0x8
    // Offset: 0x80
    ::DG::Tweening::TweenCallback* onComplete;
    // Field size check
    static_assert(sizeof(::DG::Tweening::TweenCallback*) == 0x8);
    // public DG.Tweening.TweenCallback onKill
    // Size: 0x8
    // Offset: 0x88
    ::DG::Tweening::TweenCallback* onKill;
    // Field size check
    static_assert(sizeof(::DG::Tweening::TweenCallback*) == 0x8);
    // public DG.Tweening.TweenCallback`1<System.Int32> onWaypointChange
    // Size: 0x8
    // Offset: 0x90
    ::DG::Tweening::TweenCallback_1<int>* onWaypointChange;
    // Field size check
    static_assert(sizeof(::DG::Tweening::TweenCallback_1<int>*) == 0x8);
    // System.Boolean isFrom
    // Size: 0x1
    // Offset: 0x98
    bool isFrom;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // System.Boolean isBlendable
    // Size: 0x1
    // Offset: 0x99
    bool isBlendable;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // System.Boolean isRecyclable
    // Size: 0x1
    // Offset: 0x9A
    bool isRecyclable;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // System.Boolean isSpeedBased
    // Size: 0x1
    // Offset: 0x9B
    bool isSpeedBased;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // System.Boolean autoKill
    // Size: 0x1
    // Offset: 0x9C
    bool autoKill;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: autoKill and: duration
    char __padding20[0x3] = {};
    // System.Single duration
    // Size: 0x4
    // Offset: 0xA0
    float duration;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // System.Int32 loops
    // Size: 0x4
    // Offset: 0xA4
    int loops;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // DG.Tweening.LoopType loopType
    // Size: 0x4
    // Offset: 0xA8
    ::DG::Tweening::LoopType loopType;
    // Field size check
    static_assert(sizeof(::DG::Tweening::LoopType) == 0x4);
    // System.Single delay
    // Size: 0x4
    // Offset: 0xAC
    float delay;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean <isRelative>k__BackingField
    // Size: 0x1
    // Offset: 0xB0
    bool isRelative;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isRelative and: easeType
    char __padding25[0x3] = {};
    // DG.Tweening.Ease easeType
    // Size: 0x4
    // Offset: 0xB4
    ::DG::Tweening::Ease easeType;
    // Field size check
    static_assert(sizeof(::DG::Tweening::Ease) == 0x4);
    // DG.Tweening.EaseFunction customEase
    // Size: 0x8
    // Offset: 0xB8
    ::DG::Tweening::EaseFunction* customEase;
    // Field size check
    static_assert(sizeof(::DG::Tweening::EaseFunction*) == 0x8);
    // public System.Single easeOvershootOrAmplitude
    // Size: 0x4
    // Offset: 0xC0
    float easeOvershootOrAmplitude;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single easePeriod
    // Size: 0x4
    // Offset: 0xC4
    float easePeriod;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.String debugTargetId
    // Size: 0x8
    // Offset: 0xC8
    ::StringW debugTargetId;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // System.Type typeofT1
    // Size: 0x8
    // Offset: 0xD0
    ::System::Type* typeofT1;
    // Field size check
    static_assert(sizeof(::System::Type*) == 0x8);
    // System.Type typeofT2
    // Size: 0x8
    // Offset: 0xD8
    ::System::Type* typeofT2;
    // Field size check
    static_assert(sizeof(::System::Type*) == 0x8);
    // System.Type typeofTPlugOptions
    // Size: 0x8
    // Offset: 0xE0
    ::System::Type* typeofTPlugOptions;
    // Field size check
    static_assert(sizeof(::System::Type*) == 0x8);
    // private System.Boolean <active>k__BackingField
    // Size: 0x1
    // Offset: 0xE8
    bool active;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // System.Boolean isSequenced
    // Size: 0x1
    // Offset: 0xE9
    bool isSequenced;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isSequenced and: sequenceParent
    char __padding35[0x6] = {};
    // DG.Tweening.Sequence sequenceParent
    // Size: 0x8
    // Offset: 0xF0
    ::DG::Tweening::Sequence* sequenceParent;
    // Field size check
    static_assert(sizeof(::DG::Tweening::Sequence*) == 0x8);
    // System.Int32 activeId
    // Size: 0x4
    // Offset: 0xF8
    int activeId;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // DG.Tweening.Core.Enums.SpecialStartupMode specialStartupMode
    // Size: 0x4
    // Offset: 0xFC
    ::DG::Tweening::Core::Enums::SpecialStartupMode specialStartupMode;
    // Field size check
    static_assert(sizeof(::DG::Tweening::Core::Enums::SpecialStartupMode) == 0x4);
    // System.Boolean creationLocked
    // Size: 0x1
    // Offset: 0x100
    bool creationLocked;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // System.Boolean startupDone
    // Size: 0x1
    // Offset: 0x101
    bool startupDone;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean <playedOnce>k__BackingField
    // Size: 0x1
    // Offset: 0x102
    bool playedOnce;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: playedOnce and: position
    char __padding41[0x1] = {};
    // private System.Single <position>k__BackingField
    // Size: 0x4
    // Offset: 0x104
    float position;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // System.Single fullDuration
    // Size: 0x4
    // Offset: 0x108
    float fullDuration;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // System.Int32 completedLoops
    // Size: 0x4
    // Offset: 0x10C
    int completedLoops;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Boolean isPlaying
    // Size: 0x1
    // Offset: 0x110
    bool isPlaying;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // System.Boolean isComplete
    // Size: 0x1
    // Offset: 0x111
    bool isComplete;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isComplete and: elapsedDelay
    char __padding46[0x2] = {};
    // System.Single elapsedDelay
    // Size: 0x4
    // Offset: 0x114
    float elapsedDelay;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // System.Boolean delayComplete
    // Size: 0x1
    // Offset: 0x118
    bool delayComplete;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: delayComplete and: miscInt
    char __padding48[0x3] = {};
    // System.Int32 miscInt
    // Size: 0x4
    // Offset: 0x11C
    int miscInt;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    public:
    // Get instance field reference: public System.Single timeScale
    [[deprecated("Use field access instead!")]] float& dyn_timeScale();
    // Get instance field reference: public System.Boolean isBackwards
    [[deprecated("Use field access instead!")]] bool& dyn_isBackwards();
    // Get instance field reference: public System.Object id
    [[deprecated("Use field access instead!")]] ::Il2CppObject*& dyn_id();
    // Get instance field reference: public System.String stringId
    [[deprecated("Use field access instead!")]] ::StringW& dyn_stringId();
    // Get instance field reference: public System.Int32 intId
    [[deprecated("Use field access instead!")]] int& dyn_intId();
    // Get instance field reference: public System.Object target
    [[deprecated("Use field access instead!")]] ::Il2CppObject*& dyn_target();
