// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Facebook.WitAi.Configuration.WitConfigurationData
#include "Facebook/WitAi/Configuration/WitConfigurationData.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Type namespace: Facebook.WitAi.Data.Configuration
namespace Facebook::WitAi::Data::Configuration {
  // Forward declaring type: WitApplication
  class WitApplication;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Facebook::WitAi::Data::Configuration::WitApplication);
DEFINE_IL2CPP_ARG_TYPE(::Facebook::WitAi::Data::Configuration::WitApplication*, "Facebook.WitAi.Data.Configuration", "WitApplication");
// Type namespace: Facebook.WitAi.Data.Configuration
namespace Facebook::WitAi::Data::Configuration {
  // Size: 0x40
  #pragma pack(push, 1)
  // Autogenerated type: Facebook.WitAi.Data.Configuration.WitApplication
  // [TokenAttribute] Offset: FFFFFFFF
  class WitApplication : public ::Facebook::WitAi::Configuration::WitConfigurationData {
    public:
    public:
    // public System.String name
    // Size: 0x8
    // Offset: 0x18
    ::StringW name;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String id
    // Size: 0x8
    // Offset: 0x20
    ::StringW id;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String lang
    // Size: 0x8
    // Offset: 0x28
    ::StringW lang;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.Boolean isPrivate
    // Size: 0x1
    // Offset: 0x30
    bool isPrivate;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isPrivate and: createdAt
    char __padding3[0x7] = {};
    // public System.String createdAt
    // Size: 0x8
    // Offset: 0x38
    ::StringW createdAt;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    public:
    // Deleting conversion operator: operator ::Facebook::WitAi::Data::Configuration::WitConfiguration*
    constexpr operator ::Facebook::WitAi::Data::Configuration::WitConfiguration*() const noexcept = delete;
    // Get instance field reference: public System.String name
    [[deprecated]] ::StringW& dyn_name();
    // Get instance field reference: public System.String id
    [[deprecated]] ::StringW& dyn_id();
    // Get instance field reference: public System.String lang
    [[deprecated]] ::StringW& dyn_lang();
    // Get instance field reference: public System.Boolean isPrivate
    [[deprecated]] bool& dyn_isPrivate();
    // Get instance field reference: public System.String createdAt
    [[deprecated]] ::StringW& dyn_createdAt();
    // public System.Void .ctor()
    // Offset: 0x16741C4
    // Implemented from: Facebook.WitAi.Configuration.WitConfigurationData
    // Base method: System.Void WitConfigurationData::.ctor()
    // Base method: System.Void Object::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static WitApplication* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::Facebook::WitAi::Data::Configuration::WitApplication::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<WitApplication*, creationType>()));
    }
  }; // Facebook.WitAi.Data.Configuration.WitApplication
  #pragma pack(pop)
  static check_size<sizeof(WitApplication), 56 + sizeof(::StringW)> __Facebook_WitAi_Data_Configuration_WitApplicationSizeCheck;
  static_assert(sizeof(WitApplication) == 0x40);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: Facebook::WitAi::Data::Configuration::WitApplication::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
